[
  {
    "id": "14f9032c-6559-4b1a-aad8-fd52f6618931",
    "type": "Full Time",
    "url": "https://jobs.github.com/positions/14f9032c-6559-4b1a-aad8-fd52f6618931",
    "created_at": "Sat Jul 18 00:24:59 UTC 2020",
    "company": "www.strategybox.com",
    "company_url": "http://www.strategybox.com",
    "location": "Vancouver",
    "title": "Front End Developer",
    "description": "<p>Do you find yourself looking at apps and noting how they've used negative space poorly?</p>\n<p>Want to work with an engaged group of people who are interested in seeing you stretch yourself, deepen your craft and have fun?</p>\n<p>StrategyBox is venture-backed platform, growing 300% month-over-month, making it easy to understand how marketing drives sales. Then using ML to recommend what to do next to drive up sales. We’re looking for a Front-End Developer to revamp our Dashboards and User Platform.</p>\n<p>You’d be working with a team that’s spent 10+ years leading marketing attribution for the likes of Dell and Mediacom, love to laugh and build things that work really well and help our customers grow.</p>\n<p>We want you to be 92 years old, looking back at your life and saying \"I did the most fulfilling work of my career at StrategyBox. I'm still in touch with people I met there today.\"</p>\n<p>About StrategyBox</p>\n<p>StrategyBox is a marketing analytics suite that puts marketing and customer data in one spot. Benchmarks performance against competitors and calculates Influencer ROI. Then recommends what to do next to drive up results.</p>\n<p>We are well capitalized with a sustainable, scalable business model. Our Leadership Team's ambition is a global business that runs like a Swiss watch. So we can run far, and fast, together.</p>\n<p>Why Work for Us</p>\n<p>We're an organization where 'A Players' do the best work of their careers. Think NASA in the late 60's, Mid-90's Chicago Bulls or Tom Ford-era Gucci.</p>\n<p>We do this by giving you the field of play, the rules of the game and clear goals.</p>\n<p>Whether that's Accounts Payable or Database Engineering you bring your full Self to work every day to execute to your fullest potential.</p>\n<p>Our promise to you:</p>\n<ul>\n<li>\n<p>You understand how your work impacts the business we're building.</p>\n</li>\n<li>\n<p>You'll do work that is fulfilling and fun with a group people genuinely interested in seeing you do well.</p>\n</li>\n<li>\n<p>You're treated like a responsible adult. Want to take time off? Cool. Just ensure your deliverables are met when you said they were going to be.</p>\n</li>\n</ul>\n<p>What we ask of you:</p>\n<ul>\n<li>\n<p>You Know What Lights You Up - you've found that thing - making order out of chaos or creating elegant code - that sparks your sense of 'Whoa. This is fun.'</p>\n</li>\n<li>\n<p>100% Responsible - you are responsible for your thoughts, feelings and actions. You take ownership of      how you respond to situations. Owning the outcomes of your actions and the      results of your work.</p>\n</li>\n<li>\n<p>Be Present - you have practices to keep you 'in the moment,' and a chattering mind at bay, so you can do your best work.</p>\n</li>\n<li>\n<p>Integrity - any of your actions, messages or conversations could be reprinted on the NYTimes.com homepage and you would feel comfortable.</p>\n</li>\n<li>\n<p>A Good Laugh - you realize we're not getting out of this 'Life' thing alive and you might as well laugh. A lot.</p>\n</li>\n</ul>\n<p>The Role</p>\n<p>A pragmatic front-end developer is required to build up, adapt, and maintain client-side applications and interfaces for both internal and external use.  You’ll work closely with our CTO, Lead Developer and CEO to produce simple-to-use and easy-to-comprehend tools to interface with APIs.</p>\n<p>You Have Experience With</p>\n<ul>\n<li>\n<p>3+ years building software</p>\n</li>\n<li>\n<p>HTML, CSS and Javascript</p>\n</li>\n<li>\n<p>React and surrounds</p>\n</li>\n<li>\n<p>Working with APIs</p>\n</li>\n<li>\n<p>Git</p>\n</li>\n</ul>\n<p>As well as excellent communication skills, and familiarity with the computer sciences.  Some familiarity with Python, Linux and business intelligence tools would be beneficial, but is not necessary.</p>\n<p>Candidates with public GitHub, BitBucket, or similar profile and samples preferred.</p>\n<p>For the right candidate, we offer</p>\n<ul>\n<li>\n<p>A work culture that respects your time and energy</p>\n</li>\n<li>\n<p>Competitive salary and profit sharing</p>\n</li>\n<li>\n<p>Unlimited Vacation</p>\n</li>\n<li>\n<p>Extended Healthcare Benefits</p>\n</li>\n<li>\n<p>A beautiful office in downtown Vancouver or option to work remotely</p>\n</li>\n<li>\n<p>Skilled and friendly coworkers with diverse interests</p>\n</li>\n</ul>\n<p>Interested in Applying? Here's the Process:</p>\n<p>Prepare a cover letter that outlines what interests you about this position, any questions you have and points us to your LinkedIn, GitHub, BitBucket or similar profile.</p>\n<p>Send that to <a href=\"mailto:jobs@strategybox.com\">jobs@strategybox.com</a>.</p>\n<p>If selected, you'll go through three interviews:</p>\n<p>Preliminary Interview</p>\n<p>Technical Review</p>\n<p>Culture Fit Interview</p>\n<p>For some applicants we also will offer a short, paid project to ensure you like the work and what we're up to.</p>\n<p>We're looking forward to meeting you!</p>\n",
    "how_to_apply": "<p>Email a cover letter that outlines what interests you about this position, any questions you have and points us to your LinkedIn, GitHub, BitBucket or similar profile to <a href=\"mailto:jobs@strategybox.com\">jobs@strategybox.com</a></p>\n",
    "company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBa2FHIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--99e3b3f3397d9a5b63d69cb04d9c425bd97d47ff/SB_LogoTag_WEB.jpg"
  },
  {
    "id": "a73a21f9-4cdb-47e9-b231-4c81eda6f514",
    "type": "Full Time",
    "url": "https://jobs.github.com/positions/a73a21f9-4cdb-47e9-b231-4c81eda6f514",
    "created_at": "Fri Jul 17 19:14:12 UTC 2020",
    "company": "Bitovi",
    "company_url": "http://Bitovi",
    "location": "USA",
    "title": "JavaScript Developer",
    "description": "<p><strong>ABOUT BITOVI:</strong></p>\n<p>Bitovi helps companies create better web applications.</p>\n<p>We have a track record of designing and building high-profile and amazing web applications through our active Consulting practice.  Our apps are built with tests, full docs and a deployment process in place. We created the open source tools powering the applications we build.</p>\n<p>Bitovi has been a pioneer in producing advanced JavaScript frameworks and tools for almost a decade. We develop and maintain several open source products such as CanJS, DoneJS, and StealJS to name a few.</p>\n<p>Our team is comprised of about 30ish developers and designers located around the US and Canada.. This is a remote, full-time position.  Due to travel requirements, at this time we are seeking candidates in the US who are willing and able to travel (once travel resumes after COVID-19).  Future travel will average approximately 1 week every 6-8 weeks.</p>\n<p>Our article, <a href=\"https://www.bitovi.com/blog/hello-potential-bitovian\">Hello Potential Bitovian</a> sums it up very well (NOTE: a good short read for interested candidates!)</p>\n<p><strong>WHAT WE’RE LOOKING FOR:</strong></p>\n<p>We are looking for highly qualified individuals with:</p>\n<ul>\n<li>a good understanding of Computer Science (CS degree, or equivalent knowledge is required)</li>\n<li>a solid background in Modern Front End Development, including JavaScript frameworks</li>\n<li>3+ years professional experience developing enterprise applications</li>\n<li>strong communication and interpersonal skills who are comfortable interacting with clients</li>\n<li>React or Angular experience a bonus!  (Please note in your intro)</li>\n</ul>\n<p>We welcome diversity and non-traditional paths into the developer profession, and advocate strongly for hiring the right person as opposed to the right combination of tech keywords.</p>\n<p><strong>THE JOB:</strong></p>\n<p>You’ll work with clients to create applications, discussing and designing architectures, reviewing code, and researching new front-end technologies.</p>\n<p>You’ll work with other Bitovians, helping us to advance, improve, and evolve our Open Source toolset.</p>\n<p>You’ll have the opportunity to shape a small and growing company by applying your talent and passion to the JavaScript community in your own way.</p>\n<p>We support the technical growth and development of our employees. We have an open and engaging community of skilled developers with whom you can collaborate and learn with.</p>\n<p>Bitovians often:</p>\n<ul>\n<li>Present at conferences</li>\n<li>Give trainings</li>\n<li>Plan and run meetups</li>\n<li>Create and maintain open source projects</li>\n<li>Write articles</li>\n</ul>\n<p><strong>A LITTLE BIT MORE:</strong></p>\n<p>We welcome individuals who enjoy identifying the hard parts of application development and simplifying them, talking about software architecture, and teaching others. We also want someone who can lead others and be an integral part of a team.</p>\n<p>Specifically, the following attributes are major positives:\nHas an eagerness to learn and execute in the “the right way”\nIs open minded about development best practices\nHas some experience with back-end systems and databases\nSome experience contributing to or using open source projects</p>\n<p><strong>BENEFITS:</strong>\nBitovians get a slate of great benefits. Bitovi offers:</p>\n<ul>\n<li>Competitive salary and yearly bonuses</li>\n<li>Bi-annual company retreats to places like Las Vegas, New Orleans, and Amelia Island, Florida</li>\n<li>401(k) plan with matching</li>\n<li>4 weeks of paid vacation</li>\n<li>Health and dental insurance</li>\n<li>LTD and Life Insurance</li>\n<li>Gym membership reimbursement</li>\n<li>Paid Maternity &amp; Paternity leave</li>\n<li>Working from home with flexible hours</li>\n</ul>\n",
    "how_to_apply": "<p><strong>HOW TO APPLY:</strong></p>\n<p>Write a resume and a thoughtful introduction (cover letter!) that shows us that you’re the kind of person we’ve described above.  Your thoughtful introduction should cover why you are interested in this role, something you recently worked on and are proud of, and a fun fact about yourself.  Don't skip this part !\nUse <a href=\"https://bitovi.applytojob.com/apply/91twbGiFxB/JavaScript-Developer-And-Consultant-Remote?source=github\">this link</a> to apply.</p>\n<p>*Please note that we are not interested in working with Recruiters or Hiring firms at this time.</p>\n",
    "company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBajZHIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--1e278bf6fa174e78ad5bba5b2df50361a2296861/bitovi_bits_red.png"
  },
  {
    "id": "f1884b46-ecb4-473c-81f5-08d9bf2ab3bb",
    "type": "Full Time",
    "url": "https://jobs.github.com/positions/f1884b46-ecb4-473c-81f5-08d9bf2ab3bb",
    "created_at": "Thu Jul 16 12:03:19 UTC 2020",
    "company": "Adswizz",
    "company_url": "https://www.adswizz.com/",
    "location": "Bucharest",
    "title": "Cloud DevOps Engineer",
    "description": "<p>For our Global Operations team in Bucharest, located at the 35th floor in Sky Tower building (highest in Romania), we are hiring a Cloud DevOps Engineer.</p>\n<p>As a Cloud DevOps Engineer you will:\n– Be curious. You ask \"why\"?, you explore, you’re not afraid to blurt out your crazy idea\n– Code the infrastructure to act as designed\n– Improve the whole life-cycle of services from design, through deployment, operation and refinement\n– Maintain services once they are live by measuring and monitoring availability, latency and overall system health\n– Scale systems sustainably through mechanisms like automation, and evolve systems by pushing for changes that improve reliability and velocity\n– Practice sustainable incident response and blameless postmortems\n– Have an opinion on any/all of the following orchestration tools\n– Be an audiophile – Interested in all things audio including but not limited to: sound quality, streaming technologies and best bands of 21st century</p>\n<p>What you bring to the team:\n– Bachelor Degree in Computer Science, Mathematics and Informatics or equivalent\n– At least 2 years of experience working on large-scale distributed systems\n– Experience running Linux-based production systems\n– Your thinking starts with the desire for high availability\n– Your love for the command line and scripting development\n– Experience with Amazon AWS services (EC2, S3, ELB, …)\n– Experience with or related technologies like Puppet, Ansible, Nagios, Grafana, Prometheus, HAProxy, NGinx, Apache, MySQL/MariaDB, Kubernetes, Kafka, Hadoop\n– CI/CD for both infrastructure and applications</p>\n<p>Our offer (bonuses, benefits) – what’s in it for you:</p>\n<ul>\n<li>Casual &amp; friendly working environment with opportunities to impact the company with your ideas and involvement</li>\n<li>We have a start-up culture, product-centric, international/multi-cultural environment in each office and easy going communication style (even with Top Management)</li>\n<li>Technology diversity, interesting technical exposure in building the best ad-tech product on the market</li>\n<li>Flexible working schedule and work-from-home option, within predefined rules</li>\n<li>Individual training budget to use as you like for career improvement</li>\n<li>Bonus system, on top of base salary, paid quarterly (for real, not just on paper)</li>\n<li>Paid days off related to quarterly performance</li>\n<li>Day off on your birthday (or within that month if it falls on the weekend)</li>\n<li>Sports bonus for activities such as gym, dances, yoga, etc.</li>\n<li>We encourage your healthy life-style with company paid enrollment for running or biking events</li>\n<li>Meal tickets</li>\n<li>Gift cards for special events (e.g.: Easter, 1st of June, 8th of March, Christmas)</li>\n<li>Medical coverage to keep you healthy</li>\n<li>Parking lots at Sky Tower</li>\n<li>AdsWizz technical books library – you can propose new technical books to be bought by the company</li>\n<li>Bookster subscription</li>\n<li>Good hardware devices (new laptops / Mac’s, displays etc.)</li>\n<li>Office relaxation areas (ping-pong, foosball etc.)</li>\n<li>Team buildings – each team goes on outings to keep that flame alive</li>\n<li>Annual Christmas party – the best company party you’ve ever seen</li>\n<li>Family events (e.g.: Halloween and Christmas party for employees’ kids)</li>\n<li>Themed team events nights (casino night, boardgames night, scary movies night, etc.)</li>\n<li>Catered lunch-time meetings</li>\n<li>We have weekly fresh fruit along with coffee and tea to keep that brain in top shape, orange juice &amp; vending machine on premise as well</li>\n<li>CSR activities (cake auctions, yard sales, blood donation campaigns at our office)\nWanna see how Belgian chocolate goes with technology? Come and join a community of the smartest folks you’ve ever met, that want to aim for the sky and want to use their skills to make a difference!</li>\n</ul>\n",
    "how_to_apply": "<p><a href=\"https://www.adswizz.com/our-careers#!/job/4528257002?utm_source=github&amp;utm_medium=smartdreamers&amp;utm_campaign=July_2020_%7C_Cloud_DevOps_Engineer_%7C_Bucharest\">https://www.adswizz.com/our-careers#!/job/4528257002?utm_source=github&amp;utm_medium=smartdreamers&amp;utm_campaign=July_2020_%7C_Cloud_DevOps_Engineer_%7C_Bucharest</a></p>\n",
    "company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBanFHIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--0903e54cc814013e7ce5b39a629717629e033a4e/Adswizz.png"
  },
  {
    "id": "11cbce13-e6cd-4c79-b904-d292b569b22f",
    "type": "Full Time",
    "url": "https://jobs.github.com/positions/11cbce13-e6cd-4c79-b904-d292b569b22f",
    "created_at": "Wed Jul 15 12:17:30 UTC 2020",
    "company": "OpenPlay",
    "company_url": "http:",
    "location": "Santa Monica",
    "title": "Software Enginee",
    "description": "<h2>Company Description</h2>\n<p><strong>Hello, we’re OpenPlay!</strong></p>\n<p>We’re looking for a full-stack engineer to work with us on our web-based music distribution application. You’ll work with us to design, develop, and deploy new application features for one of the world’s largest record companies. This is a full-time position that can be local (Los Angeles) or fully remote.</p>\n<h2>What’s an OpenPlay?</h2>\n<p>We’re a small software team making distribution and workflow products for some of the world’s largest music companies. We’re big on testing, constant incremental improvement, craftsmanship, and pragmatism, and so far have been able to use those buzzwords to quickly deliver lots of features to keep the music industry running. We strive to make well engineered software that looks great and is friendly to use. We’re collaborative, supportive, enjoy learning, and most of all enthusiastic about building new things and making old things better.</p>\n<h2>Job Description</h2>\n<p><strong>What you’ll be doing:</strong></p>\n<ul>\n<li>\n<strong>Refining requirements.</strong> We follow an agile process focused on rapid incremental delivery. You’ll take rough features born from an interesting idea, a customer request, or an overdue refactor (or a bug), and collaborate designing the user experience and technical direction necessary to release the next (or first) version.</li>\n<li>\n<strong>Programming.</strong> It wouldn’t be an engineering position without some programming. We try to get to this step with minimal planning time so we can see how an idea takes shape in the real world. Our languages of choice are Ruby and Javascript. We tend to practice outside-in development: most features start with a rough end-to-end (or system, or integration, etc.) test, then we attach some UI, give it an endpoint to communicate with, and finally add in the persistence layer. You’ll be responsible for your feature iterations from start to finish, but you’ll have a team to help and design support for visual polish.</li>\n<li>\n<strong>Deploying.</strong> We offload and automate devops as much as possible, but a small part of every feature is still getting it deployed and ensuring it’s working as expected. We deploy features to production a few times per day on a typical day.</li>\n</ul>\n<h2>Skills we’re looking for:</h2>\n<ul>\n<li>\n<strong>Practical experience in full stack web application development.</strong> At least a few years working on both the server and client side of production web applications. Experience with any client/server development (i.e. mobile) would probably also be pretty applicable. Console game development sounds really cool but probably wouldn’t transfer over as well. TI-86 calculator programming experience wouldn’t be a great fit either.</li>\n<li>\n<strong>Academic knowledge of software development.</strong> In addition to being able to make something work, you’ll need to be able to research and articulate why it’s a particularly good solution. A computer science degree is one good barometer we’re looking for, but we understand it’s not the only path to understanding engineering principles and isn't required.</li>\n<li>\n<strong>A desire to collaborate with others.</strong> As a team we often discuss new and better ways to approach problems. We do code reviews and we write comments explaining our rationale when code looks smelly. If you enjoy thinking about new solutions to old problems, and can balance that with small, iterative, deliveries, you’ll probably enjoy working with us.</li>\n</ul>\n<h2>Qualifications</h2>\n<p>Key technology experience:</p>\n<ul>\n<li>\n<strong>Ruby.</strong> Experience with ruby would be ideal, but experience with other object-oriented dynamic languages would transfer over pretty well, especially python (you won’t be the only convert). Extensive experience in any programming language might fit as well. If you’re new to Ruby but enjoy object-oriented programming you’ll probably love it.</li>\n<li>\n<strong>Javascript.</strong> Experience with other semi-prototypal web-browser-based scripting languages with a nonsense hodge-podge standard library would probably transfer over too, but happily for the world we’re not sure any exist. In any case, the more experience you have with Javascript the better.</li>\n<li>\n<strong>Testing.</strong> The heart of our workflow is a full suite of end-to-end tests that we rely on to rapidly and safely build and deploy new features and refactor old code. Prior experience with test driven development or behavior driven development would be a big plus.</li>\n</ul>\n<h2>More specific technologies we use:</h2>\n<ul>\n<li>\n<p>Our server-side code is MVC-structured and built around Sequel (ORM) and Sinatra. If you’re familiar with Rails or similar MVC frameworks you’ll feel at home pretty quickly.</p>\n</li>\n<li>\n<p>Our core distribution product (OpenPlay Music) is a traditional multi-page application driven by server-side HTML and using Javascript to apply bits of dynamic behavior.</p>\n</li>\n<li>\n<p>Our project management and workflow tool is a more recent single-page-application built in React and backed by Ruby communicating over JSON.</p>\n</li>\n<li>\n<p>We enjoy both of them and think they are both appropriate technologies for different types of applications.</p>\n</li>\n<li>\n<p>We do things typical of web applications like:</p>\n<p>º Store data in and query from a relational database (PostgreSQL)</p>\n<p>º Index data and query it with filtering and full text searching (Elasticsearch)</p>\n<p>º Handle slow tasks with background processing</p>\n<p>º Push notifications to clients with WebSockets</p>\n<p>º Export XML files, PDFs, CSVs, Excel spreadsheets, and other formats that just won’t seem to go away</p>\n<p>º Communicate with lots of external systems across all manner of APIs</p>\n<p>º Provide a JSON API for our customers to build on top of</p>\n<p>º Offload as much devops as possible to Heroku</p>\n</li>\n</ul>\n<h2>Additional Information</h2>\n<p><strong>Benefits</strong></p>\n<ul>\n<li>Competitive compensation</li>\n<li>Medical, dental, and vision insurance</li>\n<li>Work life balance: We expect you to generally work 40 hours/week but understand that sometimes it’s summer. We might rarely have a big push where we end up working long hours. The last time this happened was in 2019 for about a week. The time before that was in 2016 for about 3 weeks.</li>\n<li>Flexible work and vacation schedule: We have found so far that if the work is enjoyable it isn’t necessary to police when people are working. So we try to keep the work enjoyable.</li>\n<li>Free to work remote: Our process works just as well in person or remote. It can sometimes even feel remote at the office when we’re sitting next to each other talking on Slack with our headphones in.</li>\n<li>Company Minecraft server with lots of odd elevated stone platforms.</li>\n<li>Office by the beach with a small-but-growing collection of vinyl figurines.</li>\n</ul>\n<p>All your information will be kept confidential according to EEO guidelines.</p>\n<h2>Interested?</h2>\n<p><a href=\"https://vonq.io/38Xr2kJ\">Click here to apply!</a></p>\n",
    "how_to_apply": "<p><a href=\"https://vonq.io/38Xr2kJ\">Click here to apply!</a></p>\n",
    "company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBaGlHIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--768d7d0ec6983dfb25b4a5b7b4cfada6f9846a70/Openplay.jpeg"
  },
  {
    "id": "c41512e4-5cf6-46db-b1a0-898c069b3cec",
    "type": "Full Time",
    "url": "https://jobs.github.com/positions/c41512e4-5cf6-46db-b1a0-898c069b3cec",
    "created_at": "Wed Jul 15 10:10:04 UTC 2020",
    "company": "Future Plc",
    "company_url": "http:",
    "location": "Brno",
    "title": "Senior Software Engineer",
    "description": "<h2>Description</h2>\n<p>About the Team</p>\n<p>Technology &amp; Engineering is a globally distributed central team focussed on delivering an innovative, modern, scalable and reusable proprietary tech stack. We work on a service oriented architecture model to support the business’ online operations and growth ambition.Our incredible tech stack also enables content creation, management and distribution for magazines.</p>\n<p>Our technology &amp; engineering philosophy is service oriented architecture with single responsibility service. We work on a principle of 60% design and 40% implementation with modular development to promote reuse, ease for scale and lean in terms of operational cost</p>\n<p>Our architecture design, engineering and development solutions are based on consensus; eliminating split brain and promoting ownership. We encourage small rapid iteration approach to existing products and leverage learning to increase our level of success at the next stage. Optimisation is key and necessary until the point of diminishing return</p>\n<p>As a global team, communication and collaboration is as important as any of the above in order to deliver successfully.</p>\n<p>Job Purpose</p>\n<p>We are currently recruiting for 2 Senior Systems Engineers to join our team. The role can be based in Bath or remotely in the UK.</p>\n<p>As a Senior Systems Engineer, you will be a key member of the Systems Engineering team working extremely closely with the Site Reliability Engineering (SRE) team as well as the Tech Leads in order to ensure successful on-going development of existing and new core and critical web services. You will ensure that technical solutions are of the highest possible standards.</p>\n<p>Key Responsibilities</p>\n<p>You will manage development in one of the product areas including:</p>\n<ul>\n<li>Work with the Systems Engineering team to produce and agree specifications for amending or adding new functionality to primarily single responsibility web services and web applications and to produce realistic development plans for the product (including estimates and dependencies).</li>\n<li>Extensively collaborate with the Site Reliability Engineering (SRE) team in order to enhance existing web services through development and work toward delivering efficient support and maintenance practice which includes systems deployment and monitoring and improve overall development process for developers within the Technology &amp; Engineering department.</li>\n<li>Provide technical leadership for product support to other developers across the department ensuring that problems are resolved in a methodical and timely manner and that progress is communicated effectively to all relevant parties – in particular to liaise with the Web Operations teams when resolving problems.</li>\n<li>You will be the system owner of one or more critical and core web services and/or systems and assist the SRE team with on-call support when and where appropriate.</li>\n<li>Ensure that the deliverables of program design, coding, testing, documentation and implementation are undertaken in line with the specification and that they are completed on time and to a high quality.</li>\n<li>Design and code from the specifications, using agreed standards and tools to achieve a well-engineered result.</li>\n<li>Document all work in accordance with agreed standards.</li>\n<li>Plan and test developments to ensure that the product functions as expected</li>\n<li>Meet regularly with the other web and systems developers, project and product managers and across the Technology &amp; Engineering department to ensure that the technical product designs and implementation are of a consistent standard and technical solution choices are in line with the technical development strategy, as informed by the Chief Technology Officer and the Systems Engineering team.</li>\n<li>Maintain an awareness of developments in the industry and participate in the sharing of knowledge and ideas across the teams.</li>\n<li>Treat all customers and colleagues with respect and to demonstrate a commitment to Future’s Equal Opportunities Policy.</li>\n</ul>\n<p>Please note, occasional out of hours working may be required during peak trading periods.</p>\n<h2>Requirements</h2>\n<p>What do I need to succeed?</p>\n<ul>\n<li>You are a passionate and self-motivated worker; you’re able to work with others to analyse complex problems specifically around scalability, optimisation, resiliency and redundancy.</li>\n<li>You actively encourage collaboration to design the best solutions.</li>\n<li>You are an expert in PHP and write beautiful, SOLID, optimised code</li>\n<li>You have proven track record on successfully delivering web services and/or web applications</li>\n<li>You are able to communicate technical information to non-technical people as needed</li>\n</ul>\n<p>Essential Knowledge, Skills &amp; Experience:</p>\n<ul>\n<li>\n<p>Strong consumer facing web product development experience using OOP/OOD</p>\n</li>\n<li>\n<p>Experience of developing for scalable redundant and resilient web products</p>\n</li>\n<li>\n<p>Strong understanding of distributed systems and messaging services</p>\n</li>\n<li>\n<p>Hands-on experience of designing and implementing custom web services and APIs</p>\n</li>\n<li>\n<p>Experience of integrating with internal and external web services and APIs</p>\n</li>\n<li>\n<p>Experience in automated deployment and automated regression testing.\nA systematic, disciplined and analytical approach to problem solving – paying close attention to detail</p>\n</li>\n<li>\n<p>Be able to competently plan, schedule and monitor your own and others’ work</p>\n</li>\n<li>\n<p>Be familiar with, and be able to use as directed, all applicable tools, methods, procedures and standards</p>\n</li>\n<li>\n<p>Have an excellent understanding of;</p>\n<p>º Service orientated architectures</p>\n<p>º Event driven/asynchronous architectures</p>\n<p>º Test Driven Development</p>\n<p>º Continuous integration and deployment practices using CI</p>\n<p>º Containerisation via Docker, Kubernetes</p>\n<p>º Web servers – NGINX</p>\n<p>º NoSQL and traditional databases</p>\n<p>º Good software engineering practices including source code versioning and code testing</p>\n</li>\n<li>\n<p>Have full web-stack capability – from document database (Redis, Mongo, Solr/Lucene) and relational database (MySQL – PostgreSQL) to JavaScript to HTML/CSS</p>\n</li>\n</ul>\n<p>Desirable Knowledge, Skills &amp; Experience:</p>\n<ul>\n<li>Open to learning new languages &amp; technologies</li>\n<li>Experience of one or more of the following languages: Golang, Python, Java, Node, Typescript</li>\n<li>Experience of Microservice architectures</li>\n<li>Experience of web and data caching</li>\n<li>Experience operating global services at scale</li>\n<li>Experience with NoSQL technologies</li>\n<li>Experience with RESTFul services</li>\n<li>Experience writing applications optimised for observability (tracing, metrics, structured logging)</li>\n<li>Experience with Lambda/Serverless architectures</li>\n<li>Familiarity with JIRA</li>\n</ul>\n<h2>Benefits</h2>\n<p>What will I get in return?</p>\n<p>As well as our standard benefits, we have a number of awesome perks available to our staff including:</p>\n<ul>\n<li>Unlimited paid time off (yes you read that right!)</li>\n<li>We offer structured career development to all of our people ensuring they have the skills and experience to grow. Our CTO, Kevin Li Ying joined us as a Programmer!</li>\n<li>A share in our success- every member of staff receives a profit pool bonus at the end of our financial year</li>\n<li>Free food (monthly munchies, bagel Fridays, fresh fruit &amp; snacks and coffee and tea on tap)</li>\n<li>Central office locations with cool open plan working spaces as well as plenty of flexibility to work remotely</li>\n<li>Free digital magazine subscriptions and access to back copies of our print magazines and bookazines</li>\n<li>Discounted gym membership and onsite health &amp; wellbeing (yoga at lunch anyone?!)</li>\n<li>Annual Future conference – get together with your colleagues to celebrate success and look forward to what’s next</li>\n<li>Regular staff socials arranged by our wonderful Community &amp; Culture committees</li>\n<li>Huge opportunities to learn and develop whether through professional qualifications, exposure to incredible business projects or informal lunch &amp; learns, hosted by your colleagues</li>\n</ul>\n<h2>Interested in this position?</h2>\n<p>We are happy to get in touch with you! You can send your application by using <a href=\"https://vonq.io/2CpxZyN\">this link</a>.</p>\n",
    "how_to_apply": "<p><a href=\"https://vonq.io/2CpxZyN\">Click here to apply!</a></p>\n",
    "company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBaFdHIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--de57b3345bdec3a420dec96845137ed48fe11333/Future.jpg"
  },
  {
    "id": "ef8233e5-4064-4c2b-b8a4-7e0259c1e521",
    "type": "Full Time",
    "url": "https://jobs.github.com/positions/ef8233e5-4064-4c2b-b8a4-7e0259c1e521",
    "created_at": "Tue Jul 14 15:54:37 UTC 2020",
    "company": "Kelsus Inc",
    "company_url": null,
    "location": "Argentina",
    "title": "Senior Front End Developer",
    "description": "<h2>Senior Front End Developer</h2>\n<h3>Seeking Fulltime Employee in Argentina</h3>\n<p>Kelsus is seeking a senior front end developer with a strong work ethic who cares about quality and has fun bringing web applications to life. We have a new, greenfield project for you, and you will have the opportunity to design and build it according to your own preferences and experience. We’re open to developers using Vue or React (not Angular), but we will ask why you make the choices you make and you will create well organized, maintainable, efficient code. You can work from home either in the Buenos Aires area or in Resistencia or Corrientes.</p>\n<h3>Responsibilities:</h3>\n<ul>\n<li>Build the front end code — javascript, html, css — for a new software application from scratch (You can use React.js or Vue, you can also use Redux or Next.js. You must be able to clearly articulate why you would make various technical choices in English in an interview.)</li>\n<li>Balance speed and quality. How fast can you go while still being careful to test and think through different scenarios?</li>\n<li>Code reviews and mentoring of new developers as they are added to the project -- you will be the first developer</li>\n</ul>\n<h3>Requirements:</h3>\n<ul>\n<li>Minimum 4 years of front end development experience.</li>\n<li>Experience in more than one front end framework.</li>\n<li>Some back end experience is a bonus.</li>\n<li>Clear and comfortable command of English is a must. The interview will be in English with native English speakers.</li>\n</ul>\n<h3>Qualities:</h3>\n<ul>\n<li>You take pride in delivering world-class, intuitive, easy-to-use software — you think like a user.</li>\n<li>You understand that simple is better than complicated (but also know this is more challenging to achieve).</li>\n<li>You are detail-oriented.  Your dot your \"i's\" and cross your \"t's\".</li>\n<li>You enjoy challenges and are persistent in tackling them. You know when to ask for help.</li>\n</ul>\n",
    "how_to_apply": "<p>Fill out the form here: <a href=\"https://hire.withgoogle.com/public/jobs/kelsuscom/view/P_AAAAAADAAETA-0uaOgfzE0\">https://hire.withgoogle.com/public/jobs/kelsuscom/view/P_AAAAAADAAETA-0uaOgfzE0</a></p>\n",
    "company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBaEtHIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--1dae958f9e55e7a40f1f90fccacfecb29cbf8b50/kelsus_logo01.png"
  },
  {
    "id": "478f76cf-7608-48a3-a07d-5f2281763349",
    "type": "Full Time",
    "url": "https://jobs.github.com/positions/478f76cf-7608-48a3-a07d-5f2281763349",
    "created_at": "Tue Jul 14 12:01:35 UTC 2020",
    "company": "Microsoft Israel R&D Center",
    "company_url": "http://www.microsoft.com",
    "location": "Tel-Aviv-Yafo",
    "title": "Senior Software Engineer - Azure Networking",
    "description": "<p>The Azure Networking team continues to innovate across the stack, pushing new scale and features into the cloud and desktop platforms while transforming our infrastructure to meet the growing needs of the 200-plus Microsoft online services, including Office 365, Xbox Live, Skype, OneDrive, Bing, MSN and several hundred thousand customers using Azure to host and run their Cloud Services in over 100 datacenters, running millions of servers and edge computing nodes all over the world.</p>\n<p>Our teams work on the breadth of networking offerings (Networking hardware, optical and IP networks that span subsea, terrestrial and metro fiber, Hybrid services enabling VPN and MPLS connectivity from customers' on premise network to our cloud, Edge services enabling optimized peering and routing, SDN products to enable customers to run their on-premise services in the cloud with Vnet, Load Balancer, Security Groups and Services, Application Gateways, Virtual Appliances to easily mimic on-premise architectures, and DNS services to reach and traffic manage services.</p>\n<p>Software Defined Networking (SDN) enables customers to realize and control the network they desire for their workload in the cloud. This includes traditional enterprise network functions like ACLs, firewalls, load balancers, IPS/IDS, DDoS protection, that customers want to realize in the network for their VMs in the cloud. All these need to be delivered on a shared, very high speed but low-complexity physical network based on merchant silicon. And that is where the software comes in - all these can be realized and delivered in software by building a virtual network on top of physical network, using the virtualized host as the scale-out engine for all our policy, allowing the underlying physical network to be cheap and extremely fast. Creating a new, software controlled virtualized network, optimized for the cloud, represents a once-in-ten-years technological shift. The entire industry is realizing the SDN vision and jumping into it.</p>\n<h2><strong>Responsibilities</strong></h2>\n<p>Azure SDN is opening its first team in Israel to focus on developing a NextGen DDoS protection solution; as customers are bringing their mission critical workloads to Azure that cannot tolerate even small downtimes, the DDoS protection requirements have changed and the traditional way of DDoS mitigation is no longer sufficient to protect customer resources against more frequent, advanced, short-burst and more varied attacks.</p>\n<p>This is an exciting opportunity to be front and center of the two key disruptions happening: cloud and SDN. Come and be part of the core Azure team responsible for building this highly available, robust and large scale technology in cloud. This is a service used by millions of customers every day - a service needing continuous innovation to improve feature offerings, agility, reliability, performance, scale and cost effectiveness.</p>\n<p>We seek candidates with expertise in one or more of the following areas:</p>\n<ul>\n<li>Networking and/or monitoring/diagnostics</li>\n<li>OS internals (networking stack and other OS components); traffic and performance monitoring</li>\n<li>Switching and routing protocols; virtualization (hypervisors; virtual machine switching); distributed systems; directories; distributed hash tables</li>\n<li>Network control planes; programmable networking; control plane, fault, and performance monitoring</li>\n<li>Big data; cloud architecture</li>\n</ul>\n<h2><strong>Qualifications</strong></h2>\n<p>The successful candidate will have:</p>\n<ul>\n<li>8+ years of experience in software development - a must!</li>\n<li>Experience with performance optimization of low level code</li>\n<li>Experience shipping products or services</li>\n<li>Passion and drive for profound impact</li>\n<li>BS or MS degree in Computer Science, or equivalent experiences</li>\n</ul>\n<p>Microsoft is an equal opportunity employer. All qualified applicants will receive consideration for employment without regard to age, ancestry, color, family or medical care leave, gender identity or expression, genetic information, marital status, medical condition, national origin, physical or mental disability, political affiliation, protected veteran status, race, religion, sex (including pregnancy), sexual orientation, or any other characteristic protected by applicable laws, regulations and ordinances. We also consider qualified applicants regardless of criminal histories, consistent with legal requirements. If you need assistance and/or a reasonable accommodation due to a disability during the application or the recruiting process, please send a request via the Accommodation request form.</p>\n<p>Benefits/perks listed below may vary depending on the nature of your employment with Microsoft and the country where you work.</p>\n<h2><strong>Benefits and Perks</strong></h2>\n<ul>\n<li>Industry leading healthcare</li>\n<li>Savings and investments</li>\n<li>Giving programs</li>\n<li>Educational resources</li>\n<li>Maternity and paternity leave</li>\n<li>Opportunities to network and connect</li>\n<li>Discounts on products and services</li>\n<li>Generous time away</li>\n</ul>\n<h2><strong>Interested?</strong></h2>\n<p><a href=\"https://vonq.io/3gYdsQM\">Click here to apply!</a></p>\n",
    "how_to_apply": "<p><a href=\"https://vonq.io/3gYdsQM\">Click here to apply!</a></p>\n",
    "company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBZ3lHIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--85bc00e7293228f24ccd1b329557a49c97a4d84c/companyLogo-microsoft-logo.jpg"
  },
  {
    "id": "a34e33ec-d7b3-4b7f-a3c2-1bf6d91b576a",
    "type": "Full Time",
    "url": "https://jobs.github.com/positions/a34e33ec-d7b3-4b7f-a3c2-1bf6d91b576a",
    "created_at": "Mon Jul 13 11:08:40 UTC 2020",
    "company": "neubau kompass AG",
    "company_url": "https://www.neubaukompass.de/",
    "location": "München",
    "title": "(Senior) Fullstack Developer – PHP / Synfony / JavaScript (m/w/d)",
    "description": "<p>neubau kompass ist nicht umsonst eine der bekanntesten Online-Plattformen für Neubau-Wohnimmobilien. Wir sind so erfolgreich, weil wir nie stehen bleiben und unsere Leistungsqualität immer wieder auf den Prüfstand stellen und verbessern. Unsere Mitarbeiter wissen, dass wir ihnen viel zutrauen. Wir schätzen sie nicht nur als Fachkräfte, sondern auch als Menschen.</p>\n<p>Wir arbeiten mit flachen Hierarchien, bieten spannende Karrieremöglichkeiten sowie eine faire Bezahlung. Unser guter Teamgeist wird von unseren Werten getragen: Engagement, Empathie, Teamgeist und der Willen, sich fachlich weiterzuentwickeln.</p>\n<p><strong>Einleitung</strong></p>\n<p>Sind Sie Experte in PHP, Symfony und aktuellen Frameworks wie React und Angular? Haben Sie Freude daran, Ihr Wissen in Ihr Team zu tragen und macht es Ihnen Spaß, Gutes immer wieder weiterzuentwickeln?\nGehören qualitativ einwandfreie Codes für Sie einfach dazu, und haben Sie vielleicht sogar Führungserfahrung? Werden Sie Teil unseres Teams!</p>\n<p><strong>Für unseren Standort in München suchen wir zum nächstmöglichen Termin eine(n) (Senior) Fullstack Developer – PHP / Symfony / JavaScript (m/w/d) in Vollzeit.</strong></p>\n<p><strong>Diese Aufgaben erwarten Sie bei uns</strong></p>\n<ul>\n<li>Sie übernehmen Verantwortung für die Weiterentwicklung unserer Plattform (Front- und Back-End) und die Implementierung neuer Produkte.</li>\n<li>Sie bringen Ihr Wissen im Team ein und finden zusammen mit Kollegen die besten Lösungen für verschiedene Anforderungen.</li>\n<li>Sie entwickeln Tools und Anwendungen für die interne Verwendung (z.B. Billing, Anbindung Salesforce, APIs).</li>\n<li>Sie arbeiten eng zusammen mit der Produktentwicklung und wirken mit in den Bereichen Anforderungsanalyse, Konzeption und Architektur.</li>\n<li>Sie veranstalten regelmäßige Code-Reviews und sind ständig dabei den Code schlank und elegant zu halten.</li>\n<li>Sie haben die Performance unserer Software (z.B. DB-Queries) immer im Blick.</li>\n<li>Sie planen im Team Sprints und Entwicklungszyklen.</li>\n</ul>\n<p><strong>Das bringen Sie mit</strong></p>\n<ul>\n<li>Studium im Bereich Informatik oder vergleichbare Ausbildung</li>\n<li>Mindestens 5 Jahre Berufserfahrung</li>\n<li>Ausgezeichnete Kenntnisse in der objektorientierten Entwicklung mit PHP</li>\n<li>Ausgezeichnete Kenntnisse in Symfony, MySQL, JavaScript, React, JQuery und Angular</li>\n<li>Selbstverständlicher Umgang mit git, gulp, sass, less, composer, node.js und anderen modernen Frameworks</li>\n<li>Erfahrung in der Implementierung von Test Driven Development</li>\n<li>Erfahrung in der Planung/Umsetzung von Deployment Prozessen (mit Hudson, Jenkins etc.)</li>\n<li>Eine eigenständige und lösungsorientierte Arbeitsweise, Teamfähigkeit, Kommunikationsstärke</li>\n<li>(Erste) Führungserfahrung</li>\n<li>Eine hohe Motivation und Auffassungsgabe sowie ein schnelles Umsetzungsvermögen</li>\n<li>Belastbarkeit, auch unter Zeitdruck</li>\n<li>Grundkenntnisse in Englisch</li>\n<li>HTML5 und CSS3 gehören zum Handwerkszeug</li>\n<li>Erfahrungen mit Kanban oder SCRUM</li>\n<li>Erste Erfahrungen mit DevOps als Methode</li>\n</ul>\n<p><strong>Das bieten wir Ihnen</strong></p>\n<ul>\n<li>Raum für Eigeninitiative &amp; spannende Aufgaben</li>\n<li>Festanstellung in Vollzeit</li>\n<li>Faire Bezahlung</li>\n<li>Flexible Arbeitszeiten und Überstundenausgleich</li>\n<li>Unterstützung bei der fachlichen Weiterbildung</li>\n<li>Kurze Kommunikationswege</li>\n<li>Ein angenehmes Arbeitsklima</li>\n<li>Kompetente, hilfsbereite und engagierte Kollegen</li>\n<li>Kostenlose Getränke: (Milch-)Kaffee, Tee, Mineralwasser</li>\n<li>Hervorragende Anbindung an den MVV</li>\n<li>Kostenfreie Parkplätze</li>\n<li>Top Ausstattung und modernste Büroräume</li>\n</ul>\n<p><strong>Möchten Sie Teil unseres engagierten Teams werden?</strong></p>\n<p>Senden Sie uns Ihre aussagekräftige Bewerbung (inkl. Anschreiben, Lebenslauf, Zeugnisse) über unser Bewerberportal im PDF-Format als einzelne Datei. Bitte geben Sie den frühestmöglichen Eintrittstermin sowie Ihre Gehaltsvorstellungen an!</p>\n<p><img src=\"https://camo.githubusercontent.com/38656dd11d85afc4f0e216add629a2b9831ba564/68747470733a2f2f747261636b696e672e676f686972696e672e636f6d2f682f37303866613531316665373436323138663762666532376561663164616634616264383037653833613338373030623635656661333239656662653266353438\"></p>\n",
    "how_to_apply": "<p><a href=\"https://tracking.gohiring.com/h/5dbeb23b03e4f0e4b007c630c33e9085a467a42de394df39297862e23d5bf338\">application form</a></p>\n",
    "company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBdjZGIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--498a403a4625af49c126d2a54ebd30c393782761/Neubau%20Kompass.jpeg"
  },
  {
    "id": "3c98aa7e-baf1-4e24-9b4a-4f34f0e06755",
    "type": "Full Time",
    "url": "https://jobs.github.com/positions/3c98aa7e-baf1-4e24-9b4a-4f34f0e06755",
    "created_at": "Mon Jul 13 08:24:58 UTC 2020",
    "company": "Instrument Systems Optische Messtechnik GmbH",
    "company_url": "https://www.instrumentsystems.com/en/",
    "location": "München",
    "title": "Softwareentwickler Optische Messtechnik (m/w/d)",
    "description": "<p>Instrument Systems setzt mit hochpräzisen Array-Spektrometern, Farbmesskameras sowie anspruchsvollen System- und Softwarelösungen weltweit Maßstäbe in der Lichtmesstechnik. Internationale Hersteller von LED-Leuchten, Displaytechnik und Automobilzubehör sowie alle wichtigen Prüflabore und Forschungsinstitute zählen zu unseren Kunden. Mit über 280 Mitarbeitern entwickeln und fertigen wir Geräte von höchster Qualität an den Standorten München und Berlin. Als Tochterunternehmen von Konica Minolta profitieren wir dabei von einem starken und globalen Netzwerk.</p>\n<p><strong>Ihre Aufgaben:</strong></p>\n<ul>\n<li>Eigenständige und gewissenhafte Umsetzung der seitens des Produkt Owners formulierten Anforderungen in Software für unser internationales und namhaftes Kundenportfolio</li>\n<li>Verantwortung der bedarfsgerechten und korrekten Implementierung unter Windows in C++ mit Qt unter Einsatz von klassischen und agilen Methoden (Scrum etc.)</li>\n<li>Sicherstellung der Qualität und Wartbarkeit der Software, zum Beispiel durch automatisierte Tests und Code Reviews</li>\n<li>Aufnahme, Untersuchung und Besprechung eventueller anwender-/kundenseitiger Probleme sowie deren Behebung (Bugfixing)</li>\n<li>Software Engineering stets mit Nähe zu unserer Hardware und Geräten in Abstimmung mit internen Ansprechpartnern im R&amp;D Department</li>\n</ul>\n<p><strong>Ihre Voraussetzungen:</strong></p>\n<ul>\n<li>Abgeschlossenes Studium der Ingenieurs- oder Naturwissenschaften, z.B. Informatik, Computational Engineering, Elektro- und Informationstechnik, Physik oder eine vergleichbare Berufsausbildung mit entsprechender einschlägiger Berufserfahrung</li>\n<li>Fundierte Kenntnisse in der objektorientierten Softwareentwicklung in C++</li>\n<li>Idealerweise praktische Erfahrung mit Qt, macOS sowie in der hardwarenahen Softwareentwicklung</li>\n<li>Kenntnisse in der (Licht-)Messtechnik und Optik, in der Bildverarbeitung sowie über Kalibrieranwendungen, Laborsoftware und SDKs ebenso wie in Git, OpenCV, Python, Cmake und GUI Programmierung wären wünschenswert</li>\n<li>Optional sind zudem Erfahrungen in der Koordination von Projekten</li>\n<li>Sehr gute Deutsch- und Englischkenntnisse in Wort und Schrift</li>\n</ul>\n<p>Während einer intensiven Einarbeitungsphase, in der Ihnen erfahrene Kollegen mit Rat und Tat zur Seite stehen, haben Sie die Möglichkeit, unsere Produkte, Dienstleistungen und Entwicklungsmethoden kennenzulernen. Als Mitglied unseres wachsenden, derzeit fünfzehnköpfigen Teams übernehmen Sie dabei Schritt für Schritt die Verantwortung für Ihre Software, deren Entwicklung Sie proaktiv vorantreiben.</p>\n<p>Als innovationsstarkes Technologieunternehmen bauen wir auf das Engagement, die Qualifikation und die Kreativität unser Mitarbeiterinnen und Mitarbeiter. Sie übernehmen gerne Verantwortung für Ihren Aufgabenbereich und möchten sich in herausfordernden Projekten beweisen? Dann freuen wir uns über Ihre aussagekräftige Bewerbung unter Angabe Ihrer Gehaltsvorstellungen.</p>\n<p><img src=\"https://camo.githubusercontent.com/0bdd1c89a1847bd51928d815c8d8ed18ae80e52e/68747470733a2f2f747261636b696e672e676f686972696e672e636f6d2f682f61306261386662666162663166656137306439363961316431313061633431346466373664313665393136663931313138653730393330303432663531623261\"></p>\n",
    "how_to_apply": "<p><a href=\"https://tracking.gohiring.com/h/84dfaf4e2a29b4b20e4c685856e176bb41459ca076d30cba93e21597f3f29297\">application form</a></p>\n",
    "company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBdnlGIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--b2072373de4cbd8945c841efa67cbc3613fad417/Instrument%20Systems.png"
  },
  {
    "id": "ca0b5423-240b-4979-9cab-b863e9a04f4a",
    "type": "Full Time",
    "url": "https://jobs.github.com/positions/ca0b5423-240b-4979-9cab-b863e9a04f4a",
    "created_at": "Fri Jul 10 09:05:14 UTC 2020",
    "company": "Echobot Media Technologies GmbH",
    "company_url": "https://www.echobot.de/",
    "location": "Karlsruhe (Germany)",
    "title": "Fullstack PHP-Entwickler",
    "description": "<p><strong>Fullstack PHP-Entwickler (m/w/d)</strong></p>\n<p>Echobot ist ein führender Anbieter von Cloud Software für Sales &amp; Marketing Intelligence im europäischen Raum. Bereits heute nutzen über 1.000 Unternehmen aller Branchen und Größen die Lösungen von Echobot zur Digitalisierung ihrer Marketing- und Vertriebsprozesse. Deine Aufgabe ist es, unsere Tools noch besser zu machen. Dazu betreust Du deren kompletten Software-Lifecycle-Prozess: von der Konzeption neuer Features über die Implementierung, das Testing und schlussendlich auch deren Betrieb.</p>\n<p><strong>Deine Aufgaben:</strong></p>\n<ul>\n<li>Du entwickelst Frontend, Middleware, Backend und Batch-Prozesse für unsere SaaS-Software.</li>\n<li>Du übernimmst eigene Projekte und triffst selbstständig Entscheidungen.</li>\n<li>Du arbeitest gemeinsam im Team an umfangreicheren Projekten.</li>\n<li>In Deinen Projekten bist Du für den kompletten Software-Lifecycle verantwortlich.</li>\n<li>Du bist im Austausch mit unserer Forschungsabteilung und arbeitest Dich regelmäßig in neueste Technologien ein.</li>\n</ul>\n<p><strong>Was wir Dir bieten:</strong></p>\n<ul>\n<li>Du entscheidest selbst, ob Du 32, 35 oder 40 Stunden arbeiten möchtest (Rufbereitschaft nicht erforderlich).</li>\n<li>Ein familiäres Arbeitsumfeld: Kein Dresscode, Duz-Kultur und regelmäßige Aktivitäten, z.B. der Entwickler-Pub-Abend.</li>\n<li>Bei uns entwickelst Du richtige Software, KEINE Plugins für Shop- oder CMS-Systeme.</li>\n<li>Deine Chefs sind Informatiker und verstehen Dich.</li>\n<li>Wir sind ein technikaffines Unternehmen und möchten Dich langfristig fördern und fordern.</li>\n<li>Die Möglichkeit, Deine Kollegen vor Vertragsunterzeichnung kennen zu lernen.</li>\n<li>Bei uns gibt es eine Kaffee- &amp; Obst-Flatrate sowie eine gratis Snackbox.</li>\n</ul>\n<p><strong>Was Du mitbringen solltest:</strong></p>\n<ul>\n<li>Du bringst ein abgeschlossenes Studium oder relevante Berufserfahrung mit.</li>\n<li>Du besitzt bereits gute Programmierkenntnisse.</li>\n<li>Du kannst gut mit Menschen umgehen und arbeitest gerne im Team.</li>\n<li>Du beherrschst bereits Technologien wie PHP7, Git/Mercurial, Linux, SSH, Mysql/PostgreSQL, Kafka/Redis, Solr/Elasticsearch, AngularJS und VueJS. Den Rest lernst Du bei uns dazu.</li>\n</ul>\n<p><strong>Interessiert?</strong></p>\n<p>Wir freuen uns auf deine Bewerbung. Bitte benutze dafür unser <a href=\"https://ltpx.nl/uvstvZu\"><strong>Online Bewerbungstool</strong></a> und schick uns deine Bewerbungsunterlagen.<img src=\"https://camo.githubusercontent.com/236c66295406e285c463f7442dc7caa1fd75fc52/68747470733a2f2f62636f6e74726f6c2e62726f636b6d657965722e6e6c2f747261636b2e7068703f6f7264657269643d313731373537\"></p>\n",
    "how_to_apply": "<p><a href=\"https://ltpx.nl/dGMnX8Y\">Click here to apply</a></p>\n",
    "company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBdktGIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--98cd645d9fb8945c8109760dd9b0b98d8f3c1e60/echobot-logo-aangepast.jpg"
  },
  {
    "id": "4f42bd23-86c7-40a5-890e-6630567979fd",
    "type": "Full Time",
    "url": "https://jobs.github.com/positions/4f42bd23-86c7-40a5-890e-6630567979fd",
    "created_at": "Wed Jul 08 20:12:44 UTC 2020",
    "company": "Rebilly",
    "company_url": "https://www.rebilly.com/",
    "location": "Remote",
    "title": "Senior PHP Developer",
    "description": "<p>We are looking for a tenacious, passionate, creative, software-driven individual to guide the design and development of our payments software.</p>\n<p><strong>OBJECTIVE #1 Take on a project and see it to its end.</strong></p>\n<ul>\n<li>Potential Obstacles:  We work by 6 week cycles (similar to sprints) where it can be easy to lose focus or forget to plan ahead to ensure the successful completion of your projects.</li>\n<li>Actions:  Understand the value of a successful cycle completion and use your tenacity to carry each project to the very end.</li>\n<li>Results: Your project completion numbers in Jira are stellar and you have concentration available for the handful of projects on your plate.</li>\n</ul>\n<p><strong>OBJECTIVE #2 Work as a synchronous team in a remote environment.</strong></p>\n<ul>\n<li>Potential Obstacles: Working remote has many personal and team-based challenges from timezone differences, to communication and trust of your colleagues.</li>\n<li>Actions: Develop deep working relationships with your colleagues to know what they’re working on, and how to support each other.</li>\n<li>Results: The team culture is strong, Rebilly’s bigger projects efficiently move forward.</li>\n</ul>\n<p><strong>OBJECTIVE #3 Help your colleagues raise their skills with thoughtful code reviews and feedback on ideas.</strong></p>\n<ul>\n<li>Potential Obstacles: Your day will be filled with your own projects and priorities, and offering feedback to a remote team from afar can be intimidating.</li>\n<li>Actions: Prioritize your schedule and share your unique knowledge and experience to help make your team stronger.</li>\n<li>Results: Your team is more precise, creative, and their knowledge is deepened with your help.</li>\n</ul>\n<p><strong>KEY FUNCTIONAL AREAS OF RESPONSIBILITY</strong></p>\n<ul>\n<li>\n<p>What will you manage?\nEach teammate receives a role within a small team per cycle that can include a handful of small projects, one large project, or staying outside of the cycle to support clients, bugs, and cycle planning. Along with that, you’ll be responsible for ensuring adherence to programming and documentation policies, code standards, testing, release, and reporting updates on your projects.</p>\n</li>\n<li>\n<p>What will you contribute to?\nYou will contribute to code reviews, generating projects for each cycle, feedback for ideas (including the ideas for other areas of the company), and hiring new teammates in the Product Team.</p>\n</li>\n<li>\n<p>What will you support?\nOutside of generally supporting your teammates in the Product Circle, Rebilly is an open\nenvironment where everyone is welcome in every area of the company. You are welcome to\nsupport any project you feel called to participate in.</p>\n</li>\n<li>\n<p>How much support per project?\nTeams working in a cycle can be 1, 2, or sometimes 4 people. You will lean on your cycle\nteammates to support the completion of the cycle, as well as receive support from teammates\nsupporting the cycle. You can ask as many teammates to join your project as you need to\ncomplete the mission.</p>\n</li>\n</ul>\n<p><strong>SOME OF THE PROJECTS WE ARE WORKING ON</strong></p>\n<ul>\n<li>Customer Payments Portal - create a secure and highly customizable customer payments portal</li>\n<li>Proficiency in Information Architecture - support usability in our database and more</li>\n<li>Payment Gateway Integrations - expand our library of integrations</li>\n</ul>\n<p><strong>APPLY!</strong></p>\n<p>Please send your resume through Apply By API: <a href=\"https://app.applybyapi.com/posting/7/\">https://app.applybyapi.com/posting/7/</a></p>\n<p><strong>HIRING PROCESS</strong></p>\n<ul>\n<li>Apply By API* -<a href=\"https://app.applybyapi.com/posting/7/\">https://app.applybyapi.com/posting/7/</a>\n</li>\n<li>Small code challenge (unless you have extensive open source contributions)</li>\n<li>Interview with the Product Team</li>\n<li>Interview with the Product Team Lead</li>\n<li>Offer and Hiring</li>\n<li>The total process should take less than 2 weeks.\n*We are only accepting applications through ApplyByAPI at this time.</li>\n</ul>\n<p><strong>WORKING AT REBILLY</strong></p>\n<p>Rebilly’s Purpose: Find and create freedom through your work.</p>\n<p>Rebilly offers a competitive salary, training and development, birthday lunches, and provides the computer of your choosing. Further perks and benefits are dependent on your work location of choice.</p>\n<p>Rebilly is a Teal Organization, meaning our organizational structure may differ than what you’re used to, but we think you’ll be pleasantly surprised. In a very tiny nutshell, this means that as an organization we value self-management, self-organization, as well as the wholeness of the individuals that make up our team (meaning you should be yourself at work, and do the work that inspires you.)</p>\n<p>Come check us out at <a href=\"https://www.rebilly.com/careers/\">https://www.rebilly.com/careers/</a></p>\n<p><strong>ABOUT REBILLY</strong></p>\n<p>Rebilly is now a payments software after pivoting from a focus on subscription billing in October 2019. Rebilly’s comprehensive feature set is built to help our merchants get more of their customers from the order form to the thank you page, and more renewals paid. We took lessons learned from years of experience in the subscription business and millions of subscribers and applied them to make our payment system clever, flexible, and easy to use for our clients.</p>\n",
    "how_to_apply": "<p>Please send your resume through Apply By API: <a href=\"https://app.applybyapi.com/posting/7/\">https://app.applybyapi.com/posting/7/</a></p>\n",
    "company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBdVdGIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--c5e422f1fca48afce371494fe27b986f5f83bb44/rb_LogoColor_Small.jpg"
  },
  {
    "id": "28663c1c-a2e1-4184-ae11-d52230324dc6",
    "type": "Full Time",
    "url": "https://jobs.github.com/positions/28663c1c-a2e1-4184-ae11-d52230324dc6",
    "created_at": "Wed Jul 08 10:08:35 UTC 2020",
    "company": "InVision AG",
    "company_url": "https://www.ivx.com/jobs",
    "location": "Düsseldorf (Germany)",
    "title": "Site Reliability Engineer (SRE) / Cloud Engineer (w/m/d)",
    "description": "<p><strong>Site Reliability Engineer (SRE) / Cloud Engineer (w/m/d)</strong>\n<em>Medienhafen Düsseldorf</em></p>\n<p>Du suchst eine neue Herausforderung? In einem modernen Unternehmen, wo jeder Einzelne etwas bewegen kann? Mit einer Kultur, die von Teamwork, Leidenschaft und Vertrauen geprägt ist?\n<strong>Dann komm zu uns in den Medienhafen Düsseldorf - als Site Reliability Engineer (SRE) / Cloud Infrastructure Engineer (w/m/d)!</strong></p>\n<p><strong>Kurz zu InVision:</strong></p>\n<p>Seit 1995 entwickeln wir unsere eigenen Softwareprodukte, die weltweit von zehntausenden Contact-Center-Mitarbeitern genutzt werden. Unsere Workforce-Management-Software und E-Learnings helfen unseren Kunden, den Einsatz und die Weiterbildung ihres Personals zu optimieren.</p>\n<p><strong>Wie sieht Dein Arbeitsbereich bei uns aus?</strong></p>\n<p>Für unsere Produkte managen wir eine auf Amazon Web Services (AWS) basierende Infrastruktur, u. a. mit mehreren hundert Servern. Wir betrachten unsere Infrastruktur als Code. Hierbei steht die vollständige Automatisierung einer hochverfügbaren und skalierbaren Umgebung immer im Vordergrund. Grundsätzlich kommt bei uns Open-Source-Software zum Einsatz, wie z. B. Docker, Kubernetes, RabbitMQ, PostgreSQL, nginx, Prometheus, Elasticsearch, Kibana und Grafana. Für die Konfiguration unserer Infrastruktur setzen wir u. a. auf Terraform.</p>\n<p><strong>Welche Aufgaben erwarten Dich bei uns?</strong></p>\n<ul>\n<li>Entwickle unsere Infrastruktur aktiv weiter und bringe dabei Deine produktive Erfahrung mit Container-Umgebungen ein.</li>\n<li>Shippe gemeinsam mit Entwicklern Applikationen und Microservices auf Basis von DevOps und Continuous Delivery.</li>\n<li>Arbeite eng mit Software Engineers, UI/UX Designern und Produktmanagern in interdisziplinären Teams zusammen.</li>\n<li>Fördere den Wissensaustausch mit Deinen Kollegen und baue Dein eigenes Expertenwissen weiter aus.</li>\n<li>Gestalte unsere offene und teamorientierte Firmenkultur mit.</li>\n<li>Experimentiere mit neuen Technologien und verlasse regelmäßig Deine Komfortzone, um jeden Tag etwas Neues zu lernen.</li>\n</ul>\n<p><strong>Was bieten wir Dir?</strong></p>\n<ul>\n<li>\n<strong>Gestaltungsfreiraum</strong>: Bring Deine Ideen bei uns ein! Wir geben Dir jede Menge Freiraum für Deine kreative Entfaltung.</li>\n<li>\n<strong>Flexibilität</strong>: Remote arbeiten, Teilzeit, Hilfe beim Umzug - wenn wir zusammen passen, machen wir vieles möglich.</li>\n<li>\n<strong>Weiterbildung</strong>: Erweitere ständig Deinen Horizont! In unseren Open Spaces, bei Workshops und Konferenzen und unseren hauseigenen Meetups und Events.</li>\n<li>\n<strong>Onboarding</strong>: Deine direkten Kollegen arbeiten Dich umfassend ein und stehen Dir bei Fragen jederzeit zur Seite.</li>\n<li>\n<strong>Wohlfühlatmosphäre</strong>: Dazu gehört bei uns ein top-modernes Arbeitsumfeld, eine High-end IT-Ausstattung und tolle Kollegen.</li>\n<li><strong>… und noch vieles mehr!</strong></li>\n</ul>\n<p><strong>Klingt gut? Dann bewirb Dich jetzt!</strong></p>\n<p>Wenn Du Dich als erfahrener SRE, DevOps Engineer oder Cloud Infrastructure Engineer angesprochen fühlst und bei den meisten Punkten oben genickt hast, schick uns doch einfach Deine Bewerbung! Bitte benutze dafür unser <a href=\"https://ltpx.nl/CcspTrb\"><strong>Online Bewerbungstool</strong></a>.</p>\n<p>Übrigens: Für uns bist Du als Gesamtperson mit all Deinen Erfahrungen und bisherigen Projekten wichtiger als eine Palette konkreter Voraussetzungen. Daher ist es auch erst einmal ausreichend, wenn Du uns Deinen Lebenslauf, gerne auch mit Anschreiben, zusendest.</p>\n<p>Oder brauchst Du noch mehr Infos? Dann schau Dir unsere Website an: <a href=\"http://www.ivx.com/jobs\"><strong>www.ivx.com/jobs</strong></a>.<img src=\"https://camo.githubusercontent.com/b0e49bdf5e3927e8336da0c08f5a7bc2e1113364/68747470733a2f2f62636f6e74726f6c2e62726f636b6d657965722e6e6c2f747261636b2e7068703f6f7264657269643d313731383035\"></p>\n",
    "how_to_apply": "<p><a href=\"https://ltpx.nl/HMOsgy4\">Click here to apply</a></p>\n",
    "company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBdHlGIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--652faee59ab7295c68de12df3e7256cec9a9ade4/invision%20ag%20logo.png"
  },
  {
    "id": "68d360da-a1a1-4ea5-9f7e-1aaca538dfb5",
    "type": "Full Time",
    "url": "https://jobs.github.com/positions/68d360da-a1a1-4ea5-9f7e-1aaca538dfb5",
    "created_at": "Tue Jul 07 21:26:13 UTC 2020",
    "company": "Cloudrise",
    "company_url": "http://www.cloudrise.com",
    "location": "United States",
    "title": "Lead Software Developer/Architect aka Guru",
    "description": "<p>Are you bored in your current gig and looking to build something cool? Do you want to work with a passionate, collaborative, and innovative team that values your contributions and lets you be yourself? At Cloudrise we have a proven entrepreneur as our leader, unparalleled experience in the data protection space, a world-class team, and a fresh canvas on which to paint our new masterpiece.</p>\n<p>This is a unique opportunity for someone who wants to be exposed to UI/UX, front-end, and back-end work, with visibility into the full picture of the application. While we don’t expect you to be an expert at everything, we do expect you to be open to new ideas, challenge the norm, be an active listener, and be interested in growing your skills. If you are looking for a “home” where you can make an impact every day, revel in being part of the solution, and enjoy working with a team of driven and passionate professionals, then your search stops here.</p>\n<p>POSITION SUMMARY</p>\n<p>At Cloudrise, we focus on services that reduce data risk for enterprises, leveraging automation to address the needs of the business. We are building a SaaS-based orchestration and automation platform that focuses on data security and privacy.</p>\n<p>We are looking for an experienced Lead Software Developer/Architect to design and build a SaaS based orchestration platform and to help guide decisions for software development. You will see the “big picture” and create architectural approaches for software design and implementation to guide the development team. The goal is to provide a framework for the development of software that will result in high-quality SaaS solutions.</p>\n<p>We are interested in self-motivated technical individuals with excellent problem-solving skills and the ability to prioritize shifting workloads in what is a rapidly evolving technology landscape. We need team players who can easily function in a collaborative, high demand, performance-driven environment.</p>\n<p>DUTIES &amp; ESSENTIAL JOB FUNCTIONS</p>\n<ul>\n<li>Collaborate with the product owner and other members of the Cloudrise team to determine functional and non-functional requirements for new software or applications</li>\n<li>Develop high-level product specifications with attention to system integration and feasibility</li>\n<li>Lead platform implementation</li>\n<li>Investigate new solutions, tools, products, and techniques to incorporate into coding standards</li>\n<li>Help define all aspects of development from appropriate technology and workflow to coding standards</li>\n<li>Communicate successfully all concepts and guidelines to the development team via code reviews and design reviews</li>\n<li>Develop architectural design of platform solution</li>\n<li>Develop build and deployment automation to ensure CI/CD</li>\n<li>Ensure software meets all requirements of quality, security, extensibility etc.</li>\n</ul>\n<p>QUALIFICATIONS</p>\n<ul>\n<li>Proven experience as a software developer and architect</li>\n<li>Experience with security and privacy principles including experience with applied cryptography</li>\n<li>Experience in software development and coding in various languages (Golang, Python, JavaScript, Java, etc.)</li>\n<li>Experience with container-based microservices including Kubernetes</li>\n<li>Excellent knowledge of software and application design and architecture</li>\n<li>Understanding of software quality assurance principles</li>\n<li>A technical mindset with great attention to detail</li>\n<li>Ability to perform complex tasks with minimal supervision and guidance</li>\n<li>Good verbal and written communication skills</li>\n</ul>\n<p>WORK AUTHORIZATION</p>\n<p>United States (Preferred)</p>\n<p>This list of duties and responsibilities is not intended to be all-inclusive and may be expanded to include other duties or responsibilities that management may deem necessary from time to time.</p>\n",
    "how_to_apply": "<p><a href=\"https://app.trinethire.com/companies/28211-cloudrise-inc/jobs/25911-lead-developer-software-architect\">https://app.trinethire.com/companies/28211-cloudrise-inc/jobs/25911-lead-developer-software-architect</a></p>\n",
    "company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBdGVGIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--da4a1f18d32802a5cbad7716e68cc39e02fc3aec/Cloudrise_Logo_Primary%20(1).jpg"
  },
  {
    "id": "ecd9db33-f36a-4b07-8e41-b28113c55069",
    "type": "Full Time",
    "url": "https://jobs.github.com/positions/ecd9db33-f36a-4b07-8e41-b28113c55069",
    "created_at": "Tue Jul 07 18:45:35 UTC 2020",
    "company": "TutorMe",
    "company_url": "https://tutorme.com",
    "location": "Los Angeles",
    "title": "Senior Frontend Engineer",
    "description": "<p><strong>About TutorMe</strong></p>\n<p>TutorMe is the premier online tutoring solution for millions of college students nationwide. Our mission is to level the academic playing field for students everywhere. We believe that every student should have access to incredible tutors regardless of where they go to school or who their parents are.</p>\n<p>We do this by connecting students with the best online tutors in under 30 seconds using a matching system powered by AI. Students can receive help in over 300 subjects via our advanced lesson space, featuring video chat, screen-sharing, virtual whiteboards and much more. TutorMe's national network of online tutors gives students the help they need when they need it.</p>\n<p><strong>What you’ll do</strong></p>\n<ul>\n<li>Maintain updated knowledge of the development industry and any advancements in technology</li>\n<li>Develop a wide-range of new interface features, from landing pages to collaborative tools like our virtual whiteboard and video chat</li>\n<li>Work with a certain degree of technological freedom - while we have our preferences (we love TypeScript and React), we are always looking at new tech and are ready to adopt if it can improve the product or developer experience</li>\n<li>Review designs created by web designers; ask any necessary clarifying questions before starting work</li>\n<li>Tackle high-level tasks and convert product requirements into clean and maintainable code</li>\n<li>Ensure the code is valid, properly structured and compatible with multiple browsers, mobile devices, and operating systems</li>\n<li>Identify and troubleshoot various website issues and coding problems</li>\n<li>Meet tight deadlines as required</li>\n<li>Collaborate with members of the product team, including CTO, product manager, back-end developers, and designers</li>\n</ul>\n<p><strong>What’s required</strong></p>\n<ul>\n<li>5+ years of front-end web development experience</li>\n<li>2+ years of TypeScript and React</li>\n<li>Modern CSS knowledge (Flexbox and Grid)</li>\n<li>General CS knowledge, must understand different programming paradigms and when to use them effectively</li>\n<li>Thorough understanding of how the modern web works - from sending DNS query to rendering performance</li>\n<li>Obsession with writing safe code - we cringe every time we have to use <code>any</code>\n</li>\n<li>Experience with Firebase (Realtime Database / Firestore)</li>\n<li>Experience with real-time web - WebSockets / WebRTC</li>\n<li>Familiarity with Figma or Sketch design tools</li>\n<li>Experience with Automation Testing including Integration Testing</li>\n<li>Experience with VCS, CI, CD</li>\n<li>Must use macOS or Linux (sorry Windows fans)</li>\n<li>Strong communication skills to effectively collaborate with designers, developers, and other relevant staff members or clients</li>\n<li>Willingness to troubleshoot and solve complex problems</li>\n<li>Ability to manage multiple projects and meet deadlines</li>\n<li>Flexibility to adapt to changing instructions and requirements</li>\n</ul>\n<p><strong>What you’ll get</strong></p>\n<ul>\n<li>Competitive salary</li>\n<li>Top-notch health, dental and vision insurance</li>\n<li>401k matching</li>\n<li>Generous vacation and holidays</li>\n<li>All the equipment you need to get the job done</li>\n<li>Opportunity to be a key player at a company that’s quickly redefining the boundaries of on-demand academic support</li>\n</ul>\n<p>If you are not sure that you’re 100% qualified, but up for the challenge - we want you to apply.</p>\n<p>We value diversity of all kinds, and are committed to building a diverse and inclusive workplace where we learn from each other. We are an equal opportunity employer and welcome people of all different backgrounds, experiences, abilities, and perspectives.</p>\n",
    "how_to_apply": "<p><a href=\"https://hire.withgoogle.com/public/jobs/tutormecom/view/P_AAAAAAGAAAzA5uUVdwIDHg?trackingTag=gitHub\">https://hire.withgoogle.com/public/jobs/tutormecom/view/P_AAAAAAGAAAzA5uUVdwIDHg?trackingTag=gitHub</a></p>\n",
    "company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBdEtGIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--001811ef33c9b1b044af101cc88f00f145898850/TutorMe%20547x186%20blue%20transparent-01.png"
  },
  {
    "id": "017fb2de-083e-4680-a167-468469c0d0cc",
    "type": "Full Time",
    "url": "https://jobs.github.com/positions/017fb2de-083e-4680-a167-468469c0d0cc",
    "created_at": "Tue Jul 07 18:38:15 UTC 2020",
    "company": "TutorMe",
    "company_url": "https://tutorme.com",
    "location": "Los Angeles",
    "title": "Senior Backend Engineer",
    "description": "<p><strong>About TutorMe</strong></p>\n<p>TutorMe is the premier online tutoring solution for millions of college students nationwide. Our mission is to level the academic playing field for students everywhere. We believe that every student should have access to incredible tutors regardless of where they go to school or who their parents are.</p>\n<p>We do this by connecting students with the best online tutors in under 30 seconds using a matching system powered by AI. Students can receive help in over 300 subjects via our advanced lesson space, featuring video chat, screen-sharing, virtual whiteboards, and much more. TutorMe's national network of online tutors gives students the help they need when they need it.</p>\n<p><strong>What you’ll do</strong></p>\n<ul>\n<li>Maintain updated knowledge of the development industry and any advancements in technology</li>\n<li>Work with a certain degree of technological freedom - while we have our preferences (we love Python and PostgreSQL), we are always looking at new tech and are ready to adopt if it can improve the product or developer experience</li>\n<li>Tackle high-level tasks and convert product requirements into clean and maintainable code</li>\n<li>Identify and troubleshoot various website issues and coding problems</li>\n<li>Meet tight deadlines as required</li>\n<li>Collaborate with members of the product team, including CTO, product manager, front-end developers, and designers</li>\n</ul>\n<p><strong>What’s required</strong></p>\n<ul>\n<li>7+ years of back-end web development experience</li>\n<li>5+ years of Python, Django, and PostgreSQL</li>\n<li>2+ years of Golang / Erlang</li>\n<li>Obsession with writing safe code</li>\n<li>General CS knowledge, must understand different programming paradigms and when to use them effectively</li>\n<li>Experience with AWS</li>\n<li>Experience with Firebase (Realtime Database / Firestore)</li>\n<li>Experience with real-time web - WebSockets / WebRTC</li>\n<li>Experience with Automation Testing including Integration Testing</li>\n<li>Experience with VCS, CI, CD</li>\n<li>Must use macOS or Linux (sorry Windows fans)</li>\n<li>Strong communication skills to effectively collaborate with designers, developers, and other relevant staff members or clients</li>\n<li>Willingness to troubleshoot and solve complex problems</li>\n<li>Ability to manage multiple projects and meet deadlines</li>\n<li>Flexibility to adapt to changing instructions and requirements</li>\n</ul>\n<p><strong>What you’ll get</strong></p>\n<ul>\n<li>Competitive salary</li>\n<li>Top-notch health, dental and vision insurance</li>\n<li>401k matching</li>\n<li>Generous vacation and holidays</li>\n<li>All the equipment you need to get the job done</li>\n<li>Opportunity to be a key player at a company that’s quickly redefining the boundaries of on-demand academic support</li>\n</ul>\n<p>If you are not sure that you’re 100% qualified, but up for the challenge - we want you to apply.</p>\n<p>We value diversity of all kinds, and are committed to building a diverse and inclusive workplace where we learn from each other. We are an equal opportunity employer and welcome people of all different backgrounds, experiences, abilities, and perspectives.</p>\n",
    "how_to_apply": "<p><a href=\"https://hire.withgoogle.com/public/jobs/tutormecom/view/P_AAAAAAGAAAzM8jUl6JY252?trackingTag=gitHub\">https://hire.withgoogle.com/public/jobs/tutormecom/view/P_AAAAAAGAAAzM8jUl6JY252?trackingTag=gitHub</a></p>\n",
    "company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBdENGIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--6eb02255ac5ef80cd292fa7b89e36eb4fbb6a916/TutorMe%20547x186%20blue%20transparent-01.png"
  },
  {
    "id": "230263f8-14ad-423e-b139-e0aec091ba45",
    "type": "Full Time",
    "url": "https://jobs.github.com/positions/230263f8-14ad-423e-b139-e0aec091ba45",
    "created_at": "Tue Jul 07 13:14:54 UTC 2020",
    "company": "InVision AG",
    "company_url": "https://www.ivx.com/jobs",
    "location": "Leipzig (Germany)",
    "title": "Softwareentwickler / Software Engineer ",
    "description": "<p><strong>Softwareentwickler / Software Engineer (w/m/d)</strong>\n<em>Leipzig</em></p>\n<p>Du suchst eine neue Herausforderung? In einem modernen Unternehmen, wo jeder Einzelne etwas bewegen kann? Mit einer Kultur, die von Teamwork, Leidenschaft und Vertrauen geprägt ist?\n<strong>Dann komm zu uns nach Leipzig - als Software Engineer (w/m/d)!</strong></p>\n<p><strong>Kurz zu InVision:</strong></p>\n<p>Seit 1995 entwickeln wir unsere eigenen Softwareprodukte, die weltweit von zehntausenden Contact-Center-Mitarbeitern genutzt werden. Unsere Workforce-Management-Software und E-Learnings helfen unseren Kunden, den Einsatz und die Weiterbildung ihres Personals zu optimieren.</p>\n<p><strong>Wie sieht Dein Arbeitsbereich bei uns aus?</strong></p>\n<p>Wir entwickeln SaaS-Produkte im Bereich Predictive Analytics und Scheduling, in enger Zusammenarbeit mit unseren Kunden und nach leanen Prinzipien. In unseren interdisziplinären Teams ergänzen sich Softwareentwickler, Mathematiker, Produkt-/Kundenexperten und Designer. Wir haben einen hohen Qualitätsanspruch und setzen auf Methoden und Technologien wie Continuous Delivery, DevOps, TDD, Pair Programming, Kubernetes, Microservices und FaaS.</p>\n<p><strong>Welche Aufgaben erwarten Dich bei uns?</strong></p>\n<ul>\n<li>Entwickle Lösungen für unsere Cloud-Produkte und -Plattformen in Sprachen wie Ruby, TypeScript, Python, Go, Elixir oder JavaScript.</li>\n<li>Implementiere skalierbare Microservices in einem Umfeld verteilter Systeme.</li>\n<li>Stelle Deinen Code in Docker Containern auf unseren Kubernetes Clustern bereit.</li>\n<li>Fördere den Wissensaustausch mit Deinen Kollegen und baue Dein eigenes Expertenwissen weiter aus.</li>\n<li>Gestalte unsere offene und teamorientierte Firmenkultur mit.</li>\n<li>Experimentiere mit neuen Technologien und verlasse regelmäßig Deine Komfortzone, um jeden Tag etwas Neues zu lernen.</li>\n</ul>\n<p><strong>Was bieten wir Dir?</strong></p>\n<ul>\n<li>\n<strong>Gestaltungsfreiraum:</strong> Bring Deine Ideen bei uns ein! Wir geben Dir jede Menge Freiraum für Deine kreative Entfaltung.</li>\n<li>\n<strong>Flexibilität:</strong> Remote arbeiten, Teilzeit, Hilfe beim Umzug - wenn wir zusammen passen, machen wir vieles möglich.</li>\n<li>\n<strong>Weiterbildung:</strong> Erweitere ständig Deinen Horizont! In unseren Open Spaces, bei Workshops und Konferenzen und unseren hauseigenen Meetups und Events.</li>\n<li>\n<strong>Onboarding:</strong> Deine direkten Kollegen arbeiten Dich umfassend ein und stehen Dir bei Fragen jederzeit zur Seite.</li>\n<li>\n<strong>Wohlfühlatmosphäre</strong>: Dazu gehört bei uns ein top-modernes Arbeitsumfeld, eine High-end IT-Ausstattung und tolle Kollegen.</li>\n<li><strong>… und noch vieles mehr!</strong></li>\n</ul>\n<p><strong>Klingt gut? Dann bewirb Dich jetzt!</strong></p>\n<p>Wenn Du Dich als Software Developer, Software Engineer Backend, Frontend Developer oder Full Stack Developer angesprochen fühlst und bei den meisten Punkten oben genickt hast, schick uns doch einfach Deine Bewerbung! Bitte benutze dafür unser <strong><a href=\"https://ltpx.nl/nWmrHon\">Online Bewerbungstoo</a></strong><a href=\"https://ltpx.nl/nWmrHon\"><strong>l</strong></a>.</p>\n<p>Übrigens: Für uns bist Du als Gesamtperson mit all Deinen Erfahrungen und bisherigen Projekten wichtiger als eine Palette konkreter Voraussetzungen. Daher ist es auch erst einmal ausreichend, wenn Du uns Deinen Lebenslauf, gerne auch mit Anschreiben, zusendest.</p>\n<p>Oder brauchst Du noch mehr Infos? Dann schau Dir unsere Website an: <a href=\"http://www.ivx.com/jobs\"><strong>www.ivx.com/jobs</strong></a>.<img src=\"https://camo.githubusercontent.com/090101d058e09303083f3734bb759f7d3529512f/68747470733a2f2f62636f6e74726f6c2e62726f636b6d657965722e6e6c2f747261636b2e7068703f6f7264657269643d313731353337\"></p>\n",
    "how_to_apply": "<p><a href=\"https://ltpx.nl/AqQVa14\">Click here to apply</a></p>\n",
    "company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBc3lGIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--cdeca999ef9825c69dd721a7203376f1631cbbcd/invision%20ag%20logo.png"
  },
  {
    "id": "6e15057c-fc45-4c63-bdad-cdf0b89f105a",
    "type": "Full Time",
    "url": "https://jobs.github.com/positions/6e15057c-fc45-4c63-bdad-cdf0b89f105a",
    "created_at": "Tue Jul 07 09:02:42 UTC 2020",
    "company": "Sonova Marketing GmbH\t",
    "company_url": "https://www.sonova.com",
    "location": "Berlin",
    "title": "Senior Full Stack Engineer (m/f/d)",
    "description": "<p>We are serving a growing global healthcare market segment with a comprehensive range of innovative hearing solutions. We are one of the broadest hearing care providers in the world. Our vision? To create a world where everyone enjoys the delight of hearing and live a life without limitations.</p>\n<p>Our mission is to help people hear the world by providing the most innovative technology, service-oriented dedication and by accepting responsibility for all of our actions. We strive for highest ethical behaviour and unquestionable integrity. These values are at the core of our culture and form an integral part of our endeavour to create sustainable success and value for all our stakeholders.</p>\n<p>We have recently founded a dynamic venture in Berlin facilitating our endeavour to create impactful direct-to-consumer brands in the audiological markets we operate in. As a key contributor to a smaller, yet quickly expanding team, you will have the opportunity to make a significant impact to an exciting new branch of the company.</p>\n<p><strong>Tasks</strong></p>\n<ul>\n<li>Design and develop scalable web applications.</li>\n<li>Take end-to-end responsibility for our frontend and/or backend architecture and work within cross-functional teams.</li>\n<li>Translate designs, wireframes and business requirements into solutions and write high quality, clean, maintainable and testable code.</li>\n<li>Estimate development tasks, and point out risks, required provisions and limitations in the process.</li>\n<li>Create Unit and Integration tests to ensure the quality of code.</li>\n<li>Define release strategies (such as branching, CI and development workflows).</li>\n</ul>\n<p><strong>Requirements</strong></p>\n<ul>\n<li>You hold a BS/MS degree in Computer Science, Mathematics, Engineering or related technical field.</li>\n<li>You have 5+ years of relevant experience.</li>\n<li>You understand frontend, backend and devops to a great degree and have a solid understanding of their respective building blocks.</li>\n<li>You have developed and maintained applications using client side frameworks such as Vue, React or Angular.</li>\n<li>You have a good technical understanding of cloud services offered by platforms such as GCP, AWS or Azure.</li>\n<li>You have built web services and have worked SQL databases such as MariaDB and MSSQL.</li>\n<li>You have a good understanding of the Software Development Life Cycle.</li>\n<li>You can speak and write English fluently.</li>\n<li>You have development experience with Unix/Linux.</li>\n<li>You have a strong capacity to identify requirements and define technical solutions.</li>\n<li>Good to have: You worked in an agency focused on B2C Marketing and are familiar with the basics of Lead Generation Marketing.</li>\n</ul>\n<p><strong>Benefits</strong></p>\n<ul>\n<li>The opportunity to join early and sit in the driver´s seat of a fast growing, performance-oriented international venture</li>\n<li>Continuous professional growth, while working directly with the entrepreneurial management team</li>\n<li>High level of responsibility and lots of space to bring in and develop your own ideas</li>\n<li>The chance to shape the processes and professional focus, as well as team structures, culture and working environment</li>\n<li>Competitive compensation package</li>\n<li>Being part of a casual start-up environment and a fun international team in the heart of Berlin</li>\n<li>Henry, the office dog, is sure to brighten up your day!</li>\n</ul>\n<p><strong>Ready to join the team? We’d love to hear from you!!</strong></p>\n<p><em>Sonova is an equal opportunity employer, and encourages applicants from any national origin, sex, sexual orientation, religious background, gender identity and those individuals with disability.</em></p>\n",
    "how_to_apply": "<p><a href=\"https://sonova.join.com/jobs/1169511-senior-full-stack-engineer-m-f-d?pid=357a3b4531918760973f&amp;utm_source=github_jobs&amp;utm_medium=paid&amp;utm_campaign=single%2Bposting&amp;utm_content=senior%2Bfull%2Bstack%2Bengineer%2Bm%2Bf%2Bd\">https://sonova.join.com/jobs/1169511-senior-full-stack-engineer-m-f-d?pid=357a3b4531918760973f&amp;utm_source=github_jobs&amp;utm_medium=paid&amp;utm_campaign=single%2Bposting&amp;utm_content=senior%2Bfull%2Bstack%2Bengineer%2Bm%2Bf%2Bd</a></p>\n",
    "company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBc1NGIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--fc55a2337eb6ae6dd11c2a35217ebfb9d30a6cd6/Sonova_Tagline_RGB.png"
  },
  {
    "id": "de0cf30c-db0a-40f8-91c8-90c590fee1f2",
    "type": "Full Time",
    "url": "https://jobs.github.com/positions/de0cf30c-db0a-40f8-91c8-90c590fee1f2",
    "created_at": "Tue Jul 07 08:46:36 UTC 2020",
    "company": "StudySmarter",
    "company_url": "https://www.studysmarter.de/",
    "location": "München",
    "title": "Frontend Engineer (Angular 10)",
    "description": "<p>StudySmarter ist ein führendes EdTech Startup aus München. Das Spin-Off der TU München &amp; LMU München entwickelt eine intelligente und inhaltsunabhängige Plattform für das lebenslange Lernen. Die StudySmarter Lernplattform wurde 2018 erstmals veröffentlicht und wird aktuell von mehr als 850.000 Lernenden in der DACH Region aktiv genutzt. StudySmarter wurde von Hochschulvertretern und Bildungsexperten zum besten EdTech Startup in Deutschland und Europa gekürt. Das Startup hat den Hauptsitz in München und beschäftigt mehr als 40 Mitarbeiter. Die Vision von StudySmarter ist es, modernste Technologie zu benutzen, um es jedem zu ermöglichen die eigenen Bildungsziele zu erreichen.\nWeitere Informationen: <a href=\"http://t3u1.mjt.lu/lnk/AMIAAHgQ09EAAAAAAAAAAG3sWXAAAAAA-nQAAAAAAAZPNgBfA0X_e9hwEM_6TpmlG2w1Q1PV2QAGCXo/2/rhPD2Ux01e-a5PGk9jwykA/aHR0cHM6Ly93d3cuc3R1ZHlzbWFydGVyLmRl\">www.studysmarter.de</a></p>\n<p><strong>DEINE AUFGABEN</strong></p>\n<p>Als Frontend Engineer bei StudySmarter hast du direkten Einfluss auf unser Produkt, das von hunderttausenden Studierenden und Schülern in Deutschland genutzt wird. Hierbei spielt nicht nur die Entwicklung neuer und die Verbesserung bestehender Features eine wichtige Rolle, sondern auch, dass du unsere Apps noch zuverlässiger, intuitiver und schneller machst und unsere UX &amp; UI auf ein höheres Level hebst!</p>\n<p>Unsere Web App basiert auf Angular 10, unsere Mobile App entwickeln wir ebenfalls mit Angular und mit Ionic, einem Framework, dass für unser Produkt und unsere schnellen Entwicklungs- und Testzyklen perfekt geeignet ist. Ein wichtiger Teil deiner Arbeit ist es, kontinuierlich unsere Frontend-Architektur zu evaluieren und zu verbessern.</p>\n<p>Als Frontend Engineer arbeitest du in engem Kontakt mit anderen Teams wie Backend und Design. Wir arbeiten agil, daten- und nutzergetrieben auf unser Ziel hin, jedem beim Erreichen seiner Lernziele zu helfen und StudySmarter zur weltweiten #1 Lernplattform zu machen.</p>\n<p><strong>Folgende Aufgaben erwarten dich:</strong></p>\n<ul>\n<li>Weiterentwicklung der StudySmarter Web App und/oder StudySmarter Mobile App</li>\n<li>Umsetzung neuer Features, gemeinsame Planung von Verbesserungen</li>\n<li>Evaluierung, Planung und Durchführung von Architektur-Verbesserungen</li>\n<li>Analyse und Beheben von Nutzer-Problemen in der StudySmarter App</li>\n<li>Bei Interesse direkte Verantwortung für ein Studententeam und Aussicht auf eine Team-Lead Position</li>\n</ul>\n<p><strong>DEIN PROFIL</strong></p>\n<p><strong>Wir suchen dich, wenn du folgendes mitbringst:</strong></p>\n<ul>\n<li>Viel Erfahrung in Web-Entwicklung und SPAs, möglichst mit Angular2+</li>\n<li>Erfahrung mit Ionic / Redux ist ein Pluspunkt</li>\n<li>Gefühl für nutzerfreundliche Software, intuitive UX und Clean Code</li>\n<li>Motivation, mit uns die Zukunft der Bildung zu gestalten</li>\n<li>Leidenschaft für die Entwicklung digitaler Produkte</li>\n</ul>\n<p><strong>WARUM WIR?</strong></p>\n<ul>\n<li>Du hast einen nachhaltigen Einfluss auf unser Bildungssystem und auf den Lernprozess von hunderttausenden Studierenden und Schülern</li>\n<li>Du bist ein Teil von dem besten europäischen EdTech-Startup</li>\n<li>Du kannst dich bei uns nicht nur technisch, sondern auch persönlich weiterentwickeln und, wenn du möchtest, von Tag 1 an Verantwortung übernehmen</li>\n<li>Wir beteiligen dich mit unseren virtual share incentive program an dem Erfolg des Unternehmens</li>\n<li>Wir haben ein Büro mit Dachterasse im Herzen München's, direkt am Stachus (Sonnenstraße 1), aber Home-Office ist auch möglich</li>\n</ul>\n<p><img src=\"https://camo.githubusercontent.com/4affb4603072fa19bca03621fed5f427a1c05972/68747470733a2f2f747261636b696e672e676f686972696e672e636f6d2f682f35333733323661313230396465313862623639333338633934633539366136316234386430336332383139353861383130363764613036636563636666383437\"></p>\n",
    "how_to_apply": "<p><a href=\"https://tracking.gohiring.com/h/a5d35e48506f84d6dfe8e0f7f67b75b1a13157596837177928c110d78157476a\">application form</a></p>\n",
    "company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBc0tGIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--1735092a18cb938bcbb9a014f83461ca91366075/StudySmarter.png"
  },
  {
    "id": "e9e632a7-c756-40c9-b1ca-c3eb5c7f9ce3",
    "type": "Full Time",
    "url": "https://jobs.github.com/positions/e9e632a7-c756-40c9-b1ca-c3eb5c7f9ce3",
    "created_at": "Sat Aug 03 00:50:23 UTC 2019",
    "company": "Game Closure",
    "company_url": "http://gameclosure.com",
    "location": "San Francisco, Mountain View, Tokyo, Remote",
    "title": "Senior Game Engineer (REMOTE)",
    "description": "<p>GAME CLOSURE</p>\n<p>San Francisco, Mountain View, Tokyo, Remote  -  Full Time</p>\n<p>Game Closure is on the hunt for  Senior Game Engineers to help us build the social games that will be tomorrow’s biggest hits on Facebook and other social media platforms. We are a growing team with offices in San Francisco and Mountain View, California, Tokyo, Japan and also some possibilities for remote work. If you want to join us to make great games on our cutting­ edge technology and truly make an impact, then we want to talk to you!</p>\n<p>Game Closure game engineers make polished, high-performance HTML5 mobile games. We want people who are proficient with JavaScript and who are passionate about making fun social games to be played by millions! As a Game Engineer at Game Closure, you will build games internally on top of our cutting-edge and open source devkit. In addition to building kick­ass instant games, you will play a pivotal role in creating a platform which will revolutionize the future of game development.</p>\n<p>It's always a bonus if you know more than JavaScript! We write cross-compilers, GPU shaders, NodeJS back­ends, JavaScript game APIs and tools, and whatever else it takes. You will work with the best engineers in the world; we have top talent in every part of our stack.</p>\n<p><strong>The Role:</strong></p>\n<ul>\n<li>Be responsible for designing, developing and deploying major game features</li>\n<li>Own game feature areas from end-­to­-end</li>\n<li>Be the champion for the user!</li>\n<li>Insist on the highest standards and create functional and engaging features that will delight our users</li>\n<li>Be part of a tight game development team looking to iterate fast on a fun concept and then building it out</li>\n<li>Have real input on end-user product</li>\n<li>Be a key member of a high performing software engineering team</li>\n<li>Collaborate with design, engineering and production teams to devise optimal engineering solutions to game requirements</li>\n<li>Hands­ on architect and coder for sophisticated client/server systems for mobile gaming</li>\n<li>Innovate and iterate on process, systems and technology to deliver world­-class social games</li>\n<li>Be a leader; Identify and articulate technical and production risks and obstacles, as well as generate solutions!</li>\n</ul>\n<p><strong>Desired Skills:</strong></p>\n<ul>\n<li>Bachelor's degree in Computer Science or related field, or equivalent experience.</li>\n<li>3+ years of professional software engineering experience, working on cross functional teams.</li>\n<li>Proven effectiveness in directing or delivering production software for high quality games with at least one shipped game product of which you were a primary contributor (self­ published titles are acceptable).</li>\n<li>Capable of JavaScript + HTML5 to create custom, interactive, user experiences that are enjoyable on all HTML5 browsers.</li>\n<li>Proficient at using script debuggers like Chrome Debugger.</li>\n<li>Strong Computer Science fundamentals in object­-oriented design, algorithms, and data structures.</li>\n<li>Advanced software engineering skills, including the ability to write maintainable and robust code in a p popular object oriented language.</li>\n<li>Solid familiarity with analytics and A/B testing in mobile games</li>\n<li>Familiarity with git, svn or other VCS.</li>\n<li>Self starter, analytical and creative</li>\n<li>Strong team player with a positive attitude.</li>\n<li>Good communication skills and the ability to work effectively on shared projects with designers, artists, testers, product managers and other developers.</li>\n<li>Check out Everwing on Facebook Instant Games in Messenger. Can you build this game?</li>\n<li>Understanding of the reactive UI paradigm and experience building UIs using reactive UI frameworks (such as React, and state management Utilities like Redux).</li>\n</ul>\n<p><strong>Bonus:</strong></p>\n<ul>\n<li>Canvas animation work</li>\n<li>2+ years of game development experience with multiple shipped titles</li>\n<li>Specialized skills in a particular area of game development (for example: UI, Physics, graphics, multiplayer, game logic, etc.)</li>\n<li>Expert knowledge of TypeScript</li>\n</ul>\n<p><strong>GC Perks:</strong></p>\n<ul>\n<li>Medical, Dental, &amp; Vision: Top quality insurance options with 100% of premiums covered</li>\n<li>Social Events: Weekly team dinners, quarterly team excursions, game nights, karaoke, and more</li>\n<li>Commuter Pass + Free Parking: Your commute and parking to the office is on us!</li>\n<li>PTO: Unlimited vacation policy</li>\n<li>Meals: Free daily lunches, well stocked kitchen, healthy snacks and drinks</li>\n<li>Pet-Friendly Office: Bring your pets to work to foster a friendlier and happier workplace</li>\n</ul>\n",
    "how_to_apply": "<p><a href=\"https://jobs.lever.co/gameclosure/a50c5aa4-6526-425f-9767-2b8e11800857?lever-origin=applied&amp;lever-source%5B%5D=GitHub\">https://jobs.lever.co/gameclosure/a50c5aa4-6526-425f-9767-2b8e11800857?lever-origin=applied&amp;lever-source%5B%5D=GitHub</a></p>\n",
    "company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBaTV1IiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--b586f79a85322f93304aae975ae4ae8556e35bfe/GClogo_small.png"
  },
  {
    "id": "ed19603f-c92a-408e-aea4-daff58b4e46e",
    "type": "Full Time",
    "url": "https://jobs.github.com/positions/ed19603f-c92a-408e-aea4-daff58b4e46e",
    "created_at": "Mon Jul 06 21:56:54 UTC 2020",
    "company": "Tripoint Solutions, LLC",
    "company_url": "http://www.tripointsolutions.com/careers",
    "location": "Rockville, MD",
    "title": "Salesforce Developer (US Citizens only)",
    "description": "<p>Tripoint Solutions is seeking a <strong>Salesforce Developer</strong> to join our team in <strong>Rockville, MD</strong>.</p>\n<p>The Salesforce Developer will be responsible for providing Salesforce development, administration, and consulting on best practices. You would be part of a team supporting a federal agency with the modernization of their IT acquisition &amp; contract software app. They're working on everything from a phased website refresh to cloud migration and administration of SharePoint and Salesforce.</p>\n<p><strong>The successful candidate will be accountable to:</strong></p>\n<ul>\n<li>Advise on a implementing a new Salesforce platform or migrating existing workflows into Salesforce</li>\n<li>Install, configure, and administer Salesforce</li>\n<li>Work within your project team and across other projects to establish integration points between Salesforce and other mission critical software applications</li>\n<li>Design, develop and maintain complex workflows rules, validation rules and custom workflow, etc.</li>\n<li>Audit, uncover and resolve data integrity issues</li>\n<li>Perform mass data imports/exports using the API or various import tools</li>\n<li>Collaborate with cross-functional teams of new feature technical design, technical requirements, limitations, and implementation</li>\n<li>Administer and configure Salesforce.com and reporting analytics for Sales and Customer Support organization</li>\n<li>Create reports and dashboards to provide Inside Sales and Customer Service KPIs for senior management; fulfill miscellaneous reporting requests</li>\n<li>Work with IT team to create and publish best practices in relation to our products and Salesforce configuration</li>\n<li>Perform unit testing, integration testing, and performance testing of new application functionality. Analyze and mitigate issues identified during testing</li>\n<li>Identify opportunities for application optimization, redesign, or development within the IT, Sales and HelpDesk teams</li>\n</ul>\n<p><strong>Experience, Education &amp; Training:</strong></p>\n<ul>\n<li>BS Degree in Information Technology, Business Administration, and/or related field</li>\n<li>3+ years of Salesforce Administration and Development experience</li>\n<li>Extensive experience using Salesforce to configure and custom code, and support integrations; using any one of the following: Visualforce, APEX programming, Force.com APIs, and Web Services</li>\n<li>Experience with data migration to include integration, data cleansing and import/export of large volumes of data</li>\n<li>Experience in working with Force.com Standard Objects and Apex Classes, Apex triggers, Visual Force, Batch Apex, Integration, REST, Force.com API, SOQL and SOSL</li>\n<li>Hands on experience with standard and custom Controllers in Visual Force</li>\n</ul>\n<p><strong>Preferred Qualifications:</strong></p>\n<ul>\n<li>Salesforce.com Certified Administrator and/or Developer</li>\n<li>Experience with Salesforce Helpdesk and help centers</li>\n<li>Experience integrating 3rd party systems with Salesforce</li>\n<li>Experience with Salesforce AppExchange and JAVA on demand</li>\n<li>Understanding of key organizational and process maturity frameworks such as ITIL and CMMI</li>\n</ul>\n<p><strong>Clearance Requirements:</strong>\nApplicants selected may be subject to a government security investigation and must meet eligibility requirements for potential access to classified information. <strong>Accordingly, US Citizenship is required.</strong></p>\n<p>Tripoint is a growing 8(a) small business that was founded on the principle that People and Processes—with Technology as an enabler—are the fundamental source of any team or organization’s ability to accomplish its mission. Our Focus is delivering practical and sustainable solutions for every customer.</p>\n",
    "how_to_apply": "<p>Please email Laura at <a href=\"mailto:recruiter@tripointsolutions.com\">recruiter@tripointsolutions.com</a> with your email. You can also upload your resume by creating a profile in our careers database at:\n<a href=\"https://careers-tripointsolutions.icims.com/jobs/1097/salesforce-developer/job\">https://careers-tripointsolutions.icims.com/jobs/1097/salesforce-developer/job</a></p>\n",
    "company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBcnlGIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--7fdf2b3d299264aae95d4402bae32f76f66aa834/TPS%20Logo%20Large%20with%20Background.jpg"
  },
  {
    "id": "6cfdc451-a7cc-4000-8e2c-1dc83646cf70",
    "type": "Full Time",
    "url": "https://jobs.github.com/positions/6cfdc451-a7cc-4000-8e2c-1dc83646cf70",
    "created_at": "Mon Jul 06 17:04:40 UTC 2020",
    "company": "FlatWorld.Co",
    "company_url": "https://flatworld.co",
    "location": "EU-TimeZones (GMT+3 to GMT-2)",
    "title": "Sr. Backend Developer -- Fully Remote!",
    "description": "<p>Sr. Backend Developer -- Fully Remote!!\nSalary range – $60,000 – $120,000 per year</p>\n<p>This is an exciting opportunity for a truly experienced Sr. Backend Developer from any programming language background, to join a growing fully-distributed engineering team that develops a full-stack B2B fintech product.</p>\n<p>We are looking for hard-core Backend engineers with a passion for building distributed data-processing systems. The perfect candidate will have a very strong computer-science background, with lots of experience in building scalable Backend systems in general and for data-processing in particular. Node.js and PHP are great, but you need to bring to the table production experience with at least one additional programming language (C#, Java, Python, Golang, C++, etc.). You need to be able to simplify complex problems to their essence and to be a self-driven individual. Our current Backend stack is Python (Django) and most of our new code is being written in Golang while we are looking at Rust as a potential next step.</p>\n<p>You Will</p>\n<ul>\n<li>Design, build and maintain super interesting distributed and scalable data-processing systems</li>\n<li>Participate in the product development process from start to finish, from scoping projects to measuring their success and iterating based on feedback</li>\n<li>Maintain high engineering and security standards with respect to performance, scalability, and maintainability, and continuously improve our codebases and work processes</li>\n<li>Work with engineers across the company to develop and iterate at scale</li>\n</ul>\n<p>You’d be a great fit if you have ❤️</p>\n<ul>\n<li>8+ years of experience in a software engineering role with at least 4 years as a full-time Backend developer</li>\n<li>Experience in building and scaling data-intensive web applications</li>\n<li>Strong verbal and written English communication skills</li>\n<li>An internal drive to take responsibility and ownership over core product areas</li>\n<li>Proficiency in using Python and Golang (but if you are really good, we will assume that you can learn those)</li>\n<li>Strong Data-Structures and Algorithmic / Computer-Science fundamentals (writing good Javascript code will not cut it…)\nE* xperience in building distributed data processing systems (not by using SPARK/HADOOP), but rather building SPARK/HADOOP like systems</li>\n</ul>\n<p>Bonus points if you have</p>\n<ul>\n<li>MSc or PhD in Computer Science/distributed systems</li>\n<li>experience in dealing with high-scale systems\n*experience working at startup companies</li>\n<li>experience working in distributed teams and work environments</li>\n</ul>\n<p>See the full job description on our website...</p>\n",
    "how_to_apply": "<p><a href=\"https://flatworld.co/job/sr-backend-010/\">https://flatworld.co/job/sr-backend-010/</a></p>\n",
    "company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBdlNGIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--b90365303f8c05e632f5a9398287681ef6f1b410/captivateiq-logo.svg"
  },
  {
    "id": "585ed8c9-b612-4a52-a937-1f1e46fed3ac",
    "type": "Full Time",
    "url": "https://jobs.github.com/positions/585ed8c9-b612-4a52-a937-1f1e46fed3ac",
    "created_at": "Fri Jul 03 08:02:12 UTC 2020",
    "company": "Craft Courses Limited",
    "company_url": null,
    "location": "Pembrokeshire",
    "title": "Senior full stack Ruby engineer",
    "description": "<p>Senior full stack Ruby engineer\n(£52-60k)</p>\n<p>The role\nWe are looking for an experienced Ruby developer to join the CraftCourses.com team full-time and take the lead in the development of the web site, mobile and internal systems. Our ecommerce system is in Ruby on Rails with MySQL and various payment and third-party integrations. We use Elastic search and AWS services. A working knowledge of PHP would come in handy too. We are a small close-knit team and we rely on each other to deliver excellence, whether that be in our approachable customer relations or on our web systems. We have a passion for doing some good in the world and this company delivers on that fully! The role is perfect for someone looking to make Pembrokeshire, with its beautiful coast and mountains, their home, though remote working is an option.</p>\n<p>What we are looking for:\nWe're looking for someone to get up to speed with our codebase quickly, so that means we'll need you to have significant professional experience with Ruby and Ruby on Rails.</p>\n<p>You'll be responsible for the full software stack, so you'll need to demonstrate a working knowledge of modern JavaScript (we currently use VueJS). Stripe and ElasticSearch are core to our application. If you haven't used these particular tools, we'll want to know how your experience will transfer to them.</p>\n<p>We have some applications running Laravel on PHP that need to be maintained so experience of this is a plus, but an ability and willingness to become comfortable working on them is more important.</p>\n<p>We use Codeship CI to run our tests, and we're expecting the right candidate to be familiar with writing tests and running CI as part of their day-to-day work.</p>\n<p>The technologies we work with are:\nRuby on Rails 6\nAWS services including Elastic Beanstalk, Cloudfront, ELB and RDS\nPHP + Laravel 5.7\nVueJS\nCodeship CI\nElasticSearch\nStripe\nMailgun\nDelayed Job\nBeanstalkd\nMailChimp</p>\n<p>About CraftCourses.com\nCraftCourses.com is a platform to help people experience the joy and satisfaction of making and doing.\nBased in Pembrokeshire, we are the UK’s largest creative experience site with online booking and gift vouchers. We have 1.5 million unique visitors per year (2019) and thousands of courses - yet each experience is a personal human connection. We are the opposite of mass market.</p>\n<p>Company culture\nOur company culture is all about providing excellent service to our makers, whether they be at the learning or teaching end. We are a force for good in the world, we want to help life become more creative, more satisfying and more meaningful.</p>\n<p>We are a small team of 8, so each of us must be multi-talented. This position is no different. Each of us must grow the business. Each of us will play a key role in changing the world around us.</p>\n<p>The ideal person for this role has:\nA solid track history of developing and maintaining smooth and attractive ecommerce sites\nA love of solving problems, coming up with creative solutions and a can-do approach\nExceptional work ethic; the ability to work alone and lead projects to completion\nA genuine interest in creativity and our company ethos (i.e. how making and doing is good for us as people).</p>\n<p>Essential attributes:\nSolutions-based, clear mind, positive, hardworking, fun, efficient, compassionate, IDEAS!</p>\n<p>Benefits:</p>\n<ul>\n<li>Work from home opportunities</li>\n<li>On-site parking</li>\n<li>Flexible working hours</li>\n<li>Company pension</li>\n<li>Casual dress</li>\n<li>Employee discounts</li>\n<li>Company events &amp; social hours</li>\n<li>Birthday off</li>\n</ul>\n",
    "how_to_apply": "<p>Please apply with your CV and a covering email addressed to <a href=\"mailto:kate@craftcourses.com\">kate@craftcourses.com</a> explaining why you are right for this role. Please demonstrate past experience and a genuine interest in the field and ethos of our company as well as your ideas for how you would tackle this job, creatively as well as practically.\nBefore you apply for this job please familiarise yourself with the website.\nLooking forward to hearing from you!</p>\n",
    "company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBckdGIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--62a20596727293ad3f42ebd102aee5e5fa46a088/Craft%20Courses%20Icon%20Green.jpg"
  },
  {
    "id": "bfda54c4-da1a-4487-a579-637f9c7a0ffb",
    "type": "Full Time",
    "url": "https://jobs.github.com/positions/bfda54c4-da1a-4487-a579-637f9c7a0ffb",
    "created_at": "Thu Jul 02 22:24:18 UTC 2020",
    "company": "One More Cloud",
    "company_url": "http://bonsai.io",
    "location": "Remote",
    "title": "Senior Platform Engineer",
    "description": "<p>Bonsai is hiring a Senior Platform Engineer to help build, scale and support the underlying technical platform that help us manage thousands of Elasticsearch clusters on AWS and GCP. This is a 100% remote full-time position. Salary ranges from $120 to $130k, based on experience.</p>\n<h2>About the job</h2>\n<p>“Hey, we’ve put your add-on in production. Good luck. Don’t crash.” —Heroku</p>\n<p>The essence of platform engineering at Bonsai will be to operate and support Elasticsearch at scale. The emphasis here is more on the scale part than the Elasticsearch part, but you’ll definitely become intimate with Elasticsearch and Lucene along the way.</p>\n<p>There are several key components involved. First we have Elasticsearch itself. Then a handful of proprietary plugins to enhance its functionality and support its operation. From there, the networking stack that handles connections and does diagnostic tracing. Telemetry and observability across the board. Finally our packaging and deployment, and internal services for fleet orchestration.</p>\n<p>If that sounds like more than one person’s job, we agree. Your future colleague Dan is going to be particularly stoked to work with you.</p>\n<p>You can think of this similar to a “SRE” position. When there’s an issue with performance or reliability, you’ll dig in and trace requests and analyze from load balancers down to memory managers, and help code and ship a patch to make it visible, and make it better.</p>\n<p>There’s a heavy dose of Java and Linux involved in all of this, but if you have some experience in systems programming in other languages, we can certainly teach all of that.</p>\n<p>We’re a small team, but we punch above our weight in systems engineering and operations. Launching at the right place and time dropped us into the deep end of early adopters, and we’ve been scaling ever since. Fortunately our early team was heavily engineering minded. Our original founder was previously a database engineer at Twitter when they went through their years of crazy scaling. We also hosted some massive sites like Pinterest whose 100x growth on our platform was a true trial by fire.</p>\n<p>This position does involve wearing the metaphorical pager in a rotation with other engineers on the team. We’re on call not because we expect to be woken up, but so we’re accountable to shipping systems that never need us to!</p>\n<h2>Some example projects</h2>\n<ul>\n<li>Moving decentralized server-initiated threshold alerts into a centralized time-series stream analysis service.</li>\n<li>Building a continuous delivery service that performs gradual fleetwide rollouts of new and updated services, subject to canary stages and operational verification at certain checkpoints.</li>\n<li>Build and package new versions of Elasticsearch OSS, and update our suite of plugins to use the latest plugin interfaces, including customer-supplied proprietary plugins.</li>\n<li>Troubleshoot a customer-supplied Elasticsearch plugin with a performance hot-spot, trace the problem to a likely location and provide support and guidance to improve efficiency.</li>\n<li>Diagnose a server-side agent as having problematic memory usage, and port it from Ruby to Crystal to improve performance and resource usage.</li>\n<li>Collaborate with Product engineers to build a data pipeline to support customer-facing metrics graphs.</li>\n<li>Assist our customer support by triaging operational incidents and performing incident response.</li>\n</ul>\n<h2>The ideal engineer</h2>\n<p>We’re looking for someone experienced, who’s ready to dive in. You don’t need to be an Elasticsearch expert — you’ll learn all of that on the job. We’ll have plenty of conversations about how Lucene is really a data structures library optimized for disk access.</p>\n<p>Experience with Java is more helpful, although C, C++ and Golang would be a good starting points. We’ll also be looking for solid fundamentals in networking, disk access, memory management, and schedulers.</p>\n<p>Several of our systems make heavy use of Netty, as does Elasticsearch itself. So familiarity with Netty or evented systems will be helpful.</p>\n<h2>The ideal teammate</h2>\n<p>One More Cloud (OMC) is small, remote-first, and team-conscious.</p>\n<p>OMC has always been comprised of a small team. As such, each of our colleagues wears many hats. We lack middle managers and dedicated Project Managers that slice and dice out work; OMC managers are also contributors. They serve as a sounding board and for coaching higher level project and career questions. Everyone is expected to manage projects together. So, our team works best with individuals who take responsibility for their to-do lists, and those who enjoy working collaboratively with teammates to plan out projects and don’t shy away from offering their opinions.</p>\n<p>OMC has been a remote-first company from day one, and we have a lot of experience in managing and communicating across multiple timezones. One of our key ways of getting focused work done is eliminating too many meetings and video calls by writing out our thought processes, documenting steps we take, and sharing it with the team. Our ideal teammate should be comfortable with and undaunted at writing clear and logical longer-form English prose on a regular cadence.</p>\n<p>We are team-conscious. Yes, we have a company hierarchy based on skills and the level of risk a position incurs (like responsibility for servers that have big costs attached to them). However, the onus is on every individual at OMC(regardless of hierarchy) to create a culture that allows a space for creativity, honesty, and autonomy for everyone who joins OMC. We don’t look for team heroes or martyrs but rather strive to create healthy and realistic team responsibility. We collaborate best with those who are considerate of their teammates, respect boundaries, and are dedicated to pursuing our work with curiosity, respect, and optimism.</p>\n<h2>About One More Cloud</h2>\n<p>OMC provides specialized hosted cloud services through two SAAS services: Websolr (websolr.com) and Bonsai (bonsai.io). We launched Websolr in 2009 as the first cloud hosted Solr as a service, and one of the very first batch of Heroku addons. Bonsai followed in 2012 as the first hosted Elasticsearch as a service on the market.</p>\n<p>Our company is small, profitable, and independent. Our entire team, starting with the founders, is comprised of developers, engineers, scientists, and designers with a passion for providing useful tools and services for developers and businesses. As truth-seeking creatives and thinkers, we strive for excellence from design to execution.</p>\n<p>We manage the search engines for ecommerce applications, social media sites, magazine archives, classifieds search, job boards and resume search, CRMs, content management systems, and more. We've been fortunate to serve teams at startups and established sites alike, such as Airbrake, Best Buy, Bullhorn, Couchsurfing, Ello, Fairfax Media, GitHub, Heroku, Muck Rack, OfferUp, Pinterest, Scripted, wikiHow, and more.</p>\n<p>Benefits for working at OMC include:</p>\n<ul>\n<li>Medical and Dental Insurance</li>\n<li>40 hour work week. We practice healthy work and life boundaries.</li>\n<li>Work where you want. We're a remote-first company, and have been from day one since 2009.</li>\n<li>401k, with company contributions</li>\n<li>Wellness allowances</li>\n<li>Annual continuing education allowance</li>\n<li>Paid parental leave</li>\n</ul>\nLearn More\n<p>View our careers page at <a href=\"bonsai.io/careers\">bonsai.io/careers</a></p>\n<p>View our current team and company story at <a href=\"bonsai.io/about\">bonsai.io/about</a> and <a href=\"omc.io\">omc.io</a></p>\n<p>View the products you'll work on to support at <a href=\"bonsai.io\">bonsai.io</a> and <a href=\"websolr.com\">websolr.com</a></p>\n",
    "how_to_apply": "<p>Apply through our Greenhouse posting: <a href=\"https://boards.greenhouse.io/onemorecloudinc/jobs/4433722002?gh_source=github\">https://boards.greenhouse.io/onemorecloudinc/jobs/4433722002?gh_source=github</a></p>\n",
    "company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBcXlGIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--80f5744a2b137d6f09e6234058c4d55f02b86371/cloud-plus-blue-bg.png"
  },
  {
    "id": "5ae75da5-fab6-41dd-8fc6-7c5e3b0ae5fe",
    "type": "Full Time",
    "url": "https://jobs.github.com/positions/5ae75da5-fab6-41dd-8fc6-7c5e3b0ae5fe",
    "created_at": "Wed Jul 01 11:16:56 UTC 2020",
    "company": "Gothaer Digital GmbH",
    "company_url": "http://www.gothaer-digital.de",
    "location": "Cologne",
    "title": "Senior Mobile Developer for Flutter / Dart",
    "description": "<p>Are you looking for a new challenge in software developing? You love clean code and technically smart software? You want to be at the frontline of a changing industry?</p>\n<p>Then you've come to the right job posting. As a digital subsidiary of the Gothaer Insurance Company, we are looking for new colleagues with entrepreneurial spirit as teammates in our dynamic, interdisciplinary team. The start-up spirit in our office with a view over the roofs of Cologne provides a unique environment.</p>\n<p>We are currently looking for a software developer for our tech team who is experienced with mobile / hybrid development and App store release (Android &amp; Apple) and has project experience with Flutter / Dart projects.</p>\n<ul>\n<li>Mobile development with Flutter (Dart) for our health app</li>\n<li>Project-based development of applications and MVPs for Gothaer Insurance Company</li>\n<li>Implementation of UI and prototypes with excellent user experiences from our XD designs</li>\n</ul>\n<p><strong>Your profile:</strong></p>\n<ul>\n<li>Good experience with Flutter and other mobile technologies</li>\n<li>Interest in attractive modern design patterns and an \"eye\" for distances, layout and colors</li>\n<li>team player with the interest to cooperate in an interdisciplinary team</li>\n<li>Great interest in innovation (e.g. new programming languages and APIs as well as new technologies in general)</li>\n<li>optional experienced with web development with JavaScript based frameworks for web or mobile development</li>\n<li>optional: experience with cloud computing and scaling (Azure, Docker, etc.)</li>\n<li>Enjoy bringing complex projects to success as part of a team</li>\n<li>German language is a plus but not mandatory</li>\n</ul>\n<p>Gothaer Digital GmbH is a international team of experts and you can have a great influence on the path of our digital unit. We offer you a lot of space for the implementation of new ideas and your personal development. Convinced? Then we are looking forward to receive your application.</p>\n<p><strong>What we also offer:</strong></p>\n<ul>\n<li>A modern office with coffee, drinks and a great view of the city</li>\n<li>A cross-functional team from different areas</li>\n<li>Flexible working hours and home office</li>\n<li>Further training and paid tech meetings attendance</li>\n<li>Good connection to public transport and a discount for your monthly ticket</li>\n<li>german classes for our foreign employees</li>\n</ul>\n",
    "how_to_apply": "<p>apply via email or via our website <a href=\"http://www.gothaer-digital.de\">www.gothaer-digital.de</a></p>\n",
    "company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBcVNGIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--5e73c476e9f8443569cb0b406174d9571587b268/GoD_Logo_RGB.png"
  },
  {
    "id": "a4a03e31-b069-421c-ad0d-14f10fd6a1d3",
    "type": "Full Time",
    "url": "https://jobs.github.com/positions/a4a03e31-b069-421c-ad0d-14f10fd6a1d3",
    "created_at": "Tue Jun 30 18:48:52 UTC 2020",
    "company": "Epic",
    "company_url": "http://careers.epic.com",
    "location": "Madison, WI",
    "title": "Network DevOps Engineer",
    "description": "<p>We are seeking a Network DevOps Engineer to create automation to analyze, maintain, and evolve our complex network's infrastructure. As part of Epic's multi-tenant hosting team, you'll keep abreast of the latest technologies and work collaboratively with experts in a variety of knowledge areas to develop and maintain a robust, reliable, high-performance foundation for some of the largest healthcare organizations in the country to access our world-class software.</p>\n<p>Desired Skills and Knowledge Areas:</p>\n<p>Experience with Infrastructure as Code frameworks such as Ansible, Puppet, or Terraform</p>\n<p>Experience with scripting and programming languages such as Python, PowerShell, Go</p>\n<p>Experience with Network, firewall, or load balancer platforms</p>\n<p>Background in networking fundamentals including TCP/IP, DNS, load balancing, routing, and administration of networking hardware.</p>\n<p>Requirements:</p>\n<p>Relocation to the Madison, WI area (reimbursed)</p>\n<p>5+ years IT experience required, minimum 1-2 years in DevOps</p>\n<p>A history of academic and professional success</p>\n<p>Eligibility to work in the U.S. without visa sponsorship</p>\n<p>More than just important work.\nEpic is located in Madison, Wisconsin, a city regularly ranked as one of America's best places to live. Epic's environment is one of continuous learning; you'll have access to opportunities to expand your skill set and share your knowledge with others. We offer comprehensive benefits to keep you healthy and happy as you grow in your life and career, and your merit-based compensation will reflect the impact your work has on the company and our customers. You'll also be eligible for annual raises and bonuses,  as well as stock grants, which give you an even greater stake in the success of Epic and our customers. Epic is an Equal Opportunity/Affirmative Action (W/M/Vets/Disability) employer. Please see our full non-discrimination statement at <a href=\"https://careers.epic.com/EEO\">https://careers.epic.com/EEO</a>.</p>\n<p>As a member of the Hosting team at Epic you'll be responsible for the confidentiality, integrity, and availability of Epic Hosting. Those responsibilities include:</p>\n<p>Following policies and procedures and escalating when policies or procedures are not followed.</p>\n<p>Escalating potential security incidents and providing relevant information.</p>\n<p>Meeting all security responsibilities defined in policies and procedures.</p>\n",
    "how_to_apply": "<p>Upload your resume here: <a href=\"https://epic.avature.net/Careers/RegisterMethod?folderId=19058\">https://epic.avature.net/Careers/RegisterMethod?folderId=19058</a></p>\n",
    "company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBcUNGIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--3971322e8c7ac9b5f603a827026f78bf25d72413/large%20Epic%20logo%20red%20(transparent%20BG).png"
  },
  {
    "id": "cfb3dfc3-1626-4348-88d6-e885a93a28a2",
    "type": "Full Time",
    "url": "https://jobs.github.com/positions/cfb3dfc3-1626-4348-88d6-e885a93a28a2",
    "created_at": "Tue Jun 30 15:17:35 UTC 2020",
    "company": "Altaml",
    "company_url": "http://www.altaml.com",
    "location": "Calgary",
    "title": "Lead Software Developer",
    "description": "<p>AltaML is a fast-growing startup that focuses on applied Machine Learning (ML). We partner with industry to co-develop Artificial Intelligence (AI) and ML-powered products. We are experts in ML commercialization and help our industrial partners gain a competitive advantage by combining their data and domain expertise with our analytics and ML proficiency. Data informs our every move, and we aim to work quickly, collaboratively, and creatively. We have offices in Edmonton and Calgary and are expanding into Toronto.</p>\n<p>Do you get excited about the chance to solve real-world problems using data and code? AltaML works with progressive partners in industries such as Health, Logistics, Smart Cities and Financial Services.  Sure, we are a tech company, so we offer a well-stocked kitchen including good coffee, sparkling water, and snacks. But we also offer Welcome Lunches, Friday Socials, hot sauce tastings and so much more!</p>\n<p>We are a company like no other – we believe in making small bets, failing fast, and being better together.</p>\n<p>Located in the stunning Edison Building in downtown Calgary, we are looking for a Lead Software Developer. This Lead role will also be responsible for providing oversight and local leadership to our inaugural Dev pod in the Calgary office.</p>\n<p><strong>What you’ll do:</strong></p>\n<p>As a Lead Software Developer, your primary focus will be the oversight of development of front-end MVP applications written in a SPA framework. Your team will also be responsible for integrating ML elements built by co-workers into the application; therefore, a basic understanding of back-end technologies is necessary as well.  You will provide technical and team management, but as you can see, you will need to be a hands-on manager!</p>\n<p><strong>Responsibilities:</strong></p>\n<ul>\n<li>Reviewing and writing reusable, testable, and efficient code</li>\n<li>Design and implementation of low-latency, high-availability, and performant applications</li>\n<li>Integration of user-facing elements developed by front-end developers with server -side logic</li>\n<li>Implementation of security and data protection</li>\n<li>Development of SPA applications for mobile, web and desktop.</li>\n<li>Provide work direction and review the work of the designated team</li>\n<li>Provide mentorship to our software developers</li>\n</ul>\n<p><strong>What you bring:</strong></p>\n<ul>\n<li>Formal or informal leadership and oversight of less-experienced Developers, including technical and behavioural coaching and mentorship</li>\n<li>7-10 years of hands-on coding experience, including expert-level skills in Javasciript/Typescript and knowledge of at least one popular SPA framework (React/VueJS/Angular) with VueJS experience preferred.</li>\n<li>Familiarity with creating RESTFUL services using a framework</li>\n<li>Basic understanding of front-end technologies, such as JavaScript, HTML5, and CSS3</li>\n<li>Knowledge of user authentication and authorization between multiple systems, servers, and environments</li>\n<li>Understanding of fundamental design principles behind a scalable application</li>\n<li>Understanding of the differences between multiple delivery platforms, such as mobile vs desktop, and optimizing output to match the specific platform</li>\n<li>Able to create database schemas that represent and support business processes</li>\n<li>Strong unit test and debugging skills</li>\n<li>Proficient understanding of code versioning tools (GIT)</li>\n<li>Awareness or exposure to micro service-based architecture</li>\n<li>Exposure to Python as a nice to have</li>\n</ul>\n<p><strong>Who we are looking for:</strong></p>\n<p>Our core values speak volumes about who we are and how we work:</p>\n<p>Humble – Listen to the data\nHappy – Tap-dance to work\nGritty – Be persistent, not complacent\nAgile – Make small bets, then iterate</p>\n<p>Our current and future employees:</p>\n<ul>\n<li>express our core values</li>\n<li>are hungry for knowledge</li>\n<li>want to learn new skills</li>\n<li>are respectful</li>\n<li>collaborate with others across the whole company</li>\n<li>share knowledge with coworkers</li>\n<li>educate and promote AI and ML concepts both internally and externally</li>\n<li>have a high work ethic and are self-motivated</li>\n</ul>\n<p><strong>What you’ll get:</strong></p>\n<p>You will be working in a high-paced environment focused on creating unique ML solutions to problems within the investment management space to generate impactful value. This includes everything from building alpha-generating models to automating administrative processes.</p>\n<p>You will be working with people with multiple years of industrial and academic experience in data science, software engineering, product management, and machine learning fields. To solve the problems we apply various ML techniques from traditional Machine Learning and Data Mining algorithms, through to vision, Deep Learning, Information Extraction, advanced NLP and conversational agents.</p>\n<p>You will be able to experience a Silicon Valley-style company culture, which means we believe in working hard, getting the job done, and enjoying a drink on Fridays. You’ll also get flexibility in where you work, what hours you work, how much vacation you take, and what you wear. We expect hard work but respect work/life balance.</p>\n<p>Confidence can sometimes hold us back from applying for a job.  We’ll let you in on a secret - there is no such thing as a perfect candidate.  AltaML is working with new technologies, and no one is standing still when it comes to learning.  As long as you are continuing to push your growth and development, then consider applying even if you don’t check all the boxes on our posting.</p>\n<p>So, however you identify and whatever background and experiences you bring, please apply if this is a role that would make you “tap dance to work” every day.  We would love to add your biological uniqueness to our own! :-)</p>\n<p>Note:\nYou will be required to undergo the following checks during the hiring process:</p>\n<p>Background\nEducation\nCriminal\nCredit\nReferences</p>\n",
    "how_to_apply": "<p>email your resume to <a href=\"mailto:mikeb@altaml.com\">mikeb@altaml.com</a></p>\n",
    "company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBcHlGIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--ed90f7dbcb0e377fd2184058b5a3e6e271830f71/altaml_logo_dark.png"
  },
  {
    "id": "94df0e7f-ecdb-489d-b9a5-dda1b121816c",
    "type": "Full Time",
    "url": "https://jobs.github.com/positions/94df0e7f-ecdb-489d-b9a5-dda1b121816c",
    "created_at": "Tue Jun 30 14:59:42 UTC 2020",
    "company": "HubTran",
    "company_url": "https://www.hubtran.com",
    "location": "USA Remote",
    "title": "Senior Software Engineer Rails/Elm/JS",
    "description": "<p>Are you the kind of person who likes working on a variety of challenging projects? Would you enjoy helping a team work on automation improvements this month and then move to tuning our OCR process next month? Do you want to lead development of new strategic features? If so, being a HubTran Senior Software Engineer might be the thing for you. We are looking for one or more people to help us solve our most challenging issues.</p>\n<p>At Hubtran, you will join a team that:</p>\n<ul>\n<li>Has experience. The majority of our developers have more than 10 years of professional experience. * One has published a book with the Pragmatic Programmers.</li>\n<li>Has won the Chicago Innovation Award and Harvard Business School New Venture Contest.</li>\n<li>Is fully remote. We care about what you can accomplish, not where you choose to accomplish it from.</li>\n<li>Believes diversity is essential and strongly encourages applications from women and minority candidates.</li>\n<li>Can articulate their values. You can read about our values at on our <a href=\"https://www.hubtran.com/marketing/welcome-to-the-new-hubtran-blog/\">blog</a>.</li>\n<li>Pays well.</li>\n<li>Offers benefits including health insurance, 4 weeks of vacation, 401k, and more.</li>\n</ul>\n<p>Our code is a mixture of Ruby, Elm and JavaScript. Additionally, we have a strong interest in functional programming languages like Haskell, OCaml, Elixir, and Idris. We're also using Rails, React, Postgresql, Redis, Docker, and more. While these are the tools we're currently using, you don't need to have previous experience with all of them. We know that good developers are capable of quickly picking up new languages and tools.</p>\n<p>In order to succeed in this role you should be:</p>\n<ul>\n<li>Experienced. You have designed and implemented entire projects not just individual stories.</li>\n<li>Curious. You aren't content with the status quo and know that we can always improve.</li>\n<li>Self-directed. You can work on your own while prioritizing tasks.</li>\n<li>Collaborative. You can work with others to improve a solution.</li>\n<li>Empathetic. Your designs are influenced by a deep understanding of the customers' needs.</li>\n<li>A strong communicator. You will proactively communicate issues and trade-offs with team members to support alignment and fast decision making.</li>\n<li>Be an outstanding developer. Your peers should recognize you as one of the best and the brightest developers they have worked with.</li>\n</ul>\n<p>Bonus points for:</p>\n<ul>\n<li>Leading an engineering team or running a consulting company.</li>\n<li>Experience or strong interest in Machine Learning.</li>\n<li>Experience with functional languages like Elm, Haskell, OCaml, or Elixir.</li>\n<li>Previous Logistics experience.</li>\n</ul>\n<p><a href=\"https://www.hubtran.com\">HubTran</a> is a fast-growing technology startup focused on automating work in the logistics industry. Through a combination of a powerful browser based interface and machine learning, we are able to reduce our customer's workload by 4x or more. HubTran is well funded with significant upside potential.</p>\n",
    "how_to_apply": "<p><a href=\"https://apply.workable.com/hubtran/j/99980907C2/apply/\">https://apply.workable.com/hubtran/j/99980907C2/apply/</a></p>\n",
    "company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBcGlGIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--a71072224f97f1f53c6a38d6a7c0cc3c3fbda394/hubtran-color-logo-new.png"
  },
  {
    "id": "f75f8690-c458-4d9e-bd37-10a660ddf712",
    "type": "Full Time",
    "url": "https://jobs.github.com/positions/f75f8690-c458-4d9e-bd37-10a660ddf712",
    "created_at": "Tue Jun 30 14:00:28 UTC 2020",
    "company": "YourWork GmbH",
    "company_url": "http://www.yourwork.com",
    "location": "Erfurt",
    "title": "Technical Lead",
    "description": "<p>YourWork is a German business and employment-oriented social network for craftsmanship and industry.\nWe are a small, self-funded team who move fast led by the entrepreneur Nicole Nestler. She has experiences in the IT technology sector and was leading the last 6 years a big company in the craftsmanship industry.</p>\n<p>WHERE YOUR EXPERTISE IS NEEDED</p>\n<ul>\n<li>You‘ll ensure YourWork has scalable, affordable, reliable and high-performance systems to support the growth of the business in Germany and abroad, enabling constant product innovation and optimization.</li>\n<li>You‘ll be responsible for choosing the tech-stack, planning architecture, bootstrapping the dev-team and building the codebase from scratch. We expect you to oversee technology choices, code quality, security and infrastructure, but also on the HR side, including recruitment and career development of your team members.</li>\n<li>We would like you to help foster a culture of individual initiative, solidarity and lead results-driven development methodology.</li>\n</ul>\n<p>WHAT WE’RE LOOKING FOR</p>\n<ul>\n<li>At least 3-4 years experience with building consumer-facing web applications as a full- stack developer.</li>\n<li>Proven experience with at least one modern frontend framework (React/Vue/Angular).</li>\n<li>Proven experience with at least one modern backend REST framework\n(Express/Koa/Django/Serverless etc.).</li>\n<li>Basic devops understanding and experience deploying and maintaining application in\nthe cloud (AWS/GCP/HEROKU etc.).</li>\n<li>Product and product-terminology understanding, experience working with\nmarketing/creative/business departments. • You move fast.</li>\n</ul>\n<p>NICE TO HAVE</p>\n<ul>\n<li>Experience leading dev-teams.</li>\n<li>German language proficiency.</li>\n<li>Building and maintaining application at high-scale, experience with continuous\nintegration and in-depth dev-ops experience.</li>\n<li>In-house team and outsourcing vendor management experience</li>\n</ul>\n<p>PERKS AT WORK</p>\n<ul>\n<li>Competitive salary, public transport discounts, great IT equipment, flexible working times, additional holidays and volunteering time, free beverages, diverse sports and health offerings.\nWe celebrate diversity and are committed to building teams that represent a variety of backgrounds, perspectives and skills. All employment is decided on the basis of qualifications, merit and business need.</li>\n</ul>\n<p>LOCATION</p>\n<ul>\n<li>Our office is in Erfurt, Germany. But open from everyone around the country as long as they are willing to travel to Erfurt every once in a while (we have a great office with best coffee and brewery ;-)\nFor right candidate, please email your CV with a short blurb about yourself and links to previous projects you are particularly proud of (in English or German).</li>\n</ul>\n",
    "how_to_apply": "<p>Email your application to: <a href=\"mailto:nicole.nestler@yourwork.com\">nicole.nestler@yourwork.com</a></p>\n",
    "company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBcFNGIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--710dfde4bd0d6df6e16390efbe70bedd90d7d077/y_icon_neu.jpg"
  },
  {
    "id": "f1e47ec6-641c-4b4a-a38a-1a57e6af7c93",
    "type": "Full Time",
    "url": "https://jobs.github.com/positions/f1e47ec6-641c-4b4a-a38a-1a57e6af7c93",
    "created_at": "Mon Jun 29 06:38:28 UTC 2020",
    "company": "InnoGames GmbH",
    "company_url": "https://www.innogames.com",
    "location": "Hamburg",
    "title": "Java Software Developer - Core Team",
    "description": "<p>As <strong>Java Software Developer</strong>, you work closely with our game teams to shape the foundation of our next big hits and contribute as a productive member of an agile development team in all phases of the development lifecycle.</p>\n<p><strong>Your mission:</strong></p>\n<ul>\n<li>Develop features shared across our game backends</li>\n<li>Improve performance-critical components, increase the robustness and scalability of our software</li>\n<li>Improve our libraries and backend services with your knowledge of software architecture and high-quality code</li>\n<li>Maintain and extend our development tools and environment</li>\n</ul>\n<p><strong>Your profile:</strong></p>\n<ul>\n<li>Degree in Computer Sciences, Business Information Systems or equivalent training and experience as IT specialist</li>\n<li>Several years of experience in object-oriented programming in Java with Spring Boot and optimally the Akka framework</li>\n<li>Software development with Spring, the UNIX command line and profound knowledge of SQL, GIT, and Continuous Delivery</li>\n<li>You love to dive deep into other people’s code which is reflected in your Github profile</li>\n<li>Solid experience in using various methods in software design and a strong belief in automated testing to guarantee and improve code quality in compliance with the company standards</li>\n<li>Being a backend geek, you also like to switch to the frontend side with Angular, C# and Unity</li>\n<li>Good English language and overall communication skills</li>\n<li>Proactive and motivated individual with a willingness to learn</li>\n</ul>\n<p><strong>Why join us?</strong></p>\n<ul>\n<li>Be part of a great international team in a healthy and stable-growing company</li>\n<li>Your working device will be the latest MacBook Pro with high-end hardware</li>\n<li>We actively support your further development and give you all the needed resources to evaluate new technologies and participate in open source communities</li>\n<li>We provide additional training budget to spend on attending conferences, taking hard skill courses or improve your soft skills as well as purchasing books</li>\n<li>Our career model is set up equally for an expert in a technical career or a management path</li>\n<li>Use opportunities to make your code open source and show your achievements at international conferences</li>\n<li>We offer competitive compensation with benefits like relocation support, company gym, smartphone or tablet, company bikes, rooftop terrace with BBQ and much more</li>\n</ul>\n<p>Excited to start your journey with InnoGames and join our dynamic team as a <strong>Java Software Developer</strong>? We look forward to receiving your application as well as your salary expectations and earliest possible start date through our <a href=\"https://www.innogames.com/career/detail/job/java-software-developer-core-team/?s=GitHub\">online application form</a>. <strong>Cristal Ledesma</strong> would be happy to answer any questions you may have.</p>\n<p><strong>Apply and #stayhome!</strong> Due to the <strong>coronavirus</strong> outbreak, we switched our operations company-wide to home office and turned our hiring process into <strong>a fully virtual one</strong>. When hiring, we are also open for our new team members starting their work remotely at the time being or adjusting contract start dates accordingly. Stay home and safe!</p>\n<p>InnoGames is Germany’s leading developer and publisher of mobile and online games. The company based in Hamburg is best known for Forge of Empires, Elvenar and Tribal Wars. InnoGames’ complete portfolio encompasses seven live games and several mobile titles in production.</p>\n<p>Born as a hobby, InnoGames today has a team of 400 employees from more than 30 nations who share the passion of creating unique games that players across the globe enjoy for years. In order to further expand our success and to realize new projects, we are constantly looking for young talents, experienced professionals, and creative thinkers.</p>\n",
    "how_to_apply": "<p><a href=\"https://www.innogames.com/career/detail/job/java-software-developer-core-team/?s=GitHub\">https://www.innogames.com/career/detail/job/java-software-developer-core-team/?s=GitHub</a></p>\n",
    "company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBb1dGIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--c9ccbc9b803859a5d8304b3f7d85cc5a0a6d9202/logo_innogames_devlop.png"
  },
  {
    "id": "8d090215-8f42-4b8d-8a27-44cca0394f68",
    "type": "Full Time",
    "url": "https://jobs.github.com/positions/8d090215-8f42-4b8d-8a27-44cca0394f68",
    "created_at": "Sat Jun 27 06:33:39 UTC 2020",
    "company": "Bayforest Technologies",
    "company_url": null,
    "location": "London",
    "title": "Mid-Senior level Software Engineer",
    "description": "<p>Bayforest Technologies, a multi-award winning quantitative investment manager with an outstanding track record, seeks a mid-senior level software engineer.</p>\n<p>Bayforest Technologies is not a conventional hedge fund. We are technologists at heart: our proprietary technology is streaming large amounts of data to identify actionable insights in real time. We are working on the forefront of academia and industry to solve the most challenging and exciting problems in finance.</p>\n<p>We are looking for versatile engineers with strong enthusiasm and a curious nature to drive our technology in order to solve the most challenging problems in finance. You will be involved in our proprietary research  and develop enhanced solutions to deliver them into production. You will be joining a team of developers with previous experience from the likes of market making hedge funds, technology startups, Google, Nokia, Playstation among others.</p>\n<p>Qualifications:</p>\n<p>-Minimum BSc or equivalent in natural sciences, engineering or computer science.</p>\n<p>-Minimum 3 years of experience at  mid-level position or higher as software engineer.</p>\n<p>-Demonstrated proficiency in C++ and one scripting language, preferably Python.</p>\n<p>-Strong awareness of best practices, code standards, building processes, test driven programming and code reviews.</p>\n<p>-Knowledge of algorithm designs.</p>\n<p>-Demonstrable experience of complex software development that was successfully delivered to customers.</p>\n<p>-Familiar with Linux infrastructure.</p>\n<p>-Preferably some knowledge of financial market mechanics.</p>\n<p>A competitive salary is on offer and opportunity to participate in our generous profit sharing in one of the fastest growing and strongly backed systematic hedge funds.</p>\n",
    "how_to_apply": "<p>Email your resume to <a href=\"mailto:hr@bayforest.ai\">hr@bayforest.ai</a></p>\n",
    "company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBb09GIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--7ce26deb773a04eb9b525d36f04c85bde8684f9a/Image%20logo%20CMYK.jpg"
  },
  {
    "id": "5ad0a587-8168-48e8-ae55-a0d6a56200e1",
    "type": "Full Time",
    "url": "https://jobs.github.com/positions/5ad0a587-8168-48e8-ae55-a0d6a56200e1",
    "created_at": "Tue Jun 23 10:25:28 UTC 2020",
    "company": "GooseChase",
    "company_url": "https://www.goosechase.com",
    "location": "Remote",
    "title": "Senior Android Engineer",
    "description": "<p><strong>About GooseChase</strong></p>\n<p>GooseChase is a rapidly growing, fully remote web and mobile platform for creating and facilitating scavenger hunts. Through our website, organizers create custom \"hunts\" for anything from on-boarding new employees, touring museums, engaging at festivals, educating students and more! Participants can compete as teams or individuals to submit photo/video, text or GPS based missions through our native Android and iOS apps.</p>\n<p>The key technologies we use are:</p>\n<ul>\n<li>\n<strong>Android App</strong>: Java using Realm for local data storage. Open to moving to Kotlin going forward.</li>\n<li>iOS App: Primarily Objective-C (UI with PureLayout and Layout Anchors), with a bit of Swift and Realm for local data storage. Looking to move towards Swift going forward.</li>\n<li>Front-End: Typescript with React (Redux), HTML, SCSS &amp; Webpack.</li>\n<li>Back-End: Django, REST (Tastypie), Task Queuing (Celery, Redis, RabbitMQ), Postgres, Nginx, Gunicorn.</li>\n</ul>\n<p>Because of the flexibility and ease-of-use of our product, we have successfully powered game types ranging from festival-wide competitions, with thousands of dollars in prizes, to K-12 classroom lessons on government types, featuring gummy bears to help demonstrate the differences between a dictatorship and a democracy!</p>\n<p>Seeing the different ways the product can be used, and the joy it creates in those who participate, is an incredibly rewarding experience &amp; is something we’d love to share with you as well! You'll also be having a major impact as our apps have been responsible for ~10M submissions in the last year alone!</p>\n<p><strong>Responsibilities</strong></p>\n<p>As Senior Android Developer, you’ll have the opportunity to create new, exciting features for our game participants. You will work directly with our design and back-end teams to bring feature mock-ups to life, delighting our users and ensuring the delivery of high-quality code that focuses on reliability and performance.</p>\n<p>Specific responsibilities include:</p>\n<ul>\n<li>Being familiar and up-to-date with the platform functionality (online game manager &amp; participant mobile apps).</li>\n<li>Working with our customer success &amp; design teams to understand the motivations for a feature &amp; coding it with those objectives and the user's experience in mind. Put another way, we want you to know why you are doing what you’re doing!</li>\n<li>Staying up to date with the relevant Android guidelines and best practices, as well as relevant SDK changes and common libraries.</li>\n<li>Developing the mobile components for new features that will help game participants play games more effectively while delighting them in new and unexpected ways.</li>\n<li>Participating as a member of the development team - sharing best practices &amp; learnings so the rest of the team can improve.</li>\n<li>Working under limited supervision with significant latitude for the use of initiative and independent judgment.</li>\n<li>At least base level experience with the iOS platform to support other engineers.</li>\n</ul>\n<p><strong>Job Requirements</strong></p>\n<p>The candidate for this position must be:</p>\n<ul>\n<li>At an advanced level in Android application development, with architect-level involvement in at least one large production app that has been published in the Play Store.</li>\n<li>Deeply knowledgeable about Android programming best practices and how to implement them in an existing project.</li>\n<li>Able to take ownership of work, maintaining high standards of performance, reliability &amp; security.</li>\n<li>An excellent communicator, problem solver, and creative thinker.</li>\n<li>Located within, or has regular working hours within the GMT-8 (PST) to GMT+2 (CEST) time zones to ensure sufficient overlap with our distributed product team.</li>\n</ul>\n<p>Although not strictly required, it would be a massive plus if the candidate had past experience:</p>\n<ul>\n<li>Working with the platform-specific camera APIs to capture and display photos/videos.</li>\n<li>Implementing automated testing into legacy applications.</li>\n<li>Participating in smaller teams, especially in a remote setting.</li>\n</ul>\n<p><strong>Perks</strong></p>\n<ul>\n<li>Fully remote work - work whenever/wherever/however you want.</li>\n<li>Competitive compensation &amp; benefits, including stipends for equipment, co-working spaces, etc.</li>\n<li>Join a company that is profitable &amp; growing quickly, but still prioritizes doing the right thing over everything else.</li>\n<li>Significant learning opportunities - whether it’s learning about other parts of the business or taking on more responsibility, we expect everyone on the team to be continually looking to grow.</li>\n</ul>\n",
    "how_to_apply": "<p>Interested? Drop us a line with your CV at <a href=\"mailto:careers@goosechase.com\">careers@goosechase.com</a>!</p>\n",
    "company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBbUNGIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--c190d7c30468e83b151f241c8e78604ae3ba5001/Icon.png"
  },
  {
    "id": "4e563965-9d53-4547-8a98-f8f0dfb7ec18",
    "type": "Full Time",
    "url": "https://jobs.github.com/positions/4e563965-9d53-4547-8a98-f8f0dfb7ec18",
    "created_at": "Mon Jun 22 09:54:06 UTC 2020",
    "company": "Cleverbase",
    "company_url": "http://http",
    "location": "Den Haag",
    "title": "Backend developer - Scala - engineer (medior & senior)",
    "description": "<p>You’re an enthusiastic <strong>Scala engineer</strong> who wants to make a difference. You’re looking for an ambitious and international team in The Hague. And we’re looking for a <strong>backend developer</strong> like you. Your contribution is going to enable The Netherlands to further digitalise and say goodbye to paper administration.</p>\n<p>Whether you have plenty experience or no experience but plenty knowledge, you are welcome at Cleverbase. We use <strong>Domain Driven Design</strong> to tend to our business domain (Qualified Information Exchange) and develop software based on pure <strong>functional Scala</strong> (cats, cats-effect, fs2, Akka) in a microservices architecture. Because European legal standards challenge us to hone in on code quality and auditability, we are looking for a trustworthy backend developer that has an eye for aspects like these. </p>\n<h2>Working as a backend developer at Cleverbase</h2>\n<p>As Qualified Trust Service provider, Cleverbase is licensed to issue PKI certificates within the Public Key Infrastructure of the Dutch government. With our products, you can log in, exchange information and sign documents on the highest eIDAS security level. After a one-time registration, you can, for example, digitally sign their deed of purchase with the same legal power as a signature on paper. Completely safe, with your own phone and pin code. </p>\n<p>During pressure cooker sessions, design sprints and in our labs, we develop prototypes to quickly discover how we can turn concepts into actual, valuable products and services. That’s how, in three days, we enabled Noria to digitally sign a European tender.</p>\n<p>Demand for our products is high and our organisation is growing quickly. Working at Cleverbase means contributing to a safe digital environment. We’re proud of what we’ve accomplished so far and celebrate our successes together, but we’re far from done. That is why we are looking for an ambitious Scala engineer like you to come and help us. </p>\n<h2>What we ask</h2>\n<p>Preferably an allrounder/Jack-of-all-trades, but don’t be put off by this. It’s nice if you match below profile as much as possible. Are there things you want develop, let us know how we can work on it together.</p>\n<ul>\n<li>Experience with Scala and knowledge of and/or interest in Domain Driven Design, cats, cats-effect, fs2, Akka and microservices architecture.\nYou understand that compliance and security are extremely important for us and you have an eye for code quality, security, auditability and data integrity.</li>\n<li>You write tests for all your code and have experience with continuous integration.</li>\n<li>You don’t shy away from documenting when it matters.</li>\n<li>You are available for 32-40 hours per week. </li>\n</ul>\n<h2>Bonus points for </h2>\n<ul>\n<li>Knowledge of and/or interest in TLS and PKI.</li>\n<li>Experience in an ISO-27001 and/or TWS certified environment.</li>\n</ul>\n<h2>What we offer you</h2>\n<ul>\n<li>An informal and dynamic work environment in which talent, initiative and involvement are appreciated and rewarded.</li>\n<li>Fun, ambitious and smart colleagues with enthusiasm for what they create.</li>\n<li>Above average salary, non-contributory pension, travel and phone allowance.</li>\n<li>26 vacation days (based on 40 hours).</li>\n<li>Many opportunities for growth and development.</li>\n<li>A laptop of your choice: Macbook Pro with macOS or Lenovo Thinkpad with Linux.</li>\n</ul>\n<p>In this current situation we all work from home, but once we go back to working at the office, the following is included as well:</p>\n<ul>\n<li>The best view of The Hague in an office building with coffee bar, food court, and fitness area, easy to reach by public transport, car or bike.</li>\n<li>Healthy lunch served at the office every day.</li>\n</ul>\n<h2>Are you our new backend developer?</h2>\n<p>You’re interested and want to apply: time to update your CV, write a motivation letter via <a href=\"https://vonq.io/3dLPas8\">this link</a> or call +316 1429 1425. As well when you have talents that can contribute to Cleverbase’s ambition in another way. We look forward to receiving your application!</p>\n",
    "how_to_apply": "<p><a href=\"https://vonq.io/3dLPas8\">Click here to apply!</a></p>\n",
    "company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBazJGIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--f1ab58d6afc6249c6269ca9642a2d87799025d30/Cleverbase.jpeg"
  },
  {
    "id": "4c8e675c-e207-4a9c-b1e7-117336c4b983",
    "type": "Full Time",
    "url": "https://jobs.github.com/positions/4c8e675c-e207-4a9c-b1e7-117336c4b983",
    "created_at": "Sat Jun 20 04:52:53 UTC 2020",
    "company": "Deep Consulting Solutions",
    "company_url": "https://deepconsulting.solutions",
    "location": "Worldwide",
    "title": "Full Stack Software Engineer (Node.js, React, AWS) - Remote",
    "description": "<p><em>(Remote, Full-Time, Anywhere in the World)</em></p>\n<p>We are looking for a skilled and passionate Full Stack Software Engineer to join our Tech Team to build and scale effective software solutions. We are in need of an enthusiastic self-starter with expertise in building highly functional solutions involving multiple systems using the Javascript (Node, Express, React stack).</p>\n<p><strong>What We Do</strong></p>\n<p>We work with niche companies in the US, Canada, the UK to restructure and automate their operation so that their businesses can grow 5-10x. We do that by effectively analyzing their business, streamlining their processes, and designing an effective automation solution that we then implement on our robust IT stack.</p>\n<p>We make extensive use of technologies that help us accomplish results with less work — making everyone inside of our global organization more effective.</p>\n<p>We heavily leverage:</p>\n<ul>\n<li>\n<p>Amazon AWS's serverless technologies and microservices for our front-end, back-end, and mobile apps (Lambda, Amplify, Cognito, S3, etc.).</p>\n</li>\n<li>\n<p>Zoho's CRM and ERP Tools (Desk, Books, etc.).</p>\n</li>\n<li>\n<p>Vonage/Nexmo-based telephony and communications solutions (Vonage Business Phone, Nexmo Voice/SMS, OpenTalk, etc.).</p>\n</li>\n</ul>\n<p>We are always looking for new technologies and welcome team members adding things to our technology stack so we can deliver more results more effectively.</p>\n<p><strong>What You Will Do</strong></p>\n<p>As an Engineer, you will be responsible for delivering the solution as per requirements put together by our Creative and Business Analysis Teams. Depending on your level, you will be responsible for either the entire project (with other engineers working in your project team) or for a part of it.</p>\n<p>Your ultimate deliverable will be to effectively build a solution that will be implemented in the client's business and run successfully going forward.</p>\n<p>In doing so, you will:</p>\n<ul>\n<li>\n<p>Design and architect complex solutions involving web apps (front+back), custom CRM/ERP's, programmable telephony, and occasionally mobile apps.</p>\n</li>\n<li>\n<p>Deliver and implement your solutions.</p>\n</li>\n<li>\n<p>Create effective monitoring of the solutions for effective usage and scalability.</p>\n</li>\n<li>\n<p>Do anything else you deem necessary to accomplish your result.</p>\n</li>\n</ul>\n<p><strong>Requirements</strong></p>\n<p>You are:</p>\n<ul>\n<li>Responsible and driven by results.</li>\n<li>Genuinely interested in technology.</li>\n<li>Willing to learn, grow, and admit mistakes.</li>\n<li>Able to communicate with other people on the project's team effectively.</li>\n</ul>\n<p>You have:</p>\n<ul>\n<li>A solid knowledge of Node.js, React, Express, and TypeScript.</li>\n<li>Experience with complex SQL and NoSQL databases.</li>\n<li>Experience with APIs to connect complex applications.</li>\n<li>Effective written and verbal English to communicate with our international team.</li>\n<li>Basic understanding of DevOps and SDLC to cooperate with other developers in building the product.</li>\n</ul>\n<p>Will be a good plus:</p>\n<ul>\n<li>Experience with Amazon AWS, serverless technologies, and microservices on its platform.</li>\n<li>Experience with CRM and ERP systems such as Zoho and others.</li>\n</ul>\n<p><strong>What We Offer</strong>\n​</p>\n<ul>\n<li>Results-Focused Approach to Work</li>\n</ul>\n<p>We do not look at people's activities, the number of lines of code written, etc., as the measure of success. We look strictly at the results in effectively delivered products.</p>\n<ul>\n<li>Results Based Compensation Schedule</li>\n</ul>\n<p>There is base pay and project bonus pay. Base pay varies significantly by the Engineer's level of ability and responsibility (Lead/Associate/Assistant) that the Engineer takes on projects - this level is reassessed after every project that the Engineer completes. Projects upon completion are rewarded with a bonus - bonus depends on the delivery of all requirements assigned to the Engineer, timeliness of delivery, rate of errors, and the amount of management attention needed in the project. Engineers who can deliver functional solutions that match requirements quickly and with little management action to correct errors get the best rewards and promotions in the organization.</p>\n<ul>\n<li>Freely Arranged Schedule</li>\n</ul>\n<p>You decide when you want to work. What we expect from you are results. There is a daily stand-up call — but outside of it, you can manage your schedule as you prefer.</p>\n<ul>\n<li>Work as an Engineer, Not Just a Coder</li>\n</ul>\n<p>Our Engineers work to build solutions and not just to write code. You will have freedom in how you want to architect the solutions you are making and we will heavily encourage initiative on your part.</p>\n<ul>\n<li>Growth Within Our Organization</li>\n</ul>\n<p>We are a dynamic and growing organization with a team spread around multiple continents. If you prove yourself as a responsible, driven and motivated individual, there will be opportunities for you to lead projects and manage tech teams.</p>\n<p><strong>Hiring Process</strong></p>\n<p>Our candidate selection process is designed to assess people strictly by their merit. We do not make you go through a long round of interviews, instead, we follow a straight-forward sequence:</p>\n<ol>\n<li>\n<p>Job Application Form.</p>\n</li>\n<li>\n<p>Online Skills Assessment.</p>\n</li>\n<li>\n<p>Interview.</p>\n</li>\n<li>\n<p>Paid Practical Assignment.</p>\n</li>\n<li>\n<p>Evaluation and Offer.</p>\n</li>\n</ol>\n",
    "how_to_apply": "<p>Apply at link: <a href=\"https://zfrmz.com/t8wmHEjhyUKgAZIpc5MC?src=github\">https://zfrmz.com/t8wmHEjhyUKgAZIpc5MC?src=github</a></p>\n",
    "company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBa0NGIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--ecb2d095316307ab70bafaeaef965bf77486d2f1/DCS-Logo-sq-s-01.png"
  },
  {
    "id": "2c8ec450-7ddb-48fd-9f8f-e4dc43b7472f",
    "type": "Full Time",
    "url": "https://jobs.github.com/positions/2c8ec450-7ddb-48fd-9f8f-e4dc43b7472f",
    "created_at": "Fri Jun 19 23:21:08 UTC 2020",
    "company": "Hop Labs",
    "company_url": "https://www.hoplabs.com/",
    "location": "Atlanta, GA or Remote (U.S.)",
    "title": "Software Development Engineer (ML)",
    "description": "<p><em>The Company</em></p>\n<p>At Hop Labs, our mission is simple: we build technology that meaningfully impacts people’s lives.</p>\n<p>We work on a variety of projects in a range of industries, from fighting cancer through deep learning, to training a computer to help you find the best-fitting pair of pants. We've helped large, established companies nurture innovative ideas, and we’ve collaborated with cutting-edge startups to be the large, established companies of tomorrow.</p>\n<p><em>The Team</em></p>\n<p>Our team reflects our belief in quality over quantity. Some of our past projects have resulted in publications and patents, have been featured in the press, and have been deployed with well-known brands. We do few things, but we do them extremely well:</p>\n<ul>\n<li>\n<p>Machine Learning -- Deep Learning / AI / RNNs</p>\n</li>\n<li>\n<p>Computer Vision</p>\n</li>\n<li>\n<p>Product Strategy and Product Roadmap</p>\n</li>\n<li>\n<p>MVP Development</p>\n</li>\n</ul>\n<p>We're a small team that's about making an outsized impact. We embrace diversity, investing in our employees, and flexible work schedules. We aim to enjoy our work and deliver beyond expectations. If you’re a technologist who wants to work on projects that make a difference, please reach out to us.</p>\n<p><em>The Role</em></p>\n<p>Currently, we’re looking to hire a full-time Software Development Engineer (ML). Titles can be arbitrary, so you should consider yourself a good fit for this if:</p>\n<ul>\n<li>\n<p>You enjoy solving hard technical problems at scale.</p>\n</li>\n<li>\n<p>You’re comfortable proposing end-to-end technical architectures that balance modularity, scalability, operations, security, and cost.</p>\n</li>\n<li>\n<p>You’re fluent in the AWS stack. This does not mean you understand every AWS service or that you have an AWS certification, but it does mean that you could independently design and build a distributed API within AWS that reflects modern best practices.</p>\n</li>\n<li>\n<p>You understand that clarity and simplicity -- in code and in communication -- are worth striving for.</p>\n</li>\n<li>\n<p>You have at least a passing familiarity with machine learning, and an interest in developing your skills there.</p>\n</li>\n</ul>\n<p>As a distributed team, some key qualities are particularly important for all of us at Hop Labs:</p>\n<ul>\n<li>\n<p>A strong sense of ownership and initiative</p>\n</li>\n<li>\n<p>Clear and consistent communication</p>\n</li>\n<li>\n<p>A collaborative mindset</p>\n</li>\n<li>\n<p>Clear thinking and attention to detail for complex projects</p>\n</li>\n</ul>\n<p>For this role specifically:</p>\n<ul>\n<li>\n<p>Open to all backgrounds, though machine-learning background preferred</p>\n</li>\n<li>\n<p>Intermediate to senior level preferred</p>\n</li>\n<li>\n<p>Location preference: in or near Atlanta, but remote within the U.S. is possible</p>\n</li>\n<li>\n<p>U.S. work authorization necessary</p>\n</li>\n</ul>\n<p>And if you’re not sure you’re a good fit, apply anyway! We will not think poorly of you -- some of our best folks have come from surprising backgrounds. We have made an effort to introduce a hiring process that is low-pressure and skills-focused, and compatible with the other commitments in your life.</p>\n",
    "how_to_apply": "<p>Email <a href=\"mailto:hiring@hoplabs.com\">hiring@hoplabs.com</a> with an introduction and a description of what you’re looking for in the next stage of your career.</p>\n<p>Please include a link to either your resume or an updated LinkedIn profile. GitHub / Kaggle profiles are also great if you have them, but won’t hurt you if you don’t.</p>\n<p>Thanks!</p>\n",
    "company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBajZGIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--bd9cc9615150f6c5f8c60e48de35477c30d16aa5/Hop-Logo.png"
  },
  {
    "id": "75180814-9cb0-4326-b388-9ff7ae267426",
    "type": "Full Time",
    "url": "https://jobs.github.com/positions/75180814-9cb0-4326-b388-9ff7ae267426",
    "created_at": "Fri Jun 19 16:25:19 UTC 2020",
    "company": "Anedot",
    "company_url": "https://anedot.com",
    "location": "Remote (LA, CA, WA, TX, MD, OH)",
    "title": "Senior Frontend Programmer",
    "description": "<p>You enjoy programming for complex data platforms with transactional workflows and zero tolerance for errors. We believe that happy people produce better results for themselves and the collective team. We believe and value empowering people to work on something they enjoy — thus applicants likely would want to have an interest in serving campaigns, churches, ministries, non-profits, and schools.</p>\n<h3>5 Tasks &amp; responsibilities</h3>\n<ol>\n<li>Write well-designed, testable code, commit work to GitHub and write tests for existing and created code to ensure compatibility and stability.</li>\n<li>Work in friendly agile team, collaborative, engineering environment with continuous delivery.</li>\n<li>Review the work of other engineers providing feedback and suggestions for improvement.</li>\n<li>Work with the team to upgrade, troubleshoot, and debug, existing systems.</li>\n<li>Continuously increase knowledge and skills (including relevant codebase languages, frameworks, &amp; tools).</li>\n</ol>\n<h3>4 Skills &amp; experience the candidate must have</h3>\n<ol>\n<li>Full-stack programming experience on a platform serving at least thousands of users (Strongly prefer with strong React knowledge and basic Ruby/Rails).</li>\n<li>Minimum 5 years working in an agile team-oriented development environment with peer code reviews.</li>\n<li>Strong familiarity with React.</li>\n<li>Bachelor’s degree (computer science, math, or related field a plus).</li>\n</ol>\n<h3>Ways the candidate will be evaluated</h3>\n<ol>\n<li>App performance</li>\n<li>Code contribution and quality (Git metrics)</li>\n<li>Communication, teamwork, documentation, and completeness of work; aka \"responsible and cool to work with\" (peer review)</li>\n</ol>\n<h3>Compensation</h3>\n<ul>\n<li>Based on experience</li>\n<li>PTO Minimum 18-days per year</li>\n<li>Remote work from CA, FL, LA, MD, OH, TX, or WA</li>\n<li>Temporarily paused: Fitness Allowance, Wellness Allowance, Home-office Allowance, and CSA Allowance</li>\n<li>401k plan available</li>\n</ul>\n<h3>Team</h3>\n<p>Programmers work on our Product team as part of the Engineering team.</p>\n<ul>\n<li>Operations (Accounts, Finance, Service)</li>\n<li>Product (Design, DevOps, Engineering)</li>\n<li>Growth (Marketing, Outreach, Success)</li>\n</ul>\n<h3>Company Values</h3>\n<p>We're rooted in Southern Louisiana but operate as a remote-first company that supports our team living in Texas, California, Washington, Ohio, Maryland, and Florida. We've got an old fashioned commitment to honor and excellence in what we do, and our customer-first hospitality is described as welcoming, courteous, helpful, respectful, and kind. We're the type of people whom you count on to do what is right and have your back.</p>\n<h3>Technical Info</h3>\n<ul>\n<li>Javascript (React)</li>\n<li>Ruby (Rails)</li>\n<li>Postgres</li>\n<li>GitHub</li>\n<li>AWS Cloud platform</li>\n<li>Kubernetes</li>\n<li>Sidekiq Enterprise for workers/jobs/queues</li>\n<li>Testing tools/frameworks</li>\n<li>TravisCI</li>\n<li>Jest</li>\n<li>Cypress</li>\n<li>GitHub Actions</li>\n</ul>\n<h3>Application Process</h3>\n<ul>\n<li>Submit Team Member Application (<a href=\"https://anedot.com/careers\">https://anedot.com/careers</a>)</li>\n<li>Fit Assessment</li>\n<li>Technical Assessment</li>\n<li>Team Specific Interview</li>\n</ul>\n",
    "how_to_apply": "<ul>\n<li>Submit Team Member Application (<a href=\"https://anedot.com/careers\">https://anedot.com/careers</a>)</li>\n<li>Fit Assessment</li>\n<li>Technical Assessment</li>\n<li>Team Specific Interview</li>\n</ul>\n",
    "company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBanVGIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--8863996d3a2db0cec0c55b5806664e4ac7b1207e/Anedot--Blue.png"
  },
  {
    "id": "a1267927-8a24-49c7-9394-c20201fc451a",
    "type": "Full Time",
    "url": "https://jobs.github.com/positions/a1267927-8a24-49c7-9394-c20201fc451a",
    "created_at": "Fri Jun 19 10:00:21 UTC 2020",
    "company": "Zeeman",
    "company_url": "http://www.zeemanvacatures.nl",
    "location": "Alphen aan den Rijjn",
    "title": "Low-Code Software Developer / Modelleur",
    "description": "<p>Locatie De Schans 15, Alphen aan den Rijn</p>\n<p>Uren per week 32 tot 38 uur</p>\n<p>Werk-/denkniveau Wo, Hbo</p>\n<h2><strong>Over de afdeling ICT</strong></h2>\n<p>Zeeman is een snel groeiende Europese organisatie met zo’n 8.000 medewerkers en met inmiddels 1.300 filialen in 7 Europese landen, namelijk België, Duitsland, Frankrijk, Luxemburg, Nederland, Oostenrijk en Spanje. ICT is belangrijk in een grote en efficiënte organisatie zoals Zeeman. Onze ICT organisatie is vooruitstrevend. Wij spelen alert in op ontwikkelingen van nieuwe toepassingen op ICT in de retailwereld en gebruiken daarbij geavanceerde systemen en hulpmiddelen.</p>\n<h2><strong>Jouw rol als Developer / Modelleur</strong></h2>\n<p>In de rol van Software Developer / Modelleur ga jij samen met een team een compleet nieuw en modern ERP ontwikkelen. Je werkt daarbij in Agile teams nauw samen met jouw teamleden in het Software Development team, maar ook samen met de Business Analisten en specialisten binnen diverse afdelingen.</p>\n<p>We hebben ons nieuwe ERP de naam Epic gegeven. Het zal onze bedrijfsprocessen maximaal gaan ondersteunen. Alle facetten van een complexe applicatie komen hierbij aan bod: van workflow tot data-ontsluiting, interfaces en apps. De komende jaren zal jij je bezig houden met het modelleren en het ontwikkelen van de bedrijfslogica. Daarna zullen nog voldoende wensen beschikbaar zijn om nog flink door te ontwikkelen.</p>\n<p>We werken met het low-code platform van Thinkwise. Jij kunt hierin al je passie voor softwareontwikkeling kwijt.</p>\n<p>Je werkt vanzelfsprekend met een Low-Code platform (Thinkwise), waarin je al je passie voor softwareontwikkeling kwijt kunt. Naast inhoudelijke kennis en ervaring met softwareontwikkeling, ben je ook bekend met de Agile manier van werken</p>\n<h2><strong>Wat neem je mee?</strong></h2>\n<ul>\n<li>HBO/WO -werk- en -denkniveau (afgestudeerd in een technische richting, bijvoorbeeld Bedrijfskundige Informatica of Business IT &amp; Management);</li>\n<li>Ervaring met een Low-Code platform (Thinkwise / Outsystems / Mendix);</li>\n<li>Ervaring met de Agile manier van werken;</li>\n<li>Goede mondelinge en schriftelijke vaardigheden;</li>\n<li>Kennis en ervaring van bedrijfsprocessen en softwareontwikkeling;</li>\n<li>Ruime ervaring met SQL (tabellen maken / stored procedures / inrichten) is een eis;</li>\n<li>Communicatief sterk, makkelijk in de omgang, staat stevig in zijn schoenen en analytisch aangelegd.</li>\n</ul>\n<h2><strong>Wat krijg je terug?</strong></h2>\n<ul>\n<li>Zeeman is volop in ontwikkeling, zowel door het verbreden van haar klantenkring als door internationale expansie en daardoor biedt Zeeman je een afwisselende en uitdagende functie in een omgeving die continu in beweging is.</li>\n<li>Werkzaam zijn bij een Retailer die alles op het gebied van IT zelf uitvoert en waar maatschappelijk verantwoord ondernemen een hoge prioriteit is</li>\n<li>Als je fulltime werkt (40 uur), krijg je 24 vakantiedagen en 12 ADV-dagen per jaar</li>\n<li>Reiskostenvergoeding</li>\n<li>Studiemogelijkheden voor onder andere cursussen/ opleidingen etc.</li>\n<li>20% personeelskorting</li>\n<li>Mogelijkheid tot deelname in een collectieve ziektekostenverzekering</li>\n</ul>\n<h2><strong>Vragen over deze vacature?</strong></h2>\n<p>Neem dan contact op via het algemene telefoonnummer\n0172 482 911</p>\n<h2><strong>Interesse?</strong></h2>\n<p><a href=\"https://vonq.io/3edIG5t\">Klik hier om te solliciteren!</a></p>\n",
    "how_to_apply": "<p><a href=\"https://vonq.io/3edIG5t\">Klik hier om te solliciteren!</a></p>\n",
    "company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBaTJGIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--450b330d165cd29daa0967ce4d54e943e76b9a28/companyLogo-AAEAAQAAAAAAAAdOAAAAJDZlMWQxYWZjLTlkOGUtNDljMi1hNWM2LTNiMWNkMDU0NmMwNw%5B1%5D.png"
  },
  {
    "id": "9c455180-ecca-11e8-886b-ae327644a48e",
    "type": "Full Time",
    "url": "https://jobs.github.com/positions/9c455180-ecca-11e8-886b-ae327644a48e",
    "created_at": "Tue Nov 20 13:52:15 UTC 2018",
    "company": "Huawei",
    "company_url": "https://www.huawei.com",
    "location": "Munich, Germany",
    "title": "Senior Software Engineer (m/f)",
    "description": "<p>Huawei is a leading provider of information and communications solutions. Our products have been deployed in over 140 countries serving more than one third of the world’s population. For the Trusted System Protection (TSP) team within the Cyber Security and Privacy Protection Laboratory (CSPL) in Munich, Germany we are currently looking for a Senior Software Engineer enthusiastic to work on cutting-edge security technologies and to contribute to the security architecture of future Huawei products in a diverse range of verticals, from telecom to cloud and IoT platforms.</p>\n<h3>Your responsibilities</h3>\n<ul>\n<li>Design, implement, test and document advanced security technology prototypes for trusted computing, system integrity protection and platform resilience</li>\n<li>Analyze product architecture and source code and collaborate with product line engineers to adapt the developed prototypes to product architectures</li>\n<li>Contribute to joint research projects with our European partners from academia and industry</li>\n</ul>\n<h3>Our requirements</h3>\n<ul>\n<li>Experience in designing, implementing and debugging embedded firmware and applications in C, for ARMv7/8-A, ARMv7/8-M, other embedded architectures or x86</li>\n<li>Professional knowledge in one or more of following areas:\n<ul>\n<li>Microcontroller and application processor architectures, DeviceTree, board bring-up, Secure Boot, flash storage, buses, Secure Update</li>\n<li>Linux OS kernel internals, memory management, containers, virtualization, security features</li>\n<li>Development with common security protocols (e.g. TLS, IPSec, OAuth 2.0 etc.), crypto libraries (e.g. OpenSSL, mbedTLS), PKCS#11 or Linux kernel crypto API, X.509 certificates and PKI</li>\n<li>Linux – network / system tools / command line interface / scripting</li>\n<li>Code debugging techniques</li>\n<li>Proficiency in English</li>\n</ul>\n</li>\n<li>Following are desirable:\n<ul>\n<li>Trusted Computing</li>\n<li>Hardware security architectures and best practices</li>\n<li>Python, Go; Javascript, Node.JS and micro service architectures</li>\n<li>Experience with cloud technologies such as OpenStack and containers (Docker/Kubernetes)</li>\n<li>DevOps methodologies such as agile development and continuous delivery</li>\n<li>Experience in contributing to open-source projects</li>\n</ul>\n</li>\n</ul>\n<p>Candidate should be self-motivated to research and compare new software technologies and be in a position to rapidly become accustomed to them in a relatively short period of time.</p>\n<p>Able to independently design, build, and maintain efficient, reusable and secure code. Identify potential bottlenecks and bugs and devise solutions to the problems. Analyze existing code and identify points of improvement.</p>\n<p>Capable to analyze complex software architectures and prioritize development tasks to maximize efficiency and output. Able to troubleshoot problems in an existing code base with limited documentation.</p>\n",
    "how_to_apply": "<p>Please send your CV to <a href=\"mailto:jane.jeffreys@huawei.com\">jane.jeffreys@huawei.com</a>.</p>\n",
    "company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBaVJYIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--fb8499ec0b8cfed521539de0c702dd3bf1c2b87f/8ed5a22c-7b16-41b0-9320-c538c2717293"
  },
  {
    "id": "07b3ce1e-ecbd-11e8-9de2-0e34d5bd5011",
    "type": "Full Time",
    "url": "https://jobs.github.com/positions/07b3ce1e-ecbd-11e8-9de2-0e34d5bd5011",
    "created_at": "Tue Nov 20 12:09:59 UTC 2018",
    "company": "Mindhive",
    "company_url": "http://www.mindhive.org",
    "location": "Brisbane CBD Australia",
    "title": "Senior Front End and Backend Developers",
    "description": "<p><strong>MINDHIVE FRONTEND AND BACKEND DEVELOPER ROLES</strong></p>\n<p>An exciting opportunity exists to work at Mindhive [www.mindhive.org] - the world’s first crowdsourced consultancy. We're looking for an experienced backend developer as part of our core team to take on some of our most demanding challenges to build and create a platform that will improve productivity and in turn change the way Mindhive clients and contributors solve challenges. You will be working closely with the engineering lead and developers in an agile environment with a high degree of freedom.</p>\n<p><strong>Mindhive</strong></p>\n<p>Mindhive sets out to do things differently – we’re taking a unique approach to creating the future of problem solving. The Company's core product is Mindhive - a cloud-based platform where organisational users (who pay) bring challenges to be solved by a growing community of high-quality individual users (non-paying) with a broad range of professional backgrounds and experiences. The model enables organisational users to gather, share and evaluate ideas efficiently and effectively, and gain access to diverse approaches to solving difficult problems. The existing model requires curation and input by administrators and does not take full advantage of the rich data available.</p>\n<p>Since completing a successful capital raising in 2017, the Company has hired a world-class development team [and has partnered with a leading digital design company Joseph Mark] which has given it the capability to develop a more technically complex platform ecosystem-style product (‘Mindhive 2.0’). Mindhive 2.0 will be a revolutionary approach that is ambitious in scale but grounded in historical experience (from the current platform) and growing market appetite for crowdsourcing and artificial intelligence</p>\n<p><strong>SENIOR BACKEND DEVELOPER ROLE</strong></p>\n<p>As a backend developer, you will help design, implement, deploy &amp; support Mindhive’s platform which includes (and not limited to):</p>\n<p>Cloud services\nDatabase\nIntegrations (in-house &amp; third party)\nTests (unit &amp; integration)</p>\n<p><strong>What you’ll do</strong></p>\n<p>Primary responsibility: Implement services (backend API endpoints) for mobile first web apps\nAdditional key responsibilities include:</p>\n<p>Develop cloud-based API services\nDevelop in-house &amp; 3rdparty integration interfaces\nDevelop database models\nImplement automated tests\nDevelop CI/CD scripts\nDevelop performance and monitoring interfaces\nAnalyse business and technical requirements</p>\n<p><strong>What you’ll bring</strong></p>\n<p>Detailed understanding of cloud architecture(s)\nDetailed knowledge of Python &amp; Node.JS\nDetailed knowledge of Django\nDetailed knowledge of Docker\nExperience working with\nPostgres and NoSQL database(s)\nExperience with authentication protocols &amp; certificates\nBonus: detailed knowledge of machine learning &amp; AI</p>\n<p><strong>How do I level up?</strong></p>\n<p>Roles within reach for the employee - Development Team Lead</p>\n<p><strong>Bespoke Requirements / Additional Responsibilities</strong></p>\n<p>Develop and maintain software specifications and architecture documents\nProvide accurate work estimates\nEngage in regular check-ins and follow-up with other developers in the team\nFollow Mindhive’s product development process and methodology</p>\n<p><strong>SENIOR FRONTEND DEVELOPER ROLE OVERVIEW</strong></p>\n<p>As a frontend developer, you will help design, implement, deploy &amp; support Mindhive’s platform which includes (and not limited to):</p>\n<p>Web application\nMobile application\nIntegrations (in-house &amp; third party)\nTests (unit &amp; integration)</p>\n<p><strong>What you’ll do</strong></p>\n<p>Primary responsibility: Implement UX/UI for mobile first web and mobile apps</p>\n<p><strong>Additional key responsibilities include:</strong></p>\n<p>Utilise any and all relevant frameworks, libraries and techniques:</p>\n<p>JavaScript (Vue.js and React Native)\nHTML5, CSS3 and SCSS for design implementations\nLinux Command Line (for bonus points)\nDemonstrate use of modern development practices such as use of Object-Oriented Design, Web Services (REST), Version Control (utilizing Git), Build processes and packaging (Webpack, etc), Automated Testing and Responsive Website Development\nCut up and implement designs\nInform the product team of relevant possibilities and solutions\nDevelop integration with cloud-based API services (in-house &amp; third party)\nReview and inform database models are in alignment with frontend view models &amp; components\nImplement components unit tests and automated tests as required\nDevelop web/site/mobile app performance and monitoring interfaces\nAnalyse business and technical requirements\nMinimise bugs in released code</p>\n<p><strong>What you’ll bring</strong></p>\n<p>Experience with current industry design tools (e.g. Figma)</p>\n<p>Understanding, and preferably experience in, agile project methodology\nYou have experience with version control and project management systems\nCan work and communicate effectively within multidisciplinary teams\nKnowledge of Accessibility and Security Principles\nUndergraduate degree in IT or relevant programming experience\nImpeccable attention to detail\nInnovative thinking and problem solving\nCourteous, supportive and honest\nMotivated self-starter, with the ability to manage your own time and adhere to time and budget restrictions\nEnthusiasm for the work\nMindhive does and your important role in delivery\nCreative thinking &amp; abstract, technical problem solving\nProactivity\nCollaboration</p>\n<p><strong>How do I level up?</strong></p>\n<p>Roles within reach for the employee - Development Team Lead</p>\n<p><strong>Bespoke Requirements / Additional Responsibilities</strong></p>\n<p>Develop and maintain software specifications and architecture documents:\nProvide accurate work estimates\nEngage in regular check-ins and follow-up with other developers in the team\nFollow Mindhive’s product development process and methodology</p>\n",
    "how_to_apply": "<p>Email your resume to <a href=\"mailto:career@mindhive.it\">career@mindhive.it</a></p>\n",
    "company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBaUpYIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--5a6c8dd1ece5763c8a6aeb215ff3189fd8ed3bd7/c540fe15-d18d-48bd-95de-cf0a85125293"
  },
  {
    "id": "c5901f00-ec36-11e8-8d10-e7913612ce87",
    "type": "Full Time",
    "url": "https://jobs.github.com/positions/c5901f00-ec36-11e8-8d10-e7913612ce87",
    "created_at": "Mon Nov 19 20:08:09 UTC 2018",
    "company": "Prezi",
    "company_url": "http://prezi.com",
    "location": "San Francisco ",
    "title": "Senior Full Stack Engineer ",
    "description": "<p>Prezi strives to enable people to share ideas with each other, using our extraordinary product in a provenly more engaging and more effective way by helping millions of people build and deliver moving stories.</p>\n<p>To help our business stay on mission, we are looking for a senior full stack engineer to join us working on projects around the awareness, consideration and acquisition stages of the user journey.. Some examples are content discovery, content virality, end-to-end signup and payment experience, all SEO, email infrastructure, high traffic, top of the funnel part of the website etc. All of that with a laser focus on iterative increments of customer value.</p>\n<p><strong>Responsibilities:</strong></p>\n<ul>\n<li>\n<p>Make significant contributions to the business by working with a cross-functional team to provide expertise, ship high-quality work, and complex components.</p>\n</li>\n<li>\n<p>Work in an agile team and organization, continuously refine our own processes towards best team performance and most fun. Our Engineering Managers, Product Owners and Program Management Team are dedicated to supporting you with this.</p>\n</li>\n<li>\n<p>Work through a variety of technical challenges that will require creativity and close collaboration across internal functions (design, UX, sales, marketing, etc).</p>\n</li>\n<li>\n<p>Release early, release often, deploy to production from day one.</p>\n</li>\n<li>\n<p>Work with a toolchain across infrastructure, data, continuous integration, back end, front end and 3rd party integrations with new things to pick up on the way.</p>\n</li>\n<li>\n<p>Coordinate and own development projects from beginning to end. Plan, implement with your fellow engineers, release, measure, repeat.</p>\n</li>\n<li>\n<p>Contribute to building our dev tools and architecture to enable us to more quickly ship new features into production at scale. Dev teams dedicate 20% of their time to this, while we also rely on our Infrastructure Team to help with major, company-wide tooling and infrastructure support.</p>\n</li>\n<li>\n<p>Participate in hackathons and engineering days</p>\n</li>\n<li>\n<p>Learn from and share your knowledge with your team and colleagues on the go.</p>\n</li>\n</ul>\n<p><strong>Skills and traits we are looking for:</strong></p>\n<ul>\n<li>\n<p>A passion for delivering value to users</p>\n</li>\n<li>\n<p>Excellent communication skills, both verbal and written</p>\n</li>\n<li>\n<p>4+ years experience in developing web applications in production (e.g. backend using Django, Rails, Node frontend using Backbone, React, Bootstrap)</p>\n</li>\n<li>\n<p>A solid understanding of the full web technology stack (e.g. cloud infrastructure, HTTP, cookies, asset loading, caching, REST)</p>\n</li>\n<li>\n<p>Proficiency with servers, linux, cloud infrastructure, build systems, continuous integration</p>\n</li>\n<li>\n<p>A passion for clean, maintainable, well-tested code</p>\n</li>\n<li>\n<p>Experience working with applications at scale</p>\n</li>\n<li>\n<p>The ability to structure and build complex client side applications</p>\n</li>\n<li>\n<p>Knowledge of test automation of backend and frontend applications</p>\n</li>\n<li>\n<p>Extensive knowledge of responsive design, web standards and modern browsers</p>\n</li>\n<li>\n<p>Ability and willingness to learn fast and pick up new things easily</p>\n</li>\n</ul>\n<p><strong>Benefits:</strong></p>\n<ul>\n<li>\n<p>A work environment where people from all backgrounds can thrive and grow</p>\n</li>\n<li>\n<p>People who listen to your opinions and value them</p>\n</li>\n<li>\n<p>The opportunity to spend time working at our Budapest office</p>\n</li>\n<li>\n<p>The opportunity to go to tech conferences anywhere in the world</p>\n</li>\n<li>\n<p>Flexible working hours and untracked vacations</p>\n</li>\n<li>\n<p>Quality meals, snacks, drinks every day</p>\n</li>\n<li>\n<p>A fun office with community activities, outings, presentations, office bar, happy hours, ping-pong/pool/foosball, a bar and sports leagues.</p>\n</li>\n<li>\n<p>A centrally located office in downtown San Francisco</p>\n</li>\n<li>\n<p>401k plan</p>\n</li>\n<li>\n<p>Health, dental and vision insurance</p>\n</li>\n<li>\n<p>Commuter benefits</p>\n</li>\n</ul>\n",
    "how_to_apply": "<p><a href=\"https://grnh.se/d5687acb1\">https://grnh.se/d5687acb1</a></p>\n",
    "company_logo": null
  },
  {
    "id": "45296f64-ec32-11e8-9e1b-5d24b20f1c0f",
    "type": "Full Time",
    "url": "https://jobs.github.com/positions/45296f64-ec32-11e8-9e1b-5d24b20f1c0f",
    "created_at": "Mon Nov 19 19:40:01 UTC 2018",
    "company": "Prosek Partners",
    "company_url": "https://www.prosek.com",
    "location": "Fairfield, CT",
    "title": "Front End Developer",
    "description": "<p>Background</p>\n<p>Prosek Partners, one of the top 25 marketing communications and public relations companies in the U.S., is seeking a talented, versatile and motivated full-time Front End Developer to join our growing creative services team in Fairfield, Connecticut.</p>\n<p>The Front End Developer will take on a key role as we begin building our internal development team. The position will be responsible for developing and executing high-quality web productions for client related projects and occasional in-house programs. The ideal candidate would be at the center of the Prosek development team. They key area of focus will be building a best-in-class web-based UI/UX and requires extensive knowledge of web applications ecosystems. The Front End Developer will be part of a dynamic, evolving environment providing rapid delivery across multiple sectors for our varied clients, with a strong desire to lead change as we continue to build our agile transformational workflow. Along with these tasks, the professional we seek will also be a key participant in the creation of strategies and marketing campaigns for both our clients and internal stakeholders, and work on a variety of other projects collaborating with team members throughout our five offices in New York, Boston, Fairfield, Los Angeles and London.</p>\n<p>Technical skills:</p>\n<ul>\n<li>Design overall architecture of web applications, while maintaining quality, code integrity and organization to ensure responsiveness of applications</li>\n<li>Understanding of fundamental design principles behind scalable applications and participate in collaborative team efforts with responsive, user experience and user interface design</li>\n<li>Understanding differences between multiple delivery platforms (such as mobile vs, desktop), and optimizing output to function on specific platforms</li>\n<li>Delivering reusable components, code and front-end libraries for future use</li>\n<li>Translating designs and wireframes into high quality, tested code</li>\n<li>Experience with interactive web elements and motion</li>\n<li>Able to identify opportunities for process and tool improvements</li>\n<li>Proficient knowledge of front/back-end programming languages: HTML5, CSS3 and JavaScript are necessary, with in-depth understanding of DOM</li>\n<li>Understanding of CSS pre- and post-processors</li>\n<li>Experience working with third party services, APIs, and content management systems.</li>\n<li>Proficient in Adobe Creative Cloud including, but not limited to, Photoshop, Illustrator and InDesign</li>\n<li>Comprehensive awareness and interest in new technologies</li>\n<li>Understanding of full-stack requirements and deployments</li>\n<li>Enforce front-end code compliance with web for cross-browser and platform compatibility</li>\n</ul>\n<p>As a Front End Developer, you will be expected to:</p>\n<ul>\n<li>Be self-motivated, detail-oriented and confident</li>\n<li>Capable of analyzing challenges and create on-brand design solutions that meet measurable business goals and requirements</li>\n<li>Translate ideas, end-user needs, design criteria, and technical features into quality web productions</li>\n<li>Present and defend technical recommendations to the team</li>\n<li>Able to speak not just passionately about your work but also plainly to those who are inexperienced</li>\n<li>Have a strong grasp of storytelling through layout and information design</li>\n<li>Possess excellent written and verbal communication skills</li>\n<li>Be comfortable with getting and giving feedback; be flexible and willing to learn and passionate about mentoring and collaborating with other designers</li>\n<li>Able to work under tight deadlines, with little supervision</li>\n<li>Rise above the competition: tell us about your experience with mobile app development</li>\n</ul>\n<p>Requirements:</p>\n<ul>\n<li>Bachelor's degree in computer science or related field</li>\n<li>3-5 years of professional IT-related experience</li>\n<li>Demonstrate a strong set of visual, written and oral communication skills, a meticulous eye for detail, and the ability to create work inspired by ideas and not trends</li>\n<li>Fluency in Adobe Creative Cloud is a must, with bonus points going to those who can function across Windows and OS X.</li>\n</ul>\n",
    "how_to_apply": "<p>Email your resume to <a href=\"mailto:developerjobs@prosek.com\">developerjobs@prosek.com</a></p>\n",
    "company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBaUZYIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--46d1fc63cd3c42af58e8eb57769e49386c3a54c6/56db6e1a-a723-4256-b184-6fc3e13db90a"
  },
  {
    "id": "319d7e3a-b768-11e8-965f-a3a06c674d8e",
    "type": "Full Time",
    "url": "https://jobs.github.com/positions/319d7e3a-b768-11e8-965f-a3a06c674d8e",
    "created_at": "Mon Nov 19 17:12:14 UTC 2018",
    "company": "MojoTech",
    "company_url": "http://MojoTech.com",
    "location": "Boulder, CO",
    "title": "Software Architect",
    "description": "<p>Whether Back-End, Front-End, Full-Stack, Dev-Ops, or Mobile, a big part of what makes being a member of the engineering team at MojoTech so rewarding is the challenge. The job starts hard, and will only get harder. If you believe in constant improvement, and want to join a team that helps one another achieve that goal, please continue reading.</p>\n<p>Software Architects at MojoTech have the ability and autonomy to solve complex problems and deliver quality solutions as part of a team. With confidence in their own decisions and the quality of their work, they remain open to discussing better ways to solve problems and deliver features. They are comfortable communicating and collaborating with designers, product managers, and clients.</p>\n<p>The people we’re looking for should be able to check off all this:</p>\n<ul>\n<li>Experience building complex applications</li>\n<li>A desire for constant improvement</li>\n<li>A passion for software engineering and application infrastructure</li>\n<li>Understanding of version control (Git) and code documentation</li>\n</ul>\n<p>And they should also be able to check off some of this:</p>\n<ul>\n<li>Understand the principles of cloud native architecture</li>\n<li>Containerization and Orchestration tools and platforms (Kubernetes, CloudFoundry, etc.)</li>\n<li>Developing and deployment of microservice based solutions</li>\n<li>Proficiency in API design</li>\n<li>Experience leading and teaching teams on best practices</li>\n<li>Proficiency testing distributed systems</li>\n<li>Experience tailoring solutions to match client requirements and capability</li>\n<li>Ability to communicate the value of architectural approaches to both technical and business client stakeholders</li>\n<li>Conversant with security best practices</li>\n<li>Understanding of Continuous Delivery and Continuous Integration best practices for application design and delivery.</li>\n<li>Exposure to leadership roles, particularly on a development team</li>\n<li>Experience working in an agency or as a software consultant</li>\n<li>Contributed to open source projects or presented at a conference</li>\n<li>Experience training or teaching (software or otherwise)</li>\n<li>Degree in Computer Science, Software Engineering, or a related field</li>\n<li>Created an app/tool/technology that is used by others to solve a problem</li>\n</ul>\n<p>Relocation assistance may be offered to exceptional candidates.</p>\n<p>Working at MojoTech</p>\n<p>MojoTech is a growing team of ambitious, authentic, smart, pragmatic people. Our mission is to practice engineering excellence, to foster an enjoyable environment that allows everyone to reach their potential, to work in a sustainable way, and to help our clients succeed.</p>\n<p>We design and engineer distributed systems and mobile applications for big, and soon-to-big companies – helping enterprises move faster, and startups build smarter.</p>\n<p>Learn more about our culture and comprehensive benefits here:\n<a href=\"https://www.mojotech.com/jobs\">https://www.mojotech.com/jobs</a></p>\n<p>Learn more about our engineering approach and philosophy here: <a href=\"https://www.mojotech.com/engineering\">https://www.mojotech.com/engineering</a></p>\n<p>MojoTech is an Equal Employment Opportunity employer that will consider all qualified applicants, regardless of race, color, religion, gender, sexual orientation, marital status, gender identity or expression, national origin, genetics, age, disability status, protected veteran status, or any other characteristic protected by applicable law.</p>\n",
    "how_to_apply": "<p>Apply on our website:\n<a href=\"https://mojotech.bamboohr.com/jobs/view.php?id=13&amp;source=github\">https://mojotech.bamboohr.com/jobs/view.php?id=13&amp;source=github</a></p>\n",
    "company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBc3BXIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--773754c025fa40ac1371ca3b20387a555265d8f5/12263136-b5bb-4781-8227-7535cd6aa7f5"
  },
  {
    "id": "cd535970-ec11-11e8-89ae-2e904411ec0e",
    "type": "Full Time",
    "url": "https://jobs.github.com/positions/cd535970-ec11-11e8-89ae-2e904411ec0e",
    "created_at": "Mon Nov 19 15:44:44 UTC 2018",
    "company": "Aon Cyber Solutions",
    "company_url": "http://www.strozfriedberg.com/careers",
    "location": "NY or LA",
    "title": "Cybersecurity Firm Seeks Senior Developer",
    "description": "<p>Aon Cyber Solutions is looking for a Senior Developer in NY or LA. As part of an industry-leading team, you will help empower results for our clients by delivering innovative and effective solutions supporting Risk.</p>\n<p>APPLY HERE: <a href=\"https://us-strozfriedberg-aon.icims.com/jobs/24315/senior-developer/job\">https://us-strozfriedberg-aon.icims.com/jobs/24315/senior-developer/job</a></p>\n<p>Position Overview\nJoin our expert software development team to create new customer-facing web applications. You will apply your expertise in web development and user interface design, working in concert with subject matter experts in digital forensics, incident response, cybersecurity, and threat intelligence. Your applications will convey deeply technical facts and analyses to a variety of consumers, from risk managers to subject matter experts to C-level executives.</p>\n<p>The responsibilities of this position include but are not limited to the following:</p>\n<ul>\n<li>Design and develop pioneering web applications that cross the boundaries of security assessment, digital forensics, incident response, malware analysis, cybersecurity, and cyberinsurance.</li>\n<li>Serve as a senior developer on multiple product teams.</li>\n<li>Create user interfaces, APIs, data visualizations, and reports that provide our clients with insight into complex narratives and data sets.</li>\n<li>Translate high-level requirements into working prototypes to generate user feedback and discussion.</li>\n<li>Adapt and apply cutting edge computer science to highly technical domains.</li>\n<li>Participate in code reviews, write test suites, profile components, and take ownership of our software, source code, tools, and processes.</li>\n<li>Mentor other developers.</li>\n<li>Contribute to a positive, collaborative culture for innovation.</li>\n</ul>\n<p>Requirements</p>\n<ul>\n<li>5+ years of software engineer experience.</li>\n<li>Proficiency in frontend technologies (React, Node.js, Webpack).     Experience working with relational and NoSQL databases.</li>\n<li>Strong knowledge of HTTP and REST web services implementation.</li>\n<li>Test driven development and unit testing frameworks.</li>\n<li>Modern DevOps experience.</li>\n<li>Standard software engineering tools (git, Jenkins, JIRA).</li>\n<li>The proven ability to see things as they should be, and to realize that vision.</li>\n<li>Comfort with agile development and remote team environments.</li>\n<li>Excellence in verbal and written communication.</li>\n</ul>\n<p>Desired Skills</p>\n<ul>\n<li>TypeScript</li>\n<li>Python 3 and web frameworks such as Django or Flask.</li>\n<li>SQL &amp; relational database modeling.</li>\n<li>Experience in deployment to AWS, especially serverless technologies.</li>\n<li>Strong knowledge of JWT and various web security models.</li>\n<li>D3.js, Vega, Bokeh, Leaflet, and other browser visualization libraries.   Experiment-driven design and iterative features-based development (A/B testing, etc.).</li>\n<li>ElasticSearch, Apache Kafka, AWS Kinesis, PostgreSQL, AWS Aurora.</li>\n<li>Java 8 and other JVM-based languages.</li>\n<li>Performance monitoring and optimization.</li>\n<li>Mobile development using Native or Cross-platform (Xamarin, Ionic, React Native).</li>\n</ul>\n<p>Education Required</p>\n<ul>\n<li>BS or BA in Computer Science, Mathematics, or Statistics, or equivalent experience.</li>\n</ul>\n",
    "how_to_apply": "<p>APPLY HERE: <a href=\"https://us-strozfriedberg-aon.icims.com/jobs/24315/senior-developer/job\">https://us-strozfriedberg-aon.icims.com/jobs/24315/senior-developer/job</a></p>\n",
    "company_logo": null
  },
  {
    "id": "312b993e-ec09-11e8-9f79-994c27d575a7",
    "type": "Full Time",
    "url": "https://jobs.github.com/positions/312b993e-ec09-11e8-9f79-994c27d575a7",
    "created_at": "Mon Nov 19 14:42:19 UTC 2018",
    "company": "Signify",
    "company_url": null,
    "location": "Eindhoven",
    "title": "Mobile Application Tester",
    "description": "<p><strong>We are…</strong>\nSignify, the new company name of Philips Lighting, is the undisputed leader in the lighting industry. Our purpose is to unlock the extraordinary potential of light for brighter lives and a better world.</p>\n<p>You will join the leader in the lighting industry and learn through disruptive challenges. You will be part of a global team, where performance is powered through diversity. Help us shape the future of light in the Internet of Things and work with us on our commitment to achieve a more sustainable future.</p>\n<p>Join us and #findyourmeaning at Signify.</p>\n<p>Since its launch in 2012, Philips Hue is changing the way people interact and experience lighting.</p>\n<p>We have become the world’s leading connected home lighting system that works with all major smarthome platforms (Amazon Alexa, Apple HomeKit, Google, Nest, Smartthings). Philips Hue has encouraged other companies to develop devices, apps and systems that inter-operate with our system.\nThrough a vibrant developer program there are more than 600 third-party apps for Philips Hue. The Hue ecosystem is growing rapidly through both new lights, luminaires, sensors, and switches as well as exciting partnerships like Google and Apple. New features are added through agile development processes.</p>\n<p>As a Mobile App tester in the Hue mobile Application Team, you will be challenged to release the Hue Mobile Apps on time with highest quality, further contributing to the success of one of the most successful internet connected propositions in the market. Being member of an agile team, you will seek for continuous improvement and accelerate the development of the product whilst focusing on operational excellence by using or implementing new tools and processes.</p>\n<p>You will be based at the High-Tech Campus Eindhoven, the smartest square km in Europe, joining a team of passionate software craftsmen working on the world’s leading connected lighting system. Surrounded by usability experts, product owners, software architects and test engineers, you’ll take up the challenge to build high quality and exciting innovations providing the best lighting experience for our customers.</p>\n<p><strong>Together we can…</strong></p>\n<ul>\n<li>Develop test scenarios for new features based on user story requirements Support developers with implementation of test scenarios into the test automation framework Support test architect with introduction of test strategies for new features</li>\n<li>Maintain and improve test scenarios for existing features</li>\n<li>Support the development of new features by verifying the user stories in an exploratory way</li>\n<li>Execute manually test scenarios</li>\n<li>Create problem reports and change requests</li>\n<li>Support developers with root cause analyses of bugs</li>\n<li>Verify and validate problem reports, team up with developers</li>\n<li>Validate and release sprint deliverables towards system test group and beta testing</li>\n<li>Report status to product owner and test architect</li>\n<li>Review deliverables of requirements and test cases of peers</li>\n<li>Adhere with processes (including tools, build process) and contribution in process improvements in both own and related project teams</li>\n<li>collaborate with all roles in the development team</li>\n<li>Follow up technical developments in own field and share proactively with others in the team</li>\n</ul>\n<p><strong>You are…</strong>\nA software test engineer developer with good communication skills and quality mindset that is continuously seeking to improve together with the team, the product and daily processes and has passion for Mobile Application Development engineering and innovations in that area. Next to that, you have:</p>\n<ul>\n<li>At least three years’ experience in testing mobile apps</li>\n<li>Good analytical skills with attention for detail</li>\n<li>Able to understand complex technical systems</li>\n<li>Familiar with testing methodologies in agile environment including exploratory testing.</li>\n<li>Experience with writing detailed test scenarios based on available specifications</li>\n<li>Owner of an ISTQB or TMAP certificate or having similar level of test knowledge by experience</li>\n<li>Knowledge of platform specific IDE’s (Apple Xcode, Android Studio) is a plus</li>\n<li>Knowledge of platform specific UI test automation frameworks (Espresso, EarlGrey) is a plus</li>\n<li>Basic knowledge of platform specific languages (Swift, Kotlin) is a plus</li>\n<li>Knowledge of behavior driven testing based on Gherkin terminology is a plus</li>\n<li>Experience in an IoT or systems environment is a plus</li>\n</ul>\n<p><strong>Our offer…</strong>\nWhen joining Signify, you will be part of a global leader with a start-up spirit. We welcome you to a challenging, innovative environment with great opportunities for you to explore. Our benefits are very competitive and designed around your preferences:</p>\n<ul>\n<li>Extensive set of tools to drive your career including personal development budget and coaching</li>\n<li>Healthy work-life balance</li>\n<li>25 Days of leave and the possibility to purchase up to 20 extra days off annually</li>\n<li>A bonus based on both Signify results and personal performance</li>\n<li>Solid company pension scheme and attractive collective health insurance package</li>\n<li>Opportunity to buy Signify shares and products with discount</li>\n</ul>\n<p><strong>Interested?</strong>\nPlease apply online via this link: <a href=\"https://philips.redirect.your-jobresponse.com/m/236879/V819/apply\">Click here to apply!</a></p>\n<p>Agency calls not appreciated</p>\n",
    "how_to_apply": "<p><a href=\"https://philips.redirect.your-jobresponse.com/m/236879/V819/apply\">Click here to apply!</a></p>\n",
    "company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBaDVYIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--d2bbd3e2e0303af4f19e5d133e2701e4ebffa6cb/ceee070f-98a0-4980-aed6-ed76ddacc987"
  },
  {
    "id": "748e1a92-ec06-11e8-8005-27e34614d13f",
    "type": "Full Time",
    "url": "https://jobs.github.com/positions/748e1a92-ec06-11e8-8005-27e34614d13f",
    "created_at": "Mon Nov 19 14:38:03 UTC 2018",
    "company": "Signify",
    "company_url": "http://www.philips.com",
    "location": "Eindhoven",
    "title": "Mobile Software Engineer (C++) - Philips HUE",
    "description": "<h2><strong>We are…</strong></h2>\n<p>Signify, the new company name of Philips Lighting, is the undisputed leader in the lighting industry. Our purpose is to unlock the extraordinary potential of light for brighter lives and a better world.</p>\n<p>You will join the leader in the lighting industry and learn through disruptive challenges. You will be part of a global team, where performance is powered through diversity. Help us shape the future of light in the Internet of Things and work with us on our commitment to achieve a more sustainable future.</p>\n<p>Join us and #findyourmeaning at Signify.</p>\n<p>Since its launch in 2012, Philips Hue is changing the way people interact and experience lighting.</p>\n<p>We have become the world’s leading connected home lighting system that works with all major smarthome platforms (Amazon Alexa, Apple HomeKit, Google, Nest, Smartthings). Philips Hue has encouraged other companies to develop devices, apps and systems that inter-operate with our system.</p>\n<p>Through a vibrant developer program there are more than 600 third-party apps for Philips Hue. The Hue ecosystem is growing rapidly through both new lights, luminaires, sensors, and switches as well as exciting partnerships like Google and Apple. New features are added through agile development processes.</p>\n<p>You will be based at the High-Tech Campus Eindhoven, the smartest square km in Europe, joining a team of passionate software craftsmen working on the world’s leading connected lighting system. Surrounded by usability experts, product owners, software architects and test engineers, you’ll take up the challenge to build high quality and exciting innovations providing the best lighting experience for our customers.</p>\n<h2><strong>Together we can…</strong></h2>\n<p>As a Mobile Software Engineer in the Hue Mobile App Team, you will ensure to deliver on time high-quality deliverables for the Hue SDK or parts of the hue Application. Being member of an agile team, you will seek for continuous improvement and accelerate the development of the product whilst focusing on operational excellence by using or implementing new tools and processes.</p>\n<h2>Next to that, you:</h2>\n<ul>\n<li>Develop new features and partial design for the Hue SDK from end to end through implementation, testing, launch, and further iteration in an agile environment</li>\n<li>Provide input for effort estimations, maintaining personal schedule and reporting on progress using agile scrum practices</li>\n<li>Effective contribution in reviewing deliverables of software components of peers</li>\n<li>Adherence with processes (including tools, build process) and contribution in process improvements in both own team and related teams</li>\n<li>Effective collaboration with all roles in the development team</li>\n<li>Keep abreast of technical developments in own field and proactive knowledge sharing with others</li>\n<li>Working alongside an excellent, cross-functional team, build technical solutions that enable continuous delivery and provide exciting new functionality with the highest quality</li>\n</ul>\n<h2><strong>You are…</strong></h2>\n<p>A highly driven developer with a passion for C++ development in a Mobile Application environment, who:</p>\n<ul>\n<li>Has at least three years of experience and excellent coding skills in C++11</li>\n<li>Has demonstrable object oriented design skills and knowledge of design patterns.</li>\n<li>Has experience with multi-threaded programming</li>\n<li>Has deep knowledge of IDE development tools (XCode, Android Studio, CLion) and CI/CD; static and dynamic analysis tools is a plus</li>\n<li>Experience with TDD (test patterns, dependency injection, test doubles).</li>\n</ul>\n<h2><strong>Our offer…</strong></h2>\n<p>When joining Signify, you will be part of a global leader with a start-up spirit. We welcome you to a challenging, innovative environment with great opportunities for you to explore. Our benefits are very competitive and designed around your preferences:</p>\n<ul>\n<li>Extensive set of tools to drive your career including personal development budget and coaching</li>\n<li>Healthy work-life balance</li>\n<li>25 Days of leave and the possibility to purchase up to 20 extra days off annually</li>\n<li>A bonus based on both Signify results and personal performance</li>\n<li>Solid company pension scheme and attractive collective health insurance package</li>\n<li>Opportunity to buy Signify shares and products with discount</li>\n</ul>\n<h2>Interested?</h2>\n<p>Please apply via this link: <a href=\"https://philips.redirect.your-jobresponse.com/mobile_software_engineer_c_philips_hue_eindhoven/236867/V819/apply\">Click here to apply!</a></p>\n",
    "how_to_apply": "<p><a href=\"https://philips.redirect.your-jobresponse.com/mobile_software_engineer_c_philips_hue_eindhoven/236867/V819/apply\">Click here to apply!</a></p>\n",
    "company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBaHRYIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--0306d5657b88d4eb5c7e2a9ef5903da5ddf4677b/c58b8833-ef89-4e03-8901-0f05949a66ea"
  },
  {
    "id": "b638fa4c-ebb7-11e8-9ea5-6578f16a7b3f",
    "type": "Contract",
    "url": "https://jobs.github.com/positions/b638fa4c-ebb7-11e8-9ea5-6578f16a7b3f",
    "created_at": "Mon Nov 19 04:59:26 UTC 2018",
    "company": "Podomaatic",
    "company_url": null,
    "location": "Remote",
    "title": "RFP: JavaScript component for embedding a list of Podcast Episodes  in Website Builders with specific functionality for Wordpress ",
    "description": "<p>RFP: JavaScript component for embedding a list of Podcast Episodes\nin Website Builders with specific functionality for Wordpress</p>\n<p>The goal of this project is to repurpose our JavaScript components currently available\nfor Weebly, to allow users on the Wordpress platform to embed their podcast episodes\nand information on their own custom webpages.</p>\n<p>Recent episode player:\nThis will always display the latest episode published by a user. It includes playback,\ntimeline bar, description, title and mute buttons.</p>\n<p>Podcast Info:\nBasic information about the user’s podcast including Category, Genre, Location,\nFollowers.</p>\n<p>Episode Grid:\nThis plugin allows the user to display the entire list of episodes in a grid format.\nPlayback functionality is similar to the Recent episode player. There are some basic\ncustomizable options such as transparency vs white bar background for episode titles\n(See mockups below)</p>\n<p>Episode List\nThis plugin allows the user to display the entire list of episodes in a List format.\nPlayback functionality is similar to the Recent episode player. There are some basic\ncustomizable options such as displaying the episode thumbnail image or not. (See\nmockups below)</p>\n<p>All components must adapt their font style (Title, body, caption) and color to the\nwebpage theme the user has. All components must offer a color player and a gray\nplayer version, background opacity color, and must be responsive to mobile and\ndesktop)</p>\n<p>Examples of the current plugins in Weebly:\n<a href=\"http://www.minimalist-theme.podomatic.net/\">http://www.minimalist-theme.podomatic.net/</a>\n<a href=\"http://www.performer-theme.podomatic.net/\">http://www.performer-theme.podomatic.net/</a>\n<a href=\"http://www.writer-theme.podomatic.net/\">http://www.writer-theme.podomatic.net/</a>\n<a href=\"http://www.complete-theme.podomatic.net/\">http://www.complete-theme.podomatic.net/</a></p>\n<p>Requirements for the embeddable component:</p>\n<p>The component should be pure JavaScript, i.e. not an embeddable iframe, and</p>\n<p>be enabled either via data attributes or a JavaScript call. i..e the html might look</p>\n<p>something like:</p>\n\n<p>The component should make use of Podomatic’s API which uses JSON over REST. A\nsample response looks like this:\n<a href=\"https://api.podomatic.com/v2/podcasts/5133407/episodes?podcast=true\">https://api.podomatic.com/v2/podcasts/5133407/episodes?podcast=true</a></p>\n<p>The following attributes should be customizable:</p>\n<p>● The style (grid or list)</p>\n<p>● Number of items per page</p>\n<p>●\nThe color scheme (currently light or dark)\n●\nWhether background images are displayed or not</p>\n<p>The component will be styled mostly by the choice of style and color scheme\nhowever it should be possible to override the styles from a global style sheet.\nAdditionally the layout should be responsive.</p>\n<p>The component should load new pages using an infinite scrolling mechanism.</p>\n<p>Requirements for the Wordpress plugin integration:</p>\n<p>As part of our strategy we also want the above component to be made available\nas a Wordpress plugin. To keep the look and feel of the application consistent\nthis should use the JavaScript file created above. It should also provide the\nsame level of customizability.</p>\n<p>Additional notes</p>\n<p>All resulting code and assets will belong to Podomatic. The embeddable code\nwill be hosted on our own CDN and the Wordpress Plugin on their infrastructure.</p>\n<p>Please provide specific instructions on how you would go about building and what in your experience would be useful or relevant to the project.  Also include either a resume or gitbub. Thank you,</p>\n",
    "how_to_apply": "<p>Email porject cost and contact information to <a href=\"mailto:jobs@podomatic.com\">jobs@podomatic.com</a></p>\n",
    "company_logo": null
  },
  {
    "id": "b0248344-89e5-11e8-87e5-7d6aa5fe3ed0",
    "type": "Full Time",
    "url": "https://jobs.github.com/positions/b0248344-89e5-11e8-87e5-7d6aa5fe3ed0",
    "created_at": "Fri Nov 16 16:34:22 UTC 2018",
    "company": "SunteckTTS",
    "company_url": null,
    "location": "Jacksonville, FL (Or Remote)",
    "title": "Sr PHP Developer (Full-stack)",
    "description": "<p>Requirements:</p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>Nice to Haves:</p>\n\n\n\n\n\n\n\n\n<p>About the Role: </p>\n<p>You will be responsible for contributing to the technical design, development, and implementation of the SunteckTTS application ecosystem. The role involves more than just writing production code; in a typical week, you could be: brainstorming technical architecture options, providing feedback to improve our development processes, reviewing PRs from other team members, fixing a bug you randomly came across, or improving unit test coverage.</p>\n<p>We’re looking for an outstanding Senior Developer with a desire to participate in a growing team with the skills, experience, and understanding to join a small, but strong development team. In order to meet the many challenges and high volume work of the SunteckTTS users, it is important for the Senior Developer to have excellent communication.</p>\n<p>About SunteckTTS and the Team:</p>\n<p>SunteckTTS is an industry-leading, full-service, transportation logistics provider that operates through a network of sales, operations, and capacity specialists. We are a billion dollar company with over 200 independently owned and operated agent offices across the U.S. and Canada.\nWe focus on providing asset and non-asset surface transportation to a wide range of end-use markets, including food, lumber, paper, printing, textiles, electronics, machinery, government, and more. The Application Development Group is in the midst of an ambitious program to create best in breed software products and improve existing systems for our user base. Our team of Business Analysts and Developers share a culture of self-ownership and open communication to provide\nmaximum business value. We strive to ensure team-based component ownership, development, and quality assurance. We are a tight knit group that relies on ability and flexibility to ensure we balance our strides towards improved process and need to meet the priorities of a heavily used\nenterprise system. The Application Development Group focuses on a culture of open communication, learning, and transparency.</p>\n<p>SunteckTTS is an Equal Opportunity Employer and does not discriminate against qualified applicants with regard to race, color, religion, age, sex, national origin, handicap, sexual orientation or veteran status.</p>\n",
    "how_to_apply": "<p>Email your resume to:\n<a href=\"mailto:anthony.vargas@suntecktts.com\">anthony.vargas@suntecktts.com</a></p>\n",
    "company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBZzlYIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--0538ec284289af7dbfceb09ccf27499bfa17aed3/823b3a50-63ca-4309-85b4-9ab437ebd949"
  },
  {
    "id": "deaa4312-e9b1-11e8-9902-330976f7a8e1",
    "type": "Full Time",
    "url": "https://jobs.github.com/positions/deaa4312-e9b1-11e8-9902-330976f7a8e1",
    "created_at": "Fri Nov 16 15:18:43 UTC 2018",
    "company": "doubleSlash Net-Business GmbH",
    "company_url": "http://www.doubleslash.de",
    "location": "München",
    "title": "Software Developer - Microsoft Azure (m/w)",
    "description": "<p>// KOLLEGEN GESUCHT \n<strong>Software Developer - Microsoft Azure (m/w)</strong> \n// in München \n// ab sofort </p>\n<p>doubleSlash steht seit 1999 für innovative Softwarelösungen und Best Practices zur Digitalisierung von Geschäftsprozessen in Vertrieb, Marketing und Service. Mit einfach nutzbaren, smarten Technologien vernetzen wir Menschen und Maschinen und ermöglichen so neue Geschäftsmodelle.</p>\n<p>Werde Teil unseres neuen Teams am etablierten Standort München und nutze die damit verbundenen Gestaltungsmöglichkeiten. Gemeinsam mit deinen Teamkollegen setzt du innovative Projekte im Bereich Internet der Dinge (loT), Connected Services und Predictive Maintenance um. Deine Begeisterung für loT kannst du dabei nicht nur mit deinen Teamkollegen teilen, sondern auch unser gut ausgebautes Firmennetzwerk zum Know-how-Transfer nutzen.</p>\n<p><strong>Deine Tätigkeiten</strong></p>\n<ul>\n<li>Mitarbeit und technische Teilprojektleitung in agilen loT-Software-Projekten</li>\n<li>Entwicklung von cloud- und webbasierten Kundenanwendungen entlang der kompletten Lieferkette (Anforderungsanalyse, Konzeption, Umsetzung und Betrieb)</li>\n<li>Weiterentwicklung und Optimierung von Software-Architekturen</li>\n<li>Umsetzung von qualitätssichernden Maßnahmen</li>\n<li>Einsatz von modernen Technologien, Methoden und Prozessen: Clean Code, VSTS, .NET, Microsoft Azure, Serum</li>\n</ul>\n<p><strong>Dein Profil</strong></p>\n<ul>\n<li>Erfolgreich absolviertes Studium im Bereich Informatik oder eine vergleichbare Ausbildung</li>\n<li>Praxiserfahrung in Serum Projekten und im genannten Technologieumfeld</li>\n<li>Begeisterung für Cloud und loT</li>\n<li>Zuverlässiger Teamplayer mit hohem Qualitätsverständnis und selbständiger Arbeitsweise</li>\n</ul>\n<p><strong>Das bieten wir Dir</strong></p>\n<ul>\n<li>Gute Work-Life-Balance</li>\n<li>Flexible Arbeitszeiten</li>\n<li>Drei attraktive Standorte\n</li>\n<li>Teamspirit</li>\n<li>Team-/Firmenevents</li>\n<li>Sportevents\n</li>\n<li>Attraktive Benefits, wie z.B. Essenszulagen, JobRad, ...</li>\n<li>Betriebliche Krankenzusatzversicherung\n</li>\n<li>Talentförderung</li>\n<li>Vielfältige Weiterbildungsmöglichkeiten</li>\n<li>Betriebliches Innovationsmanagement</li>\n</ul>\n<p>Wir freuen uns auf Deine Bewerbung über diesen Link <a href=\"https://doubleslash.redirect.your-jobresponse.com/software_developer_microsoft_azure_m_w_muenchen/236641/V819/anwenden\">Klick hier um zum Bewerbungsformular zu gelangen!</a> oder an: <a href=\"mailto:karriere@doubleSlash.de\">karriere@doubleSlash.de</a></p>\n<p>Leonie Hlawatsch \nHuman Resources Manager \n+49 7541 70078-728 </p>\n<p>Mehr Jobs und Infos auf: doubleSlash.de</p>\n",
    "how_to_apply": "<p><a href=\"https://doubleslash.redirect.your-jobresponse.com/software_developer_microsoft_azure_m_w_muenchen/236641/V819/anwenden\">Klick hier um zum Bewerbungsformular zu gelangen!</a></p>\n",
    "company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBZ3hYIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--1d4aa0fef5069ce7fb04b332f2f5afbd98be5866/8b34a919-5ab9-45b9-99ff-69d3a82ec0d7"
  },
  {
    "id": "2744c836-e97b-11e8-8236-5be6ba23f176",
    "type": "Full Time",
    "url": "https://jobs.github.com/positions/2744c836-e97b-11e8-8236-5be6ba23f176",
    "created_at": "Fri Nov 16 08:41:52 UTC 2018",
    "company": "Piktochart Sdn Bhd",
    "company_url": null,
    "location": "Europe",
    "title": "DevOps (Remote - Europe)",
    "description": "<p>Dear server/database admin, you’ve arrived at the opening where challenge meets excitement. Piktochart is a growing startup and we work to serve our users so that they can create infographics on a daily basis with ease. If you have a strong passion for scaling web apps and application security, we need your help on our server operations!</p>\n<p>Your mission:</p>\n<p>Design scalable and secure web infrastructure on GCP &amp; AWS clouds\nMonitor system and network health\nDeploy containerized applications on Kubernetes\nAnalyze software performance and perform system/code optimization\nDesign and scale database systems\nAutomate server management using tools like Ansible or Saltstack\nParticipate in service capacity planning and demand forecasting</p>\n<p>You offer :</p>\n<p>3+ years experience with distributed Unix/Linux environments, preferably Ubuntu or Debian\nFamiliarity with Amazon and Google clouds\nExperience with Docker and container orchestration platforms\nExperience with scaling MySQL, PostgreSQL, Redis and Memcached clusters\nFamiliar with Ruby on Rails web framework\nStrong knowledge of web application security\nBash and Python scripting\nKnowledge of Nginx, HAProxy\nKnowledge of Ansible / Chef / Puppet\nKnowledge of Elasticsearch stack</p>\n<p>Extra points if you have:</p>\n<p>Experience with CI services, CircleCI / Jenkins\nExperience with Golang, Nodejs\nExperience with Agile practices (Scrum, Kanban)\nKnowledge of Nagios / Statd / Graphite\nHigh self-learning ability to adapt to emergency circumstances\nAbility to manage multiple issues at once and keep your team updated on what's going on\nKnowledge in backup/restore operations</p>\n<p>Location :</p>\n<p>Remote (Already based in Europe or willing to work in EU timezone)</p>\n",
    "how_to_apply": "<p>Apply here : <a href=\"https://grnh.se/e0769a2c1\">https://grnh.se/e0769a2c1</a></p>\n",
    "company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBdjFXIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--a77c2ed67ba70e15837e957c69e76a6c6af641ac/aa062216-a41a-4c15-a18d-c5082cace137"
  },
  {
    "id": "02ff2dda-e8e6-11e8-9142-4af8e5c3597d",
    "type": "Full Time",
    "url": "https://jobs.github.com/positions/02ff2dda-e8e6-11e8-9142-4af8e5c3597d",
    "created_at": "Thu Nov 15 14:52:36 UTC 2018",
    "company": "Revive Interior",
    "company_url": null,
    "location": "Cologne - Germany",
    "title": "Junior Full-Stack Developer (full-time)",
    "description": "<p><strong>Junior Full-Stack Developer (full-time)</strong></p>\n<p>Revive Interior GmbH is an innovative e-commerce company that specializes in reupholstering and selling exclusive used designer furniture. Every step of the process is done inhouse, from buying, reupholstering and photographing up to white-glove fulfillment directly to our customers living-rooms. Our vision is to establish Revive Interior as a globally recognized brand for used furniture and to provide the best alternative for buying new furniture. We strongly believe that small things can have a big impact.\nThis is why we give 10% of our annual profits to charity.</p>\n<p><strong>about the job</strong>\nYou love solving real-world problems in an innovative and long-term way?\nYou accelerate in an almost non-hierarchical, specialized team?\nYou have experience in building scalable software solutions, not forgetting about performance and security?\nYou love to learn new things and like to challenge the status quo?</p>\n<p>Then we want you to join us on our mission!</p>\n<p><strong>your responsibilities</strong></p>\n<ul>\n<li>transform business needs well into code</li>\n<li>working with e-commerce platforms such as WooCommerce &amp; Magento in addition to connecting to other market and distribution places</li>\n<li>working with git will be your daily routine</li>\n</ul>\n<p><strong>your skill</strong></p>\n<ul>\n<li>good understanding of SQL and Relational Databases</li>\n<li>you are experienced in PHP, favorably Laravel</li>\n<li>working with HTML, CSS and JavaScript is your bread and butter</li>\n<li>you understand the basics of TDD</li>\n<li>experience with Linux, Docker, nginx &amp; Vue.js is a bonus</li>\n<li>you are able to communicate well and fast with your team</li>\n</ul>\n<p><strong>we offer</strong></p>\n<ul>\n<li>a small and specialized team in a scaling company with a start-up vibe</li>\n<li>the ability to make your mark in our IT-infrastructure</li>\n<li>daily free lunch cooked by our own chef Erika</li>\n<li>50% discounted JobTicket for public transportation</li>\n</ul>\n<p>Sounds exciting? Don’t hesitate to apply at: <a href=\"mailto:job@reviveinterior.de\">job@reviveinterior.de</a></p>\n<p>We are looking forward to get to know you.</p>\n<p><strong>Contact</strong></p>\n<p>Jessica Aleo</p>\n<p><em>Assistentant of the CEO</em></p>\n<p>Revive Interior GmbH\nOttostraße 3\n50859 Köln-Lövenich</p>\n<p><a href=\"http://www.revive.de\">www.revive.de</a></p>\n",
    "how_to_apply": "<p><a href=\"mailto:job@reviveinterior.de\">job@reviveinterior.de</a></p>\n",
    "company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBdVJXIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--682b0317ba542ddf03e88632bf86952f0c13bae3/b4e21986-5319-4fd4-850e-79b1b5845db2"
  },
  {
    "id": "728d85b4-e8d9-11e8-95cd-f13299063e9d",
    "type": "Full Time",
    "url": "https://jobs.github.com/positions/728d85b4-e8d9-11e8-95cd-f13299063e9d",
    "created_at": "Thu Nov 15 13:22:21 UTC 2018",
    "company": "Stylight GmbH",
    "company_url": "https://www.stylight.com/",
    "location": "Munich, Germany",
    "title": "Software Engineer (m/f)",
    "description": "<p>For our office in Munich, we are looking for a Software Engineer to join our team. If you like thinking outside the box and collaborating with teammates to develop solutions to complex problems— this is the place for you!</p>\n<p>Your Team</p>\n<ul>\n<li>Works in an Agile environment to create internal tools in diverse areas such as performance marketing, SEO, and editorial content marketing.</li>\n<li>Codes primarily in Python (mostly for backend applications) and is committed to the quality and health of their codebase.</li>\n<li>Values the learning and growth mindset and has dedicated time for self-driven, personal development.</li>\n<li>Has low management overhead and a high level of trust in one another; enjoys autonomous work as well as pair programming.</li>\n</ul>\n<p>Your Responsibilities</p>\n<ul>\n<li>Consider complex logical problems and develop pragmatic solutions with regard to relative effort and business value.</li>\n<li>Continue to breakup a monolithic app into microservices while creating APIs used by other teams in Stylight’s value chain.</li>\n<li>Own service stacks from design, development, &amp; testing to continuous integration, monitoring, &amp; user support.</li>\n<li>Explain technical concepts to non-technical colleagues.</li>\n</ul>\n<p>Your Profile</p>\n<ul>\n<li>We hope you love Python and have experience with it too!  If not, we expect you to have a strong desire to learn and significant experience in another programming language.</li>\n<li>You have a background in computer science either from a bachelor's degree program and/or work experience.</li>\n<li>You have proficient English skills and are able to communicate honestly and openly with your colleagues.</li>\n<li>You are a motivated, compassionate individual who enjoys collaboration and is eager to learn from and teach others.</li>\n<li>SQL experience is a nice plus.</li>\n</ul>\n<p>Why join Stylight?</p>\n<ul>\n<li>We have an international, fun, and inclusive culture!  Our team represents over 20 nationalities.</li>\n<li>We are family-friendly and enjoy spending time with one another outside of working hours from board game evenings and BBQs to ping pong tournaments and Christmas tree decorating.</li>\n<li>Stylight is #1 Meetup organizer in Munich, deeply involved in the local tech community, and organizer of daho.am, our own annual developer conference.</li>\n<li>A personal development budget is given to you to use throughout the year for personal growth.</li>\n<li>We have a beautiful office space which is in the city-center, just a 10-minute walk to the nearest Biergarten.</li>\n<li>Want to know more? Check out: about.stylight.com and tech.stylight.com.</li>\n</ul>\n<p>Up for the Challenge?</p>\n<p>Then don’t hesitate and apply today at about.stylight.com/jobs. We look forward to your complete application (CV, cover letter)! Your contact: Carina Meyer.</p>\n",
    "how_to_apply": "<p>Please apply at about.stylight.com/jobs!</p>\n",
    "company_logo": "https://jobs.github.com/rails/active_storage/blobs/eyJfcmFpbHMiOnsibWVzc2FnZSI6IkJBaHBBdUpXIiwiZXhwIjpudWxsLCJwdXIiOiJibG9iX2lkIn19--b29261ac99368f87eb6bc2df80122e7ea213932c/787c4fda-3185-4f0c-8e04-ab47802c6f4a"
  }
]